[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在白色相簿2中，谁的生日是2月14日？",
        "output": "select ?x where { ?x <登场作品> <白色相簿2_（日本LEAF会社制作的十八禁恋爱冒险游戏）> . ?x <生日> \"02-14\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在路人女主的养成方法中，谁的头发是金色的？",
        "output": "select ?x where { ?x <登场作品> <路人女主的养成方法_（丸户史明原作的轻小说）> . ?x <发色> <金色_（色彩之一）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "云雀恭弥的年龄是？",
        "output": "select ?x where { ?y <中文名> \"云雀 恭弥\" . ?y <年龄> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵薇林心如范冰冰主演的经常重播的神剧是？",
        "output": "select ?x where {  <重播神剧> <代表作品> ?x .  ?x <主演> <范冰冰> . ?x <主演> <赵薇_（中国内地女演员、歌手、导演）> . ?x <主演> <林心如> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "夏雨荷的女儿紫薇的结拜姐妹是？",
        "output": "select ?x where {  <夏紫薇> <结拜姐妹> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "秦淮八艳指的是？",
        "output": "select ?x where {  <秦淮八艳_（明末清初秦淮河畔八位名伎）> <本名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国十大贤后是？",
        "output": "select ?x where {  <中国十大贤后> ?y ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有位名妓写出了寻梦欢这样的好作品，她生活在哪个朝代？",
        "output": "select ?x where {  ?y <所处时代> ?x .  <寻梦欢> <作者> ?y .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "娶妻当得阴丽华说的这位皇后葬在哪？",
        "output": "select ?x where {  ?y <典故> <娶妻当得阴丽华> . ?y <陵墓> ?x .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嫁给刘秀的郭皇后原名是？",
        "output": "select ?x where {  <郭皇后_（东汉光武帝皇后）> <主要成就> \"嫁刘秀\" . <郭皇后_（东汉光武帝皇后）> <本名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《众里寻你》是韩红哪张专辑里的歌?",
        "output": "select ?x where { <众里寻你> <所属专辑> ?x. ?x <演唱者> <韩红_（中国大陆音乐人、慈善家）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "久川绫的代表作品有哪些?",
        "output": "select ?x where { <久川绫> <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本的校园和魔法主题漫画有哪些?",
        "output": "select ?x where { ?x <地区> <日本_（日本国）> . ?x <类型> <魔法> . ?x <类型> <校园_（词语概念）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "校园卡的英文名是什么?",
        "output": "select ?x where { <校园卡> <外文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "购买力平价理论的核心观点是什么?",
        "output": "select ?x where { <购买力平价理论> <核心观点> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "主演中有北京外国语大学、北京电影学院和上海戏剧学院毕业生的电视剧有哪些",
        "output": "select ?a where { ?x <毕业院校> <北京外国语大学> . ?y <毕业院校> <北京电影学院> . ?z <毕业院校> <上海戏剧学院> . ?a <主演> ?x . ?a <主演> ?y . ?a <主演> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "袁弘的身高是？",
        "output": "select ?x where { <袁弘> <身高> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯公司的创始人有哪些？",
        "output": "select ?x where { <腾讯> <创始人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于兴平的有限责任公司有哪些?",
        "output": "select ?x where { ?x <总部地点> <兴平_（陕西省咸阳市下辖县级市）> . ?x <公司性质> <有限责任公司> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的高等学府有哪些？",
        "output": "select ?x where { <北京_（中华人民共和国首都）> <高等学府> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京高校的现任校长有哪些?",
        "output": "select ?y where { <北京_（中华人民共和国首都）> <高等学府> ?x . ?x <现任校长> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动物界鸟纲画眉科有哪些生物？",
        "output": "select ?x where { ?x <科> <画眉科> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "台湾山蚂蝗的别称是什么？",
        "output": "select ?x where { <台湾山蚂蝗> <别称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周润发,黄光亮,梁家辉一同主演的粤语电影有？",
        "output": "select ?x where { ?x <主演> <周润发> . ?x <主演> <黄光亮_（香港演员）> . ?x <主演> <梁家辉> . ?x <对白语言> <粤语_（汉藏语系下的语言）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贾月梅毕业院校地址是？",
        "output": "select ?y where { <贾月梅> <毕业院校> ?x . ?x <学校地址> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "设有建筑学院的211工程大学的学校代码是？",
        "output": "select ?y where { ?x <属性> <211工程> . ?x <主要院系> <建筑学院> . ?x <学校代码> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于邮编为341500地区的汉族官员是？",
        "output": "select ?y where { ?x <邮政区码> \"341500\" . ?y <民族> <汉族> . ?y <出生地> ?x . ?y <职业> <政府官员> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发作时间随机的蠕虫病毒是？",
        "output": "select ?x where { ?x <病毒类型> <蠕虫病毒> . ?x <发作时间> <随机> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "河北人创办的企业是？",
        "output": "select ?y where { ?x <出生地> <湖北> . ?y <创始人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "祖籍泉州的诗人创作出的现代诗有？",
        "output": "select ?y where { ?x <籍贯> <泉州> . ?y <作者> ?x . ?y <文学体裁> <现代诗> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "创作过朦胧诗的人有？",
        "output": "select ?y where { ?x <文学体裁> <朦胧诗> . ?x <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "创作过朦胧诗的老师是？",
        "output": "select ?y where { ?x <文学体裁> <朦胧诗> . ?x <作者> ?y . ?y <职业> <教师_（教育工作者）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "62年8月出生的全国劳模有？",
        "output": "select ?x where { ?x <出生日期> \"1962-08\" . ?x <主要成就> \"全国劳动模范\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王后雄和陈国庆合著的书是？",
        "output": "select ?x where { ?x <作者> <王后雄> . ?x <作者> <陈国庆_（内蒙古大学校长）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "用椰汁和南瓜烹饪的汤有？",
        "output": "select ?x where { ?x <主要食材> <椰汁> . ?x <主要食材> <南瓜_（南瓜葫芦科植物）> . ?x <分类> <汤类> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "用西瓜可以制作什么清热去火的饮品是？",
        "output": "select ?x where { ?x <功效> \"清热去火\" . ?x <主要食材> <西瓜_（葫芦科植物）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胡歌的粉丝自称什么？",
        "output": "select ?x where { <胡歌_（中国内地男演员）> <粉丝昵称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平定大小金川,镇压林爽文起义的清朝将领,死后的谥号是?",
        "output": "select ?y where { ?x <主要成就> \"平定大小金川\" . ?x <主要成就> \"镇压林爽文起义\" . ?x <所处时代> <清朝_（中国历史朝代）> . ?x <谥号> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "爱新觉罗·弘历的主要成就",
        "output": "select ?y where { ?x <中文名> \"爱新觉罗·弘历\" . ?x <主要成就> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "爱新觉罗·弘历1792年创作了什么？",
        "output": "select ?y where { ?x <中文名> \"爱新觉罗·弘历\" . ?y <作者> ?x . ?y <出版时间> \"1792\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无毒,味甘,性平的食材",
        "output": "select ?x where { ?x <性味> <无毒> . ?x <性味> <味甘> . ?x <性味> <性平> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "用螃蟹做成的烤箱菜",
        "output": "select ?x where { ?x <主要食材> <螃蟹_（甲壳类动物）> . ?x <分类> <烤箱菜> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红袖添香小说网上有关四张机的小说",
        "output": "select ?x where { <四张机_（北宋中期的一个故事，诗词）> <作者> ?x . ?x <连载网站> <红袖添香小说网> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄蓉是金庸哪部小说里的人物？",
        "output": "select ?x where { ?x <主要人物> <黄蓉_（金庸武侠小说《射雕英雄传》女主角）> . ?x <作者> <金庸> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "渔家傲·彭门道中早起的作者写过的以水龙吟为牌名的词",
        "output": "select ?y where { <渔家傲·彭门道中早起> <作者> ?x . ?y <作者> ?x . ?y <词牌名> \"水龙吟\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "带鱼科的动物一般分布在哪里？",
        "output": "select ?y where { ?x <科> <带鱼科> . ?x <分布区域> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "分布在印度洋的灯笼鱼有？",
        "output": "select ?x where { ?x <目> <灯笼鱼目> . ?x <分布> <印度洋> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Nicholson位于哪个国家？",
        "output": "select ?y where { ?x <外文名> \"Nicholson\" . ?x <地点> ?y . ?y <首都> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "以云杉为州树的州，州长是谁？",
        "output": "select ?y where { ?x <州长> ?y . ?x <州树> \"云杉\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通行西里尔蒙古文的国家有主要有哪些宗教？",
        "output": "select ?y where { ?x <官方文字> \"西里尔蒙古文\" . ?x <主要宗教> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "托尔斯泰的逝世日期是？",
        "output": "select ?y where { ?x <逝世日期> ?y . ?x <别名> \"托尔斯泰\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俄罗斯的现实主义哲学家有？",
        "output": "select ?x where { ?x <国籍> <俄罗斯_（俄罗斯联邦）> . ?x <流派> <现实主义> . ?x <职业> <哲学家_（基础含义）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古希腊有哪些哲学家？",
        "output": "select ?x where { ?x <民族> <古希腊_（爱琴海-色雷斯文明圈的黄金时期）> . ?x <职业> <哲学家_（基础含义）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古希腊哲学家的老师",
        "output": "select ?y where { ?x <民族> <古希腊_（爱琴海-色雷斯文明圈的黄金时期）> . ?x <职业> <哲学家_（基础含义）> . ?y <老师> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李渊的孩子",
        "output": "select ?x where { ?x <父亲> <李渊_（唐朝开国皇帝）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些朝代有庙号为高祖的皇帝？",
        "output": "select ?y where { ?x <庙号> <高祖_（汉语词语）> . ?x <所处时代> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乞力马扎罗山的平均高度是多少？",
        "output": "select ?x where {<乞力马扎罗_（非洲最高山脉）> <平均高度> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "参与第三次十字军东征的国家有哪些？",
        "output": "select ?x where { <第三次十字军东征> <参战方> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神圣罗马帝国建立于哪一年？",
        "output": "select ?x where { <神圣罗马帝国_（历史国家）> <建立时间> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神圣罗马帝国的开国皇帝是谁？",
        "output": "select ?x where { <神圣罗马帝国_（历史国家）> <首任皇帝> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神圣罗马帝国的最后一个皇帝是谁？",
        "output": "select ?x where { <神圣罗马帝国_（历史国家）> <末任皇帝> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《天国王朝》的导演是谁？",
        "output": "select ?x where {<天国王朝_（美国电影）> <导演> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浮世绘名作神奈川冲浪图的作者是谁？",
        "output": "select ?x where{ <神奈川冲浪图> <作者> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本浮世绘大师葛饰北斋逝世于哪一年？",
        "output": "select ?x where{ <葛饰北斋> <逝世日期> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "河南省城市南阳市的邮政编码是多少？",
        "output": "select ?x where{ <南阳_（河南省地级市）> <邮政区码> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "悬疑小说《13个难题》是谁写的？",
        "output": "select ?x where {<13个难题> <作者> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "庞贝古城是哪个国家的旅游胜地？",
        "output": "select ?x where { <庞贝古城_（亚平宁半岛古城）> <所在地> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2010年发生大地震的海地在哪个大洲？",
        "output": "select ?x where { <海地> <所属洲> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有\"狮心王\"之称的皇帝理查一世属于英国的哪个王朝？",
        "output": "select ?x where { <理查一世_（英格兰的传奇国王）> <王室> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "查理曼大帝是哪个国家的皇帝？",
        "output": "select ?x where { <查理曼大帝_（历史人物）> <国籍> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"竹林七贤\"是哪个朝代的名士团体？",
        "output": "select ?x where { <竹林七贤_（中国魏晋时期七位名士）> <生活时代> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "经典动画《星际牛仔》的导演是谁？",
        "output": "select ?x where {<星际牛仔_（1998年日升公司制作的原创动画）> <导演> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "齐桓公的本名是什么？",
        "output": "select ?x where { <齐桓公_（春秋五霸之首）> <本名> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北大方正集团成立于哪一年？",
        "output": "select ?x where { <方正_（北大方正集团）> <成立时间> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "知名朋克摇滚乐队性手枪成立于哪一年？",
        "output": "select ?x where { <性手枪> <成立时间> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大熊座里最亮的星星是哪颗？",
        "output": "select ?x where{ <大熊座> <最亮星> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "旅游胜地巴厘岛面积有多大？",
        "output": "select ?x where{ <巴厘岛_（世界著名旅游岛）> <面积> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界上最小的国家梵蒂冈有多大？",
        "output": "select ?x where{ <梵蒂冈> <国土面积> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "印度的国花是什么？",
        "output": "select ?x where {<印度_（印度共和国）> <国花> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天花的传播途径是什么？",
        "output": "select ?x where {<天花_（一种烈性传染病）> <传播途径> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "典故\"鸿门宴\"出自哪个作者的笔下？",
        "output": "select ?x where{ <鸿门宴_（历史典故）> <出处> ?y. ?y <作者> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "漫画《海贼王》的作者最崇拜哪个漫画家？",
        "output": "select ?x where{ <海贼王_（尾田荣一郎创作的漫画作品）> <作者> ?y. ?y <最崇拜的人物> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手坂本真绫的丈夫是什么职业？",
        "output": "select ?x where{ <坂本真绫> <配偶> ?y. ?y <职业> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小说《红高粱》的作者毕业于哪所大学",
        "output": "select ?x where{ <红高粱_（莫言著名小说）> <作者> ?y. ?y <毕业院校> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《三体》的作者故乡是哪里？",
        "output": "select ?x where{ <三体_（刘慈欣著科幻小说）> <作者> ?y. ?y <出生地> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "导演诺兰和演员休•杰克曼合作的电影有哪些？",
        "output": "select ?x where{ ?x <导演> <诺兰_（英国导演）>. ?x <主演> <休·杰克曼>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "导演渡边信一郎和音乐人菅野洋子合作完成过哪些作品？",
        "output": "select ?x where{ ?x <导演> <渡边信一郎>. ?x <音乐> <菅野洋子>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "温子仁导演的动作片有哪些？",
        "output": "select ?x where{ ?x <导演> <温子仁>. ?x <类型> <动作_（词语解释）>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "给我推荐几部育碧开发的即时战略游戏",
        "output": "select ?x where{ ?x <开发商> <育碧>. ?x <游戏类型> <即时战略游戏>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《天国王朝》的导演是哪个国家的？",
        "output": "select ?x where{ <天国王朝_（美国电影）> <导演> ?y. ?y <国籍> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北美洲有哪些议会制君主立宪制的国家？",
        "output": "select ?x where{?x <所属洲> <北美洲>. ?x <政治体制> <议会制君主立宪制>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非洲有哪些说英语而且信奉新教的国家？",
        "output": "select ?x where{?x <所属洲> <非洲_（世界七大洲之一）>. ?x <官方语言> <英语_（语言）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"麻风王\"鲍德温四世的出生地现在属于哪个国家？",
        "output": "select ?x where{ <鲍德温四世_（耶路撒冷国王）> <出生地> ?y. ?y <所属地区> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "澳大利亚首都的邮编是多少？",
        "output": "select ?x where{ <澳大利亚> <首都> ?y. ?y <邮政区码> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非洲有哪些半总统共和制的国家？",
        "output": "select ?x where{?x <所属洲> <非洲_（世界七大洲之一）>. ?x <政治体制> <半总统共和制>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "推荐一些\"卷福\"本尼迪克特·康伯巴奇出演的动作片",
        "output": "select ?x where{ ?x <主演> <本尼迪克特·康伯巴奇>. ?x <类型> <动作_（词语解释）>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "印度尼西亚的首都有什么别称？",
        "output": "select ?x where{ <印度尼西亚> <首都> ?y. ?y <别名> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "甄子丹出演过哪些美国电影？",
        "output": "select ?x where{?x <主演> <甄子丹>. ?x <制片地区> <美国_（美利坚合众国）>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周星驰和刘德华合作过哪些电影？",
        "output": "select ?x where{?x <主演> <周星驰>. ?x <主演> <刘德华_（中国香港男演员、歌手、词作人）>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《百年孤独》的作者是哪个国家的？",
        "output": "select ?x where{ <百年孤独> <作者> ?y. ?y <国籍> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《海边的卡夫卡》是一部很有趣的小说，它的作者还有哪些代表性作品？",
        "output": "select ?x where{ <海边的卡夫卡_（村上春树创作长篇小说）> <作者> ?y. ?y <代表作品> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "暴雪游戏中的邪恶组织暗影议会的首领是什么种族的？",
        "output": "select ?x where{ <暗影议会> <领袖> ?y. ?y <种族> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家地理杂志是由哪个单位主办的？",
        "output": "select ?x where { <国家地理_（美国国家地理学会官方杂志）> <主办单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "M416突击步枪是由哪个国家制造的？",
        "output": "select ?x where { <m416> <制造国家> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "马化腾的英文名是什么？",
        "output": "select ?x where { <马化腾> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科威特的官方语言是什么？",
        "output": "select ?x where { <科威特> <官方语言> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李易峰毕业于哪个学校？",
        "output": "select ?x where { <李易峰> <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天下霸唱的原名是什么？",
        "output": "select ?x where { <天下霸唱> <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲《爱情是圆的》的原唱是谁？",
        "output": "select ?x where { <爱情是圆的> <歌曲原唱> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们所熟悉的填词人林夕的本名叫什么？",
        "output": "select ?x where { <林夕_（著名填词人）> <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欧洲国家爱尔兰的别称是什么？",
        "output": "select ?x where { <爱尔兰_（爱尔兰共和国）> <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆位于中国的哪个地区？",
        "output": "select ?x where { <重庆_（中华人民共和国直辖市）> <所属地区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们常用的网站知乎的口号是什么？",
        "output": "select ?x where { <知乎> <口号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耐克公司的总部在哪里？",
        "output": "select ?x where { <NIKE> <总部地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汉武帝葬在哪里？",
        "output": "select ?x where { <汉武帝_（汉朝皇帝）> <陵墓> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "爱新觉罗·多尔衮的父亲是谁？",
        "output": "select ?x where { <爱新觉罗·多尔衮> <父亲> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《爱乐之城》是由谁导演的？",
        "output": "select ?x where { <爱乐之城> <导演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开心麻花的宗旨是什么？",
        "output": "select ?x where { <开心麻花> <宗旨> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "说相声的德云社是由谁创办的？",
        "output": "select ?x where { <德云社> <创始人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手李荣浩是在中国的哪个地方出生的？",
        "output": "select ?x where { <李荣浩_（中国内地男歌手）> <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手及演员杨丞琳有多高？",
        "output": "select ?x where { <杨丞琳> <身高> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "木星的公转周期是多长？",
        "output": "select ?x where { <木星_（太阳系八大行星之一）> <公转周期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冥王星是由谁命名的？",
        "output": "select ?x where { <冥王星_（太阳系中的一个天体）> <命名者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冥王星有多重？",
        "output": "select ?x where { <冥王星_（太阳系中的一个天体）> <质量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "已知的最亮的恒星是哪一颗？",
        "output": "select ?x where { <恒星_（天文学词汇）> <已知最亮的> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "已知的最大的恒星是哪一颗？",
        "output": "select ?x where { <恒星_（天文学词汇）> <已知最大的> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冥王星的发现者是哪一天出生的？",
        "output": "select ?x where { <冥王星_（太阳系中的一个天体）> <发现者> ?y. ?y <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大风歌的作者在位多长时间？",
        "output": "select ?x where { <大风_（大风歌）> <作者> ?y. ?y <在位> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "推翻了秦朝并斩蛇起义的是中国历史上哪位皇帝？",
        "output": "select ?x where { ?x <主要成就> \"建立汉朝\". ?x <主要成就> \"斩蛇起义\".}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "易水歌的作者的主要事迹是什么？",
        "output": "select ?x where { <易水歌> <作者> ?y. ?y <主要事迹> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广寒仙子的恋人最为人熟知的事迹是什么？",
        "output": "select ?x where { <广寒仙子_（神话人物）> <恋人> ?y. ?y <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "炎帝最小的女儿有什么故事？",
        "output": "select ?x where { ?y <人物背景> \"炎帝最小的女儿\". ?y <故事> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名的涿鹿之战的指挥官的妻子是谁？",
        "output": "select ?x where { <涿鹿之战> <主要指挥官> ?y. ?y <配偶> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西陵嫘祖的配偶所属部落的标记是什么？",
        "output": "select ?x where { ?y <配偶> <嫘祖>. ?y <部落标记> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本草纲目的作者信仰哪个教派？",
        "output": "select ?x where { <本草纲目_（李时珍撰写药学著作）> <作者> ?y. ?y <信仰> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪吒使用的宝物的外形特点是什么？",
        "output": "select ?x where { <哪吒_（中国古代神话人物）> <宝物> ?y. ?y <外形> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "助周伐纣的神话人物中位列昆仑十二金仙的是谁？",
        "output": "select ?x where { ?x <主要成就> \"助周伐纣\". ?x <地位> \"昆仑十二金仙\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐骑为丹顶鹤并且使用九龙神火罩的神话人物是是谁？",
        "output": "select ?x where { ?x <坐骑> <丹顶鹤_（鹤属鸟类的一种）>. ?x <法宝> <九龙神火罩>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在乾元山金光洞修行的仙人的法宝是什么？",
        "output": "select ?x where { ?y <修行地> <乾元山金光洞>. ?y <法宝> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "申公豹的师兄的本名是什么？",
        "output": "select ?x where { <申公豹_（小说《封神演义》中人物）> <师兄> ?y. ?y <本名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "八景宫灯的所有人都有哪些别称？",
        "output": "select ?x where { <八景宫灯> <所有人> ?y. ?y <别名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西游记中金箍棒和七星剑是由谁制造的？",
        "output": "select ?x where { <金箍棒_（《西游记》中的兵器）> <制造者> ?x. <七星剑_（《西游记》中的兵器）> <制造者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "太上老君是用哪件宝物练出孙悟空的金箍棒的？",
        "output": "select ?x where { ?x <主人> <太上老君_（道教三清道祖）>. ?x <主要成就> \"炼出金箍棒\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西游记中孙悟空所使用的兵器有多重？",
        "output": "select ?x where { <孙悟空_（古典名著《西游记》中的主角）> <兵器> ?y. ?y <重量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在西游记中孙悟空的师父中与天地同寿的是谁？",
        "output": "select ?x where { <孙悟空_（古典名著《西游记》中的主角）> <师父> ?x. ?x <年龄> <天地同寿>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孙悟空的师兄弟中原本住在流沙河的是谁？",
        "output": "select ?x where { <孙悟空_（古典名著《西游记》中的主角）> <师兄弟> ?x. ?x <老家> <流沙河_（名著《西游记》中河流）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玉皇大帝的诞辰俗称什么？",
        "output": "select ?x where { <玉皇大帝> <诞辰> ?y. ?y <俗称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《封神演义》中使用八卦云光帕的人物的坐骑是什么？",
        "output": "select ?x where { ?y <法宝> <八卦云光帕>. ?y <坐骑> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《封神演义》中石矶娘娘的师父使用的功法是什么？",
        "output": "select ?x where { <石矶_（小说《封神演义》人物）> <师父> ?y. ?y <功法> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中南大学所属省份的车牌代码是什么？",
        "output": "select ?x ?y where { <中南大学> <所属地区> ?x. ?x <车牌代码> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《九歌·云中君》的作者生在哪个国家？",
        "output": "select ?x ?y where { <九歌·云中君> <作者> ?x. ?x <出生地> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "是谁写下了\"亦余心之所向兮，虽九死其尤未悔\"",
        "output": "select ?x where { <亦余心之所向兮，虽九死其尤未悔> <作者> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "于小彤饰演了红楼梦中的哪个角色？",
        "output": "select ?x where { ?x <登场作品> <红楼梦_（中国古典长篇小说四大名著之一）>.?x <饰演> <于小彤>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有东方之珠美称的地方的政治体制是什么？",
        "output": "select ?y where { <东方之珠_（香港美称）> <行政区类别> ?x.?x <政治体制> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2008年发行专辑《心跳》的歌手毕业于哪一所院校？",
        "output": "select ?y where { <心跳_（王力宏2008年发行专辑）> <专辑歌手> ?x. ?x <毕业院校> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得第47届台湾电视金钟奖戏剧节目女主角奖的演员有多高？",
        "output": "select ?y where { ?x <主要成就> \"第47届台湾电视金钟奖戏剧节目女主角奖\".?x <身高> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由徐克导演，于2010年出品的那部电影主演都有谁？",
        "output": "select ?y where { ?x <导演> <徐克_（香港电影导演、编剧、监制、演员）>.?x <出品时间> \"2010\" . ?x <主演> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "ROMANCE OF OUR PARENTS的首播平台是？",
        "output": "select ?y where { ?x <外文名> \"ROMANCE OF OUR PARENTS\". ?x <首播平台> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华盛顿大学的吉祥物原产地是哪里？",
        "output": "select ?y where { <华盛顿大学_（华盛顿大学-西雅图）> <吉祥物> ?x. ?x <原产地> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲《最重要的决定》的原唱歌手信仰什么宗教？",
        "output": "select ?y where { <最重要的决定> <歌曲原唱> ?x. ?x <信仰> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著有《送友人弃官游江左》的那位诗人又有什么别名？",
        "output": "select ?y where { <送友人弃官游江左> <作者> ?x. ?x <别名> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《咱们结婚吧》的哪一位主演毕业于中国劳动关系学院？",
        "output": "select ?x where { <咱们结婚吧_（2013年高圆圆、黄海波主演电视剧）> <主演> ?x. ?x <毕业院校> <中国劳动关系学院>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高圆圆主演，黄健中执导的作品有？",
        "output": "select ?x where { ?x <主演> <高圆圆>. ?x <导演> <黄健中_（著名导演）>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别称为太岁的行星是谁发现的？",
        "output": "select ?y where { <太岁_（中国古代天文学名词）> <别称> ?x. ?x <发现者> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为月亮湖的湖泊属于哪个国家？",
        "output": "select ?y where { ?x <别名> \"北海、月亮湖\". ?x <所属国家> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Giraffe是什么的象征物？",
        "output": "select ?y where { ?x <英文名称> \"Giraffe\". ?y<象征物> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著有《三吏》的诗人是哪一年逝世的？",
        "output": "select ?y where { ?x <主要作品> <三吏> . ?x <去世时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第九届金鹰节金鹰女神是哪个民族的？",
        "output": "select ?y where { ?x <主要成就> \"第九届 金鹰电视艺术节金鹰女神\" . ?x <民族> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "改革三省六部制度的帝王在位期间的年号是？",
        "output": "select ?y where { ?x <主要成就> \"改革 三省六部\" . ?x <年号> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张汉卿的妻子是？",
        "output": "select ?y where { ?x <别名> \"双喜、小六子、张汉卿、张少帅\". ?y <丈夫> <张学良_（国民革命军将领）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称做小燕子的女演员官方体重是多少呀？",
        "output": "select ?y where { ?x <别名> \"小燕子、漂亮\".?x <体重> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄渤的经纪公司是？",
        "output": "select ?y where { <黄渤> <经纪公司> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪位男演员获得了第19届华鼎奖最佳男主角？",
        "output": "select ?y where { ?y<主要成就> \"第19届华鼎奖最佳男主角\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "主持人柴静有哪些作品？",
        "output": "select ?y where { <柴静> <代表作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大家一般怎么称呼演员周迅？",
        "output": "select ?y where { <周迅_（中国内地女演员、歌手）> <别名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄贯中毕业于哪一所高校呢 ？",
        "output": "select ?y where { <黄贯中> <毕业院校> ?y . }"
    }
]