[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "RNA病毒由什么组成？",
        "output": "select ?x where { ?y <标签> \"RNA病毒\". ?y <组成> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "SARS的传播途径是什么？",
        "output": "select ?x where { <SARS> <传播途径> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "N95口罩可用什么替代？",
        "output": "select ?x where { ?y <标签> \"N95口罩\". ?y <替代> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳、鼻、咽拭子细菌培养在临床上有何意义？",
        "output": "select ?x where { ?y <标签> \"耳、鼻、咽拭子细菌培养\". ?y <临床意义> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规的一般参考值是多少？",
        "output": "select ?x where { ?y <标签> \"血常规\". ?y <参考值> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是血常规？",
        "output": "select ?x where { ?y <标签> \"血常规\". ?y <简介概述> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2019-nCoV的疑似宿主是什么？",
        "output": "select ?x where { ?y <标签> \"2019-nCoV\". ?y <疑似宿主> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蔡崇信和彭蕾共同创造了哪家企业？",
        "output": "select ?x where { ?x <企业创始人> <蔡崇信> . ?x <企业创始人> <彭蕾> . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《价格、市场与企业家》该书的作者什么时候出生？",
        "output": "select ?y where { <价格、市场与企业家> <作者> ?x. ?x <出生日期> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于牛津大学的教授？",
        "output": "select ?x where { ?x <职业> <教授_（教师职称）>. ?x <毕业院校> <牛津大学>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人文经济学会的人都来自哪些国家？",
        "output": "select ?y where { <人文经济学会> <成员> ?x. ?x <国籍> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林正义出生在哪？",
        "output": "select ?y where { ?x <别名> \"林正义\". ?x <出生地> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福建的河流里面可以捕获哪些鱼？",
        "output": "select ?y where { <福建> <主要河流> ?x. ?y <分布区域> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福建的河流里面可以捕获哪些鱼，用拉丁文表示？",
        "output": "select ?z where { <福建> <主要河流> ?x. ?y <分布区域> ?x. ?y <拉丁学名> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "瑞士有哪些足球运动员？",
        "output": "select ?x where { ?x <国籍> <瑞士>. ?x <运动项目> <足球>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《棒球大联盟》是哪个国家的漫画家画的？",
        "output": "select ?y where { <棒球大联盟_（满田拓也的漫画作品）> <作者> ?x . ?x <国籍> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "作品连载在《周刊少年Sunday》的漫画家都来自哪些国家？",
        "output": "select distinct ?z where { ?x <连载杂志> <周刊少年Sunday> . ?x <作者> ?y . ?y <国籍> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "作品与《AKB48杀人事件》连载在同一本杂志的作者都来自哪些国家？",
        "output": "select distinct ?z where { <AKB48杀人事件> <连载杂志> ?book. ?x <连载杂志> ?book . ?x <作者> ?y . ?y <国籍> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由木村纯一担任制片人，由麦原伸太郎担任编剧的电影是由什么公司出品的？",
        "output": "select ?y where { ?x <制片人> <木村纯一>. ?x <编剧> <麦原伸太郎>. ?x <出品公司> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "David Ricardo什么时候出生？",
        "output": "select ?y where { ?x <外文名> \"David Ricardo\". ?x <出生日期> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与David Ricardo相同国籍的作家？",
        "output": "select ?author where { ?x <外文名> \"David Ricardo\". ?x <国籍>  ?y. ?author <国籍> ?y. ?book <作者> ?author. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哈罗公学的毕业生都来自什么国家",
        "output": "select ?y where { ?x <毕业院校> <哈罗公学> . ?x <国籍>  ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伊顿公学的毕业生都从事了什么职业",
        "output": "select distinct ?y where { ?x <职业> ?y. ?x <毕业院校> <伊顿公学>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三个代表重要思想的提出人都在什么出版社上出过书？",
        "output": "select distinct ?z where { <三个代表重要思想> <提出人> ?x. ?y <作者> ?x. ?y <出版社> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《摆脱贫困》的作者写过哪些七言诗？",
        "output": "select ?y where { <摆脱贫困> <作者> ?x. ?y <作者> ?x. ?y <文学体裁> <七言律诗>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得诺贝尔经济学奖，毕业于普林斯顿大学的人提出过什么定理？",
        "output": "select ?y where { ?x <毕业院校> <普林斯顿大学> . ?x <主要成就> \"诺贝尔经济学奖\". ?y <类型> <定理_（逻辑学名词）>. ?y <提出> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "牛顿的代表作中与物理学有关的是？",
        "output": "select ?x where { <牛顿_（艾萨克·牛顿）> <代表作品> ?x. <物理_（物理学）> <相关著作> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "致力于揭示人力资本投资和智力开发的学科，其实质是？",
        "output": "select ?y where { ?x <实质> ?y. ?x <研究任务> \"揭示人力资本投资和智力开发\" } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "传染科里面看哪些可以经过飞沫传播的病？",
        "output": "select ?x where { ?x <传播途径> \"飞沫传播\". ?x <就诊科室> \"传染科\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人感染了天花，哪里会出现症状？",
        "output": "select ?x where { <天花病毒> <发病部位> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现了哪些症状要去呼吸科看？并且该病无传染性",
        "output": "select ?y where { ?x <临床症状> ?y. ?x <传染性> \"否\". ?x <医学专科> \"呼吸科\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何防范新冠病毒",
        "output": "select ?y where { <2019冠状病毒病（COVID-19）> <防护手段> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些病的并发症无传染性？",
        "output": "select ?a where { ?a <主要病因>\t?b. ?b <并发症>?c. ?c\t<传染性> \"无\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "预防流行性感冒的药品名？",
        "output": "select ?d where { <流行性感冒>\t<临床症状> ?b. ?b <预防> ?c. ?c <商品名> ?d. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "A族链球菌主要会在哪些人群中引发疾病？",
        "output": "select ?a ?b ?c ?d where{ <A族链球菌> <引起> ?b. ?b <感染疾病> ?c. ?c <多发群体> ?d. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些症状预示着疾病可能经由呼吸道感染？",
        "output": "select ?a where{ ?a <涉及疾病> ?b. ?b <传播途径> <呼吸道感染>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "抗原呈递细胞的存活期？",
        "output": "select ?d where{ <抗原呈递细胞> <类型> ?b. ?b <免疫细胞> ?c. ?c <存活期> ?d. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洛匹那韦会引发什么副作用？",
        "output": "select  ?b where{ <洛匹那韦> <副作用> ?b. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得真菌性皮肤病的原因是？",
        "output": "select ?b where{ <真菌性皮肤病> <常见病因> ?b. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "寒湿郁肺，推荐一个中医方子？",
        "output": "select  ?d where{ <轻型：寒湿郁肺> <推荐处方> ?d. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "预防新冠病毒，我们需要什么物资？",
        "output": "select ?d where{ <新型冠状病毒（SARS-CoV-2）> <引发> ?b. ?b <防护手段> ?c. ?c <防护工具> ?d. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国药集团有多少员工",
        "output": "select ?c where{ <中国医药集团有限公司> <员工数> ?c. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "利福平有什么给药途径",
        "output": "select ?c where{ <利福平> <药品名称> ?b. ?b <给药途径> ?c. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病患出现发热以及食欲下降这些症状时，会与什么病有关？",
        "output": "select ?x where { ?x <涉及症状> <发热> . ?x <涉及症状> <食欲下降> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病症反应表现为食欲下降以及疲劳时，是得了哪种疾病？",
        "output": "select ?x where { ?x <涉及症状> <食欲下降> . ?x <涉及症状> <疲劳> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及到疲劳以及多饮的症状？",
        "output": "select ?x where { ?x <涉及症状> <疲劳> . ?x <涉及症状> <多饮> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现呼吸困难以及咳嗽可能是得了什么病？",
        "output": "select ?x where { ?x <症状> <呼吸困难> . ?x <症状> <咳嗽> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由病毒造成有咳嗽症状是属于什么病？",
        "output": "select ?x where { ?x <症状> <咳嗽> . ?x <肇因> <病毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感染了细菌和病毒可能与什么疾病有关？",
        "output": "select ?x where { ?x <肇因> <病毒> . ?x <肇因> <细菌> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么疾病会伴随胸膜粘连和盗汗的症状？",
        "output": "select ?x where { ?x <涉及症状> <胸膜粘连> . ?x <涉及症状> <盗汗> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病原体是2019-nCoV的肺炎叫什么？",
        "output": "select ?x where { ?x <病原体> <2019-nCoV> . ?x <类型> <肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么病隶属于胸部外科且伴随呼吸窘迫综合症？",
        "output": "select ?x where { ?x <科室> <胸部外科> . ?x <涉及症状> <呼吸窘迫综合症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及到乏力以及大小便失禁的症状？",
        "output": "select ?x where { ?x <涉及症状> <乏力> . ?x <涉及症状> <大小便失禁> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与大小便失禁以及汗毛过多症状相关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <大小便失禁> . ?x <涉及症状> <汗毛过多> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么病会与汗毛过多以及坐骨大小孔区出现压痛症状有关？",
        "output": "select ?x where { ?x <涉及症状> <汗毛过多> . ?x <涉及症状> <坐骨大小孔区出现压痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低热有没有传染性？",
        "output": "select ?x where { <低热> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防低热的发生？",
        "output": "select ?x where { <低热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是低热？",
        "output": "select ?x where { <低热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高热的发病部位在哪？",
        "output": "select ?x where { <高热> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么预防高热？",
        "output": "select ?x where { <高热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是高热？",
        "output": "select ?x where { <高热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭有没有传染性？",
        "output": "select ?x where { <呼吸衰竭> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭的发病部位在哪？",
        "output": "select ?x where { <呼吸衰竭> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭该如何预防？",
        "output": "select ?x where { <呼吸衰竭> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭患者有哪些临床表现？",
        "output": "select ?x where { <呼吸衰竭> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭的病因是什么？",
        "output": "select ?x where { <呼吸衰竭> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭的MeSH编码是什么？",
        "output": "select ?x where { <呼吸衰竭> <MeSH> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭的ICD10编码是什么？",
        "output": "select ?x where { <呼吸衰竭> <ICD10> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭的ICD9CM编码是多少？",
        "output": "select ?x where { <呼吸衰竭> <ICD9CM> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭的eMedicine是什么？",
        "output": "select ?x where { <呼吸衰竭> <eMedicine> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭在医学专科中属于什么科？",
        "output": "select ?x where { <呼吸衰竭> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭的DiseasesDB是什么？",
        "output": "select ?x where { <呼吸衰竭> <DiseasesDB> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防肺实变的发生？",
        "output": "select ?x where { <肺实变> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺实变是怎么诊断的？",
        "output": "select ?x where { <肺实变> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不明原因发热具有传染性吗？",
        "output": "select ?x where { <不明原因发热> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防不明原因发热的发生？",
        "output": "select ?x where { <不明原因发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断是不明原因发热？",
        "output": "select ?x where { <不明原因发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽是否具有传染性？",
        "output": "select ?x where { <咳嗽> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽的发病部位在哪？",
        "output": "select ?x where { <咳嗽> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防咳嗽？",
        "output": "select ?x where { <咳嗽> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽的病因是什么？",
        "output": "select ?x where { <咳嗽> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽的ICD10编码是多少？",
        "output": "select ?x where { <咳嗽> <ICD10> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽的ICD9编码是什么？",
        "output": "select ?x where { <咳嗽> <ICD9> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽要如何诊断？",
        "output": "select ?x where { <咳嗽> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恶寒发热要如何预防？",
        "output": "select ?x where { <恶寒发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恶寒发热是怎么诊断出来的？",
        "output": "select ?x where { <恶寒发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "倦怠情绪怎么预防？",
        "output": "select ?x where { <倦怠> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是倦怠？",
        "output": "select ?x where { <倦怠> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脘痞该怎么预防？",
        "output": "select ?x where { <脘痞> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脘痞是怎么诊断出来的？",
        "output": "select ?x where { <脘痞> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防咽干的发生？",
        "output": "select ?x where { <咽干> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诊断咽干的依据有哪些？",
        "output": "select ?x where { <咽干> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防便秘？",
        "output": "select ?x where { <便秘> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "便秘有哪些临床表现？",
        "output": "select ?x where { <便秘> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "便秘的病因是什么？",
        "output": "select ?x where { <便秘> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是便秘？",
        "output": "select ?x where { <便秘> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喘憋该如何预防？",
        "output": "select ?x where { <喘憋> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄痰该如何预防？",
        "output": "select ?x where { <黄痰> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄痰是怎么诊断的？",
        "output": "select ?x where { <黄痰> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹胀会不会有传染性？",
        "output": "select ?x where { <腹胀> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防腹胀？",
        "output": "select ?x where { <腹胀> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹胀有哪些临床表现？",
        "output": "select ?x where { <腹胀> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹胀的病因是什么？",
        "output": "select ?x where { <腹胀> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气促可以怎么预防？",
        "output": "select ?x where { <气促> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断气促？",
        "output": "select ?x where { <气促> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气喘要做什么预防措施？",
        "output": "select ?x where { <气喘> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气喘有哪些临床表现？",
        "output": "select ?x where { <气喘> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气喘是怎么诊断出来的？",
        "output": "select ?x where { <气喘> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "身热有什么预防方法？",
        "output": "select ?x where { <身热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是身热？",
        "output": "select ?x where { <身热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防苔黄腻？",
        "output": "select ?x where { <苔黄腻> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断苔黄腻？",
        "output": "select ?x where { <苔黄腻> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "烦躁心理怎么预防？",
        "output": "select ?x where { <烦躁> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断是烦躁心理？",
        "output": "select ?x where { <烦躁> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气短的病因是怎样的？",
        "output": "select ?x where { <气短> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气短该做什么预防工作？",
        "output": "select ?x where { <气短> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气短有怎样的临床表现？",
        "output": "select ?x where { <气短> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气短要如何诊断？",
        "output": "select ?x where { <气短> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无力状态该如何预防？",
        "output": "select ?x where { <无力> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断无力病症？",
        "output": "select ?x where { <无力> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防长期使用糖皮质激素导致的损害？",
        "output": "select ?x where { <长期使用糖皮质激素导致的损害> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断是长期使用糖皮质激素导致的损害？",
        "output": "select ?x where { <长期使用糖皮质激素导致的损害> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "癌性发热现象如何预防？",
        "output": "select ?x where { <癌性发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断是癌性发热？",
        "output": "select ?x where { <癌性发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不规则发热该做哪些预防措施？",
        "output": "select ?x where { <不规则发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不规则发热是怎么诊断的？",
        "output": "select ?x where { <不规则发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻前庭发热、干燥、痒以及触痛该怎么预防？",
        "output": "select ?x where { <鼻前庭发热、干燥、痒以及触痛> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断鼻前庭发热、干燥、痒以及触痛？",
        "output": "select ?x where { <鼻前庭发热、干燥、痒以及触痛> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防产后发热现象？",
        "output": "select ?x where { <产后发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断产后发热病症？",
        "output": "select ?x where { <产后发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴关节肿痛该如何预防？",
        "output": "select ?x where { <发热伴关节肿痛> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴关节肿痛是怎么诊断的？",
        "output": "select ?x where { <发热伴关节肿痛> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴出血要怎么去预防？",
        "output": "select ?x where { <发热伴出血> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断发热伴出血？",
        "output": "select ?x where { <发热伴出血> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴咳嗽、咯痰、胸痛有哪些预防措施？",
        "output": "select ?x where { <发热伴咳嗽、咯痰、胸痛> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴寒战该怎么预防？",
        "output": "select ?x where { <发热伴寒战> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴有皮疹有怎样的预防工作？",
        "output": "select ?x where { <发热伴有皮疹> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断发热伴有皮疹？",
        "output": "select ?x where { <发热伴有皮疹> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么预防发热伴有腹痛、腹泻、恶心、呕吐？",
        "output": "select ?x where { <发热伴有腹痛、腹泻、恶心、呕吐> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴淋巴结肿大、并伴触痛有哪些预防措施？",
        "output": "select ?x where { <发热伴淋巴结肿大、并伴触痛> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是发热伴淋巴结肿大、并伴触痛？",
        "output": "select ?x where { <发热伴淋巴结肿大、并伴触痛> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴眼睛充血该怎么预防？",
        "output": "select ?x where { <发热伴眼睛充血> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹痛，发热及黄疸该怎么预防？",
        "output": "select ?x where { <腹痛，发热及黄疸> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断腹痛，发热及黄疸？",
        "output": "select ?x where { <腹痛，发热及黄疸> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性发热是否具有传染性？",
        "output": "select ?x where { <非感染性发热> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么预防非感染性发热？",
        "output": "select ?x where { <非感染性发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性发热有什么临床表现？",
        "output": "select ?x where { <非感染性发热> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断非感染性发热？",
        "output": "select ?x where { <非感染性发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防咯血伴发热？",
        "output": "select ?x where { <咯血伴发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咯血伴发热诊断依据有什么？",
        "output": "select ?x where { <咯血伴发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感染性发热的发病部位在哪？",
        "output": "select ?x where { <感染性发热> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防感染性发热？",
        "output": "select ?x where { <感染性发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感染性发热有哪些临床表现？",
        "output": "select ?x where { <感染性发热> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断感染性发热？",
        "output": "select ?x where { <感染性发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断全身过敏和发热皮疹关节痛？",
        "output": "select ?x where { <全身过敏和发热皮疹关节痛> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "术后发热有哪些预防措施？",
        "output": "select ?x where { <术后发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断术后发热？",
        "output": "select ?x where { <术后发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防中枢性发热？",
        "output": "select ?x where { <中枢性发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中枢性发热有哪些临床表现？",
        "output": "select ?x where { <中枢性发热> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断中枢性发热？",
        "output": "select ?x where { <中枢性发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防周期性畏寒发热出汗热退症状？",
        "output": "select ?x where { <周期性畏寒发热出汗热退症状> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿发热是否具有传染性？",
        "output": "select ?x where { <小儿发热> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿发热有哪些预防措施？",
        "output": "select ?x where { <小儿发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断小儿发热？",
        "output": "select ?x where { <小儿发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长期发热有怎样的预防措施？",
        "output": "select ?x where { <长期发热> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断长期发热？",
        "output": "select ?x where { <长期发热> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防宫缩乏力？",
        "output": "select ?x where { <宫缩乏力> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断宫缩乏力？",
        "output": "select ?x where { <宫缩乏力> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么预防疲倦乏力？",
        "output": "select ?x where { <疲倦乏力> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断疲倦乏力？",
        "output": "select ?x where { <疲倦乏力> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防下肢乏力？",
        "output": "select ?x where { <下肢乏力> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢肿胀和乏力有哪些预防措施？",
        "output": "select ?x where { <下肢肿胀和乏力> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断下肢肿胀和乏力？",
        "output": "select ?x where { <下肢肿胀和乏力> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防肢体乏力？",
        "output": "select ?x where { <肢体乏力> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断肢体乏力病症？",
        "output": "select ?x where { <肢体乏力> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刺激性干咳该怎么预防？",
        "output": "select ?x where { <刺激性干咳> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断刺激性干咳？",
        "output": "select ?x where { <刺激性干咳> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿干咳该怎么预防？",
        "output": "select ?x where { <小儿干咳> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断小儿干咳？",
        "output": "select ?x where { <小儿干咳> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防急性呼吸困难？",
        "output": "select ?x where { <急性呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断急性呼吸困难？",
        "output": "select ?x where { <急性呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽伴呼吸困难该如何预防？",
        "output": "select ?x where { <咳嗽伴呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诊断咳嗽伴呼吸困难有哪些依据？",
        "output": "select ?x where { <咳嗽伴呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发作性呼吸困难有什么预防措施？",
        "output": "select ?x where { <发作性呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发作性呼吸困难是如何诊断的?",
        "output": "select ?x where { <发作性呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防肺源性呼吸困难？",
        "output": "select ?x where { <肺源性呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断肺源性呼吸困难？",
        "output": "select ?x where { <肺源性呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防劳力性呼吸困难？",
        "output": "select ?x where { <劳力性呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "劳力性呼吸困难的病因是什么？",
        "output": "select ?x where { <劳力性呼吸困难> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "劳力性呼吸困难有什么诊断依据？",
        "output": "select ?x where { <劳力性呼吸困难> <诊断> ?x. }"
    }
]