[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "白垩纪时霸王龙曾分布在哪些地方？",
        "output": "select ?x where { <霸王龙_（已灭绝的白垩纪晚期爬行动物）> <分布区域> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门大学校歌是？",
        "output": "select ?x where { <厦门大学> <校歌> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《骄儿诗》是谁写的？",
        "output": "select ?x where { <骄儿诗> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "茶是什么时候开始兴起的？",
        "output": "select ?x where { <茶_（饮品）> <兴起时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金庸的本名是什么？",
        "output": "select ?x where { <金庸> <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "AK-47突击步枪使用多大口径的子弹？",
        "output": "select ?x where { <AK-47突击步枪> <口径> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当年都有谁教过体操王子李宁？",
        "output": "select ?x where { <李宁_（体操王子）> <教练> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "复旦大学的现任校长是谁？",
        "output": "select ?x where { <复旦大学> <现任校长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京沪高铁有多长？",
        "output": "select ?x where { <京沪高速铁路> <里程> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "熊猫是熊还是猫？",
        "output": "select ?x where { <熊猫_（哺乳动物）> <科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肯德基的官网是什么？",
        "output": "select ?x where { <肯德基> <官网> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "音乐之都是哪个城市？",
        "output": "select ?x where { ?x <别名> \"音乐之都，\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国东海的起止点一般是指？",
        "output": "select ?x where { <东海_（常规东海、中国东海和东中国海）> <习称东海> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "网络游戏的传播媒介是？",
        "output": "select ?x where { <网络游戏_（联网进行的多人电子游戏）> <传输媒介> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "初唐四杰分别是谁？",
        "output": "select ?x where { <初唐四杰> <人物> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现存的社会主义国家有哪些？",
        "output": "select ?x where { <社会主义国家> <国家> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郭沫若的原名和字号是什么？",
        "output": "select ?x where { <郭沫若> <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥巴马都从事过什么职业？",
        "output": "select ?x where { <侯赛因_（美国总统）> <职业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "一打是指多少个？",
        "output": "select ?x where { <一打> <含义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘涛的老公是谁？",
        "output": "select ?y where { <刘涛_（中国内地女演员）> <丈夫> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "传说中国的文字是谁发明的？",
        "output": "select ?x where { ?x <主要成就> \"原始象形文字的创造者\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影钢铁侠在哪里取景拍摄？",
        "output": "select ?x where { <Ironman_（美国2008年小罗伯特·唐尼主演电影）> <拍摄地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "棉花糖在英语中怎么讲？",
        "output": "select ?x where { <棉花糖_（糖果）> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钱钟书的代表作有哪些？",
        "output": "select ?x where { <钱钟书> <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "许渊冲翻译过哪些作品？",
        "output": "select ?x where { ?x <译者> <许渊冲> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼩鼱的天敌是什么？",
        "output": "select ?x where { <鼩鼱> <天敌> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拜占庭帝国是哪一年建立的？",
        "output": "select ?x where { <拜占庭帝国> <建立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洋务运动的结果？",
        "output": "select ?x where { <洋务运动> <结果> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "史诗《伊利亚特》的作者是谁？",
        "output": "select ?x where { <伊利亚特_（《荷马史诗》之一）> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "爱伦·坡的主要成就是什么？",
        "output": "select ?y where { <埃德加·爱伦·坡> <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "复旦大学的主要奖项有哪些？",
        "output": "select ?x where { <复旦大学> <主要奖项> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "门捷列夫在什么时候公布了元素周期律？",
        "output": "select ?x where { <元素周期表_（化学元素列表）> <发明日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "加拿大的首都是哪里？",
        "output": "select ?x where { <加拿大_（北美洲国家）> <首都> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新加坡的国际机场有哪些？",
        "output": "select ?x where { <新加坡> <国际机场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "输入东坡先生字什么？",
        "output": "select ?x where { <苏轼_（北宋文学家）> <字号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "化妆品牌薇姿出自哪国？",
        "output": "select ?x where { <薇姿> <产地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "男朋友跟我说他感到\"累觉不爱\"，他到底是什么意思？",
        "output": "select ?y where { <累觉不爱_（网络词汇）> <释义> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西里斯的葡萄酒有什么特点？",
        "output": "select ?x where { <西里斯> <葡萄酒特点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "剑桥大学的学院有哪些？",
        "output": "select ?x where { <剑桥大学> <主要院系> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "八宝山的海拔？",
        "output": "select ?x where { <八宝山_（北京八宝山）> <海拔> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "首位登上过时代周刊封面的华人女歌手？",
        "output": "select ?x where { ?x <主要成就> \"首位登上时代周刊封面的华人歌手\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "联合国五大常任理事国有哪些？",
        "output": "select ?x where { <联合国_（国际组织）> <常任理事国> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "饮品养乐多又叫什么？",
        "output": "select ?y where { <养乐多> <别名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学是一所什么类型的学校？",
        "output": "select ?x where { <清华大学> <学校类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐朝的选官制度？",
        "output": "select ?x where { <唐朝_（中国历史朝代）> <选官制度> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哈萨克斯坦人主要是什么民族？",
        "output": "select ?x where { <哈萨克斯坦> <主要民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神厨小福贵有多少集？",
        "output": "select ?x where { <神厨小福贵> <集数> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神厨小福贵的出品人是谁？",
        "output": "select ?x where { <神厨小福贵> <出品人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你知道法语的类别吗？",
        "output": "select ?x where { <法语> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第一次工业革命的主要国家有哪些？",
        "output": "select ?x where { <第一次工业革命> <主要国家> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "爱伦·坡出生在哪个城市？",
        "output": "select ?y where { <埃德加·爱伦·坡> <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "前赤壁赋的作者？",
        "output": "select ?x where { <前赤壁赋> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大流士三世是哪个帝国的皇帝？",
        "output": "select ?x where { <大流士三世_（波斯帝国末代君主）> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手杨丞琳毕业于？",
        "output": "select ?y where { <杨丞琳> <毕业院校> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小说《鬼吹灯》的作者是谁？",
        "output": "select ?x where { <鬼吹灯_（天下霸唱创作小说）> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川大学的地址是哪里？",
        "output": "select ?x where { <四川大学> <学校地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "埃及的英文全名是什么？",
        "output": "select ?x where { <埃及> <英文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "荀子主张\"人性本恶\"，那你知道性善论是谁提出的吗？",
        "output": "select ?x where { <性善论> <提出者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "数据库在哪一年产生？",
        "output": "select ?y where { <数据库> <产生时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "范冰冰多高？",
        "output": "select ?x where { <范冰冰> <身高> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "潭柘寺何时建造？",
        "output": "select ?x where { <潭柘寺> <创建年代> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林清玄的外文名是什么？",
        "output": "select ?x where { <林清玄> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冥王星的外文名是什么？",
        "output": "select ?x where { <冥王星_（太阳系中的一个天体）> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "查士丁尼出生在哪里？",
        "output": "select ?x where { <查士丁尼皇帝> <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "微软公司有多少员工？",
        "output": "select ?x where { <微软> <员工数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小沈阳媳妇是谁？",
        "output": "select ?x where { <小沈阳> <妻子> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "足球运动员恩科诺惯用哪支脚？",
        "output": "select ?x where { <恩科诺> <惯用脚> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柏拉图的著名哲学主张是？",
        "output": "select ?x where { <柏拉图_（古希腊哲学家）> <主张> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九叶诗派的主要成员有哪些？",
        "output": "select ?x where { <九叶诗派> <主要成员> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你知道王老吉的配方吗？",
        "output": "select ?x where { <王老吉_（王老吉凉茶）> <主要原料> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁首次实现了中国的首次统一？",
        "output": "select ?x where { ?x <主要成就> \"首次统一\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "博尔赫斯是什么民族？",
        "output": "select ?y where { <豪尔赫·路易斯·博尔赫斯_（阿根廷作家）> <民族> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小罗伯特唐尼是什么血型？",
        "output": "select ?x where { <小罗伯特·唐尼> <血型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动漫形象皮卡丘出自于哪部作品？",
        "output": "select ?x where { <皮卡丘> <登场作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问孔子的主要作品有哪些？",
        "output": "select ?x where { <孔子_（儒家学派创始人）> <主要作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "制作面包需要哪些原材料啊？",
        "output": "select ?x where { <面包> <主要食材> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慈禧的名字是什么？",
        "output": "select ?x where { <慈禧太后_（清朝晚期重要政治人物）> <中文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古时候的一个时辰在现在是多长时间？",
        "output": "select ?x where { <时辰> <换算> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "告诉我杰尼龟的性别比例？",
        "output": "select ?x where { <杰尼龟> <性别比例> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苻坚是哪个国家的统治者？",
        "output": "select ?x where { <苻坚> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "4-甲基苯磺酸钾的英文名是什么？",
        "output": "select ?x where { <4-甲基苯磺酸钾> <英文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "编织鞋的优点是什么？",
        "output": "select ?x where { <编织鞋> <优点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "闰年的时间有什么规律？",
        "output": "select ?x where { <闰年_（历法中的名词）> <置闰法则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "元宵节都有哪些风俗活动？",
        "output": "select ?x where { <元宵节_（中国传统节日）> <节日活动> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贺龙体育馆地处哪座城市？",
        "output": "select ?x where { <贺龙体育馆> <所属城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "珠穆朗玛峰的最高海拔为多少？",
        "output": "select ?x where { <珠穆朗玛峰_（世界最高峰）> <最高海拔> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王菲的《催眠》收录在哪张专辑？",
        "output": "select ?x where { <催眠_（王菲演唱歌曲）> <所属专辑> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐代女诗人薛涛于哪年去世？",
        "output": "select ?x where { <薛涛_（唐代女诗人）> <去世时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有什么数学方面的著作？",
        "output": "select ?x where { <数学_（学科）> <相关著作> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "澳大利亚的悉尼有什么著名景点？",
        "output": "select ?x where {<悉尼_（澳大利亚新南威尔士州首府）> <著名景点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《我是奋青》的票房是多少？",
        "output": "select ?x where { <我是奋青> <票房> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老舍原名是什么？",
        "output": "select ?x where { <老舍> <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被誉为\"泰国的珍珠\"的是哪个地方？",
        "output": "select ?x where { ?x <别名> \"泰国的珍珠\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅艳芳名下有哪个个人基金？",
        "output": "select ?y where { <梅艳芳> <个人基金> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧《冰与火之歌》在哪里拍摄？",
        "output": "select ?x where { <冰与火之歌_（美国HBO电视台制作的电视剧）> <拍摄地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "勾股定理是何时提出的？",
        "output": "select ?x where { <勾股定理> <提出时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川大学的现任校长是谁？",
        "output": "select ?x where { <四川大学> <现任校长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柳絮是柳树的哪一个器官？",
        "output": "select ?x where { <柳絮_（基本概念）> <器官> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问华南虎分布在哪些区域？",
        "output": "select ?y where { <华南虎_（中国特有虎亚种）> <分布区域> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王选在哪里毕业的？",
        "output": "select ?x where { <王选_（中国科学院院士、国家最高科学技术奖获得者）> <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《全新版大学英语》有多少页？",
        "output": "select ?x where { <全新版大学英语> <页数> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "莎士比亚写过哪些著作呢？",
        "output": "select ?x where { <莎士比亚_（欧洲文艺复兴时期戏剧家）> <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "菠萝有什么样的象征意义？",
        "output": "select ?y where { <菠萝> <象征意义> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "加拿大的人口有多少？",
        "output": "select ?x where { <加拿大_（北美洲国家）> <人口数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "螺蛳粉是哪个地方的小吃？",
        "output": "select ?x where { <螺蛳粉> <产地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿波罗计划实在什么时候开始的？",
        "output": "select ?y where { <阿波罗计划> <起始时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "品牌爱马仕都卖哪些类别的东西？",
        "output": "select ?x where { <hermes_（法国奢侈品牌：爱马仕）> <经营范围> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国有几个直辖市？",
        "output": "select ?x where { <中国省级行政单位> <直辖市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《富春山居图》是谁的作品？",
        "output": "select ?x where { <富春山居图_（元朝画家黄公望作品）> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧《同居损友》是何时上映的？",
        "output": "select ?x where { <同居损友> <上映时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小孔成像的光学原理是什么？",
        "output": "select ?x where { <小孔成像> <成像原理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "马云的主要成就是什么？",
        "output": "select ?x where { <马云_（阿里巴巴集团创始人）> <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耐克的创始人是谁？",
        "output": "select ?x where { <NIKE> <创始人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成龙的儿子是谁？",
        "output": "select ?x where { <成龙_（中国香港演员、导演）> <儿子> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "芝加哥公牛队的主场馆是？",
        "output": "select ?x where { <芝加哥公牛队> <主场馆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉大学占地面积多大？",
        "output": "select ?x where { <武汉大学> <占地面积> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基督教起源于什么地方？",
        "output": "select ?x where { <基督教> <创始地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "塘红乡的人口数量是多少？",
        "output": "select ?x where { <塘红乡> <人口> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "一年有多少天？",
        "output": "select ?x where { <年_（计时单位）> <解释> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你知道玫瑰属于什么植物纲吗？",
        "output": "select ?x where { <玫瑰_（中药）> <纲> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐太宗的丰功伟绩？",
        "output": "select ?x where { <李世民_（唐太宗）> <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雨伞是用什么东西做的？",
        "output": "select ?x where { <雨伞_（生活工具）> <材料> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲《唠嗑歌》的时长是多少？",
        "output": "select ?x where { <唠嗑歌> <歌曲时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古罗马帝国的人口有多少？",
        "output": "select ?x where { <罗马_（古罗马时代）> <人口数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海贼里四皇都有谁？",
        "output": "select ?x where { <四皇_（日本动漫《海贼王》中人物）> <现任成员> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海申花队的主场是哪里？",
        "output": "select ?x where { <上海绿地申花足球俱乐部> <主场馆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成龙是哪个国家的人？",
        "output": "select ?x where { <成龙_（中国香港演员、导演）> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问什么叫做假寐？",
        "output": "select ?x where { <假寐> <解释> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梵高英年早逝，那么他是什么时候去世的？",
        "output": "select ?x where { <梵高_（梵高）> <逝世日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诗人李白是哪个时代的人？",
        "output": "select ?x where { <李白_（唐朝著名诗人）> <所处时代> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被阿里巴巴内部成为风清扬的是谁？",
        "output": "select ?x where { ?x <别名> \"风清扬（阿里巴巴内部花名）\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本的国花是什么？",
        "output": "select ?x where { ?x <地位> \"日本国花\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "豆瓣的官方网站？",
        "output": "select ?x where { <豆瓣_（网站名称）> <官网> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李白出生时间是哪一年？",
        "output": "select ?x where { <李白_（唐朝著名诗人）> <出生时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "为什么要庆祝圣诞节？",
        "output": "select ?x where { <圣诞节_（节日）> <节日意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪位明星的粉丝叫\"千纸鹤\"？",
        "output": "select ?x where { ?x <粉丝名称> \"千纸鹤\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南开大学的现任校长是谁？",
        "output": "select ?x where { <南开大学_（全国重点大学）> <现任校长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "要多少步才能让一只蛋孵化成杰尼龟？",
        "output": "select ?x where { <杰尼龟> <孵化步数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "书籍《亚利安01》的价格是多少？",
        "output": "select ?x where { <亚利安01> <定价> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五子棋是哪个国家发明的？",
        "output": "select ?x where { <五子棋_（两人对弈的策略型棋类游戏）> <起源> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉萨的市花是什么？",
        "output": "select ?x where { <拉萨> <市花> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三国时期的政治体制是？",
        "output": "select ?x where { <三国_（中国东汉与西晋之间的历史时期）> <政治体制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "缅甸最大城市有哪些著名景点？",
        "output": "select ?x where { <缅甸> <最大城市> ?y. ?y <著名景点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小马哥毕业于哪所大学？",
        "output": "select ?y where { ?x <别名> \"小马哥\". ?x <毕业院校> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宫崎骏和久石让合作的作品？",
        "output": "select ?x where { ?x ?y <宫崎骏>. ?x ?z <久石让>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "JD的CEO是谁？",
        "output": "select ?y where { ?x <外文名称> \"JD\". ?x <ceo> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淞沪会战的伤亡情况如何？",
        "output": "select distinct ?y where { ?x <名称> \"淞沪会战\" . ?x <伤亡情况> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郭德纲创立的相声社团宗旨是什么？",
        "output": "select ?y where { ?x <创始人> <郭德纲>. ?x <主旨> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《随想录》的作者的出生地是？",
        "output": "select ?x where { <随想录> <作者> ?y. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国古代神话中嫦娥的宠物象征了什么？",
        "output": "select ?x where { <嫦娥_（中国上古神话传说人物）> <宠物> ?y . ?y <象征> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演唱《街角的祝福》的歌手是哪国人？",
        "output": "select ?y where { ?x <代表作品> <街角的祝福>. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些作家？",
        "output": "select ?x where { ?x <职业> <作家_（汉语词语）> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些大学坐落于北京市海淀区？",
        "output": "select ?x where { ?x <类别> <公立大学>. ?x <所属地区> <海淀区>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华为公司董事长毕业于哪所院校？",
        "output": "select ?x where { <华为技术有限公司> <董事长> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哈佛大学出了哪些物理学家？",
        "output": "select ?x where { ?x <职业> <物理学家_（探索、研究物理学的科学家）> . ?x <毕业院校> <哈佛大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "官网是\"http://im.qq.com/\"的软件支持哪些语言？",
        "output": "select ?y where { ?x <官网> \"http://im.qq.com/\". ?x <软件语言> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "登上过维密秀的中国模特有哪些？",
        "output": "select ?x where { ?x <国籍> <中华人民共和国>. ?x <代表作品> <维多利亚的秘密时尚秀>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "好莱坞影片《我是谁》的中国演员都有谁？",
        "output": "select ?x where { <我是谁_（1998年成龙主演电影）> <主演> ?x. ?x <国籍> <中华人民共和国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《蒙娜丽莎》的作者皈依的是什么宗教？",
        "output": "select ?x where { ?y <代表作品> <蒙娜丽莎_（列奥纳多·达·芬奇画作）>. ?y <信仰> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵明诚的配偶有哪些主要作品？",
        "output": "select ?y where { ?x <配偶> <赵明诚>. ?x <主要作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"现代遗传学之父\"出生在哪个国家？",
        "output": "select ?y where { ?x <获得荣誉> \"现代遗传学之父\". ?x <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川的5A级景区你知道有哪些吗？",
        "output": "select ?x where { ?x <地理位置> <四川_（中华人民共和国四川省）>. ?x <景点级别> <国家AAAAA级旅游景区>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被世人尊称为\"哥哥\"的歌手、演员？",
        "output": "select ?x where { ?x <别名> \"哥哥\". ?x <职业> <歌手_（职业名称）>. ?x <职业> <演员_（薛之谦歌曲）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《阳关三叠》是什么时候的琴曲？",
        "output": "select ?x where { <阳关三叠> <歌曲类型> <古琴曲>. <阳关三叠> <朝代> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陈奕迅和王菲合唱的歌曲有什么？",
        "output": "select ?x where { ?x <歌曲原唱> <陈奕迅>. ?x <歌曲原唱> <王菲_（华语女歌手、演员）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "加拿大国树的分布区域？",
        "output": "select ?x where { <加拿大_（北美洲国家）> <国树> ?y. ?y <分布区域> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《悲惨世界》的作者的出生日期是？",
        "output": "select ?x where { <悲惨世界_（法国作家雨果创作长篇小说）> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "所有球衣号码为10的阿根廷足球运动员？",
        "output": "select ?x where { ?x <球衣号码> \"10\". ?x <运动项目> <足球>. ?x <国籍> <阿根廷_（阿根廷共和国）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曾毅所在的音乐组合有哪些代表作品？",
        "output": "select ?y where { ?x <组合成员> <曾毅_（凤凰传奇组合男主唱）>. ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《蜀道难》的作者的别称？",
        "output": "select ?x where { ?y <主要作品> <蜀道难_（李白作古体诗）> . ?y <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著有《杜工部集》的诗人处于哪个朝代？",
        "output": "select ?y where { ?x <主要作品> <杜工部集>. ?x <所处时代> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学出了哪些化学家？",
        "output": "select ?x where { ?x <职业> <化学家> . ?x <毕业院校> <清华大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《盗梦空间》哪个男主角是和族？",
        "output": "select ?y where { ?x <中文名> \"盗梦空间\". ?x <主演> ?y. ?y <民族> <和族>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《野草》的作者出生日期是？",
        "output": "select ?x where { <野草_（鲁迅创作散文诗集）> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蝙蝠侠的出生地有多少人口？",
        "output": "select ?a where { <蝙蝠侠_（美国DC漫画旗下超级英雄）> <出生地> ?x. ?x <人口> ?a.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆大学出过哪些企业家？",
        "output": "select ?x where { ?x <职业> <企业家> . ?x <毕业院校> <重庆大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘昊然在哪一部影片中与潘粤明合作？",
        "output": "select ?x where { ?x <主演> <刘昊然>. ?x <主演> <潘粤明>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俄罗斯的官方语言属于哪个语系？",
        "output": "select ?x where { <俄罗斯_（俄罗斯联邦）> <官方语言> ?y. ?y <语系> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些天文学家？",
        "output": "select ?x where { ?x <职业> <天文学家> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的名牌大学？",
        "output": "select ?x where { <北京_（中华人民共和国首都）> <高等学府> ?x. ?x <类别> <重点大学>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宏观经济学的发起人是谁？",
        "output": "select ?y where { ?x <中文名> \"宏观经济学\" . ?x <发起人> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "剑斗兽的发行商是哪国的公司？",
        "output": "select ?z where { ?x <中文名> \"剑斗兽\" . ?x <发行商> ?y . ?y <总部地点> ?z . ?z <中文名称> ?p . filter regex(?p, \"国\") . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些演员是苗族的？",
        "output": "select ?x where { ?x <职业> <演员_（职业）>. ?x <民族> <苗族>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨幂属什么？",
        "output": "select ?y where { ?x <中文名> \"杨幂\" . ?x <生肖> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些法语的喜剧片？",
        "output": "select ?x where { ?x <语言> <法语>. ?x <类型> <喜剧_（艺术体裁）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "历史上西南联大培养了哪些科学家？",
        "output": "select ?x where { ?x <毕业院校> <国立西南联合大学>. ?x <职业> <科学家_（从事科学研究的人群）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑州铁路局下辖哪些特等站？",
        "output": "select ?x where { ?x <车站等级> <特等站>. ?x <隶属铁路局> <郑州铁路局>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"超级丹\"的妻子是谁？",
        "output": "select ?y where { ?x <别名> \"超级丹、Super Dan\". ?x <妻子> ?y. }"
    }
]