[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京万达广场的建筑面积？",
        "output": "select ?x where { <万达广场_（北京万达广场）> <总建筑面积> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "还有哪些地方和布里斯班气候相似？",
        "output": "select ?y where { <布里斯班_（澳大利亚昆士兰州首府）> <气候条件> ?x.?y <气候条件> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "作为985,211重点工程学校，以世界一流大学为发展目标的某校，它的现任校长是谁？",
        "output": "select ?y where { ?x <属性> <211工程>. ?x <属性> <985工程>. ?x <发展定位> <世界一流大学>. ?x <现任校长> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "角色金田一郎所在的漫画是什么时候出版的？",
        "output": "select ?y where { <金田一郎> <登场作品> ?x. ?x <出版时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "C++之父是哪国人？",
        "output": "select ?x where { <c++> <创始人> ?y. ?y <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《清明上河图》的作者信奉什么思想？",
        "output": "select ?y where { <清明上河图_（北宋张择端风俗画）> <作者> ?x. ?x <信仰> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梁胜权执导的主演为胡歌林依晨的电视剧在什么时候上映？",
        "output": "select ?x where { ?y <主演> <胡歌_（中国内地男演员）>. ?y <主演> <林依晨> . ?y <导演> <梁胜权>. ?y <上映时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耶路撒冷所在国家的最大城市是什么？",
        "output": "select ?y where { ?x <首都> <耶路撒冷_（宗教圣地）>. ?x <最大城市> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "威猛先生隶属于哪个公司？",
        "output": "select ?x where { <威猛先生> <隶属> ?y. ?y <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "狮王谢逊都是用什么兵器？",
        "output": "select ?y where { ?x <中文名> \"谢逊\" . ?x <武器> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "素有\"匡庐奇秀甲天下\"和\"中华十大名山\"的名山占地面积多少？",
        "output": "select ?y where { ?x <美誉> \"匡庐奇秀甲天下\". ?x <荣誉> \"中华十大名山\". ?x <占地面积> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国史上有一位出生在台安县的一级上将，他是谁？",
        "output": "select ?x where { ?x <出生地> <台安县>. ?x <军衔> <一级上将>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "甄嬛传女主角的老公叫什么？",
        "output": "select ?y where { ?x <代表作品> <甄嬛传_（2011年郑晓龙执导古装清宫斗争剧）>. ?x <配偶> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京剧《贵妃醉酒》是谁的代表作？",
        "output": "select ?x where { ?x <职业> <京剧演员>. ?x <主要作品> <贵妃醉酒_（京剧剧目）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成龙的儿子毕业于哪一所学校？",
        "output": "select ?x where { <成龙_（中国香港演员、导演）> <儿子> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成立于1998年且总部设在硅谷的公司都有哪些？",
        "output": "select ?x where { ?x <总部地点> <硅谷_（泛指高技术产业）>. ?x <成立时间> \"1998\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学出了哪些政治家？",
        "output": "select ?x where { ?x <职业> <政治家> . ?x <毕业院校> <清华大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《刺客信条》系列游戏的历代主人公中，哪一个是美国人？",
        "output": "select ?x where { <刺客信条_（育碧蒙特利尔工作室开发动作冒险类游戏）> <主要角色> ?x. ?x <国籍> <美国_（美利坚合众国）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果教父乔帮主是什么教徒？",
        "output": "select ?y where { ?x <别名> \"苹果教父，乔帮主\". ?x <信仰> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钱钟书写过哪些讽刺小说？",
        "output": "select ?x where { ?x <作者> <钱钟书>. ?x <类别> <讽刺小说>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《中国在梁庄》的作者毕业于哪个大学？",
        "output": "select ?x where { <中国在梁庄> <作者> ?y . ?y <毕业院校> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国女乒选手中毕业于清华大学的是谁？",
        "output": "select ?x where { ?x <运动项目> <乒乓球> . ?x <毕业院校> <清华大学>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布鲁斯·韦恩的体重是多少？",
        "output": "select ?y where { ?x <中文名> \"布鲁斯·韦恩\". ?x <体重> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贾宝玉的绰号有什么含义？",
        "output": "select ?z where { ?x <中文名> \"贾宝玉\" . ?x <绰号> ?y . ?y <含义> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "炎帝最小的女儿有什么故事？",
        "output": "select ?y where { ?x <人物背景> \"炎帝最小的女儿\". ?x <故事> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "粉丝名为暖阳的演员出生日期是？",
        "output": "select ?y where { ?x <粉丝名> \"暖阳\". ?x <出生日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘嘉玲老公的星座是？",
        "output": "select ?y where { <刘嘉玲> <丈夫> ?x . ?x <星座> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国乒乓球队外号藏獒的是谁？",
        "output": "select ?x where { ?x <所属运动队> <中国乒乓球队>. ?x <别名> \"藏獒\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国古代四大发明的提出者毕业于哪个学校？",
        "output": "select ?y where { <四大发明_（中国古代四大发明）> <提出者> ?x. ?x <毕业院校> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天蝎座的守护神的外文名是什么？",
        "output": "select ?y where { <天蝎座_（占星学）> <守护神> ?x. ?x <外文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "NBA是美国著名的体育联盟，那么对应的球类运动起源于哪里？",
        "output": "select ?y where { ?x <主要赛事> <NBA>. ?x <起源地点> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《寻秦记》小说的作者出生于哪一年？",
        "output": "select ?y where { <寻秦记_（黄易所著历史武侠小说）> <作者> ?x. ?x <出生日期> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "1939年的影片《乱世佳人》又名什么？",
        "output": "select ?x where { <乱世佳人_（美国1939年克拉费雯·丽主演爱情电影）> <出品时间> \"1939-01-26\". <乱世佳人_（美国1939年克拉费雯·丽主演爱情电影）> <其它译名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影阿凡达的主演们都获得过那些成就？",
        "output": "select ?y where { <Avatar_（2009年上映詹姆斯·卡梅隆执导美国电影）> <主演> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "搜狐公司董事长毕业于哪个学校？",
        "output": "select ?y where { <搜狐> <创办人> ?x. ?x <毕业院校> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《喜剧之王》中同时担任主演、导演和编剧的是谁？",
        "output": "select ?x where { <喜剧之王_（1999年周星驰主演并执导电影）> <主演> ?x. <喜剧之王_（1999年周星驰主演并执导电影）> <导演> ?x. <喜剧之王_（1999年周星驰主演并执导电影）> <编剧> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钢铁侠的大学的校友获得过哪些奖项？",
        "output": "select ?x where { <史塔克_（美国动漫及电影钢铁侠中的人物）> <毕业院校> ?y. ?y <主要奖项> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钢铁侠的队友有哪些人和他来自同一国家？",
        "output": "select ?x where { <史塔克_（美国动漫及电影钢铁侠中的人物）> <所属团队> ?y. ?x <所属团队> ?y. ?x <国籍> <美国_（美利坚合众国）>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我想了解一下牛奶的主要营养成分？",
        "output": "select ?y where { ?x <中文名> \"牛奶\" . ?x <主要营养成分> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为\"宾尼兔\"的小兔子主要吃什么？",
        "output": "select ?y where { ?x <别称> <宾尼兔> . ?x <主食> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "让·雷诺和娜塔莉波特曼共同主演的电影是什么？",
        "output": "select ?x where { ?x <主演> <让·雷诺>. ?x <主演> <娜塔莉_（好莱坞演员娜塔莉·波特曼）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯的创始人中，谁的别名是小马哥？",
        "output": "select ?x where { <腾讯> <创始人> ?x. ?x <别名>\"小马哥\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斯坦福大学出了哪些企业家？",
        "output": "select ?x where { ?x <职业> <企业家> . ?x <毕业院校> <斯坦福大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "存在主义伦理学的代表人物都有哪些代表作？",
        "output": "select ?y where { <存在主义伦理学> <主要代表人物> ?x. ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "司法岛是哪部漫画里的？",
        "output": "select ?x where { <司法岛> <出自> ?x. ?x <类型> <少年漫画>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影致我们终将逝去的青春的主题曲是谁演唱的？",
        "output": "select ?x where { <致我们终将逝去的青春_（2013年赵薇执导电影）> <主题曲> ?x. ?x <职业> <歌手_（职业名称）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称作黑曼巴的球员妻子叫什么？",
        "output": "select ?y where { ?x <别名> \"黑曼巴\". ?x <妻子> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "合肥是哪个省的省会？",
        "output": "select ?x where { <合肥> <所属地区> ?x. ?x <行政区类别> <省_（一级地方行政区）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洞庭湖所属水系的发源地在哪里？",
        "output": "select ?y where { <洞庭湖_（长江流域湖泊）> <所属水系> ?x. ?x <发源地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "指环王的拍摄地点的官方语言是什么？",
        "output": "select ?x where { <指环王_（英美2001-2003年彼得·杰克逊执导系列电影）> <拍摄地点> ?y.?y <官方语言> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孔孟之乡指的是我国的哪个省？",
        "output": "select ?x where { ?x <齐鲁名人> \"孟子、\". ?x <齐鲁名人> \"孔子、\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津大学出过哪些企业家？",
        "output": "select ?x where { ?x <职业> <企业家> . ?x <毕业院校> <天津大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "1968年获得诺贝尔文学奖的作家有什么代表作？",
        "output": "select ?y where { ?x <主要成就> \"1968年获诺贝尔文学奖\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《百年孤独》的作者是哪个国家的？",
        "output": "select ?y where { <百年孤独> <作者> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孙中山和黎元洪等人领导的革命有着什么样的目的？",
        "output": "select ?y where { ?x <主要人物> <孙中山_（中国近代伟大的民主革命先行者）>. ?x <主要人物> <黎元洪>. ?x <目的> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和舒伯特来自同一国家的音乐家都有那些？",
        "output": "select ?x where { <舒伯特> <国籍> ?a. <舒伯特> <职业> ?b. ?x <国籍> ?a. ?x <职业> ?b. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北美地区最高水平的职棒棒球联赛的建立时间是？",
        "output": "select ?y where { ?x <地位> \"北美地区最高水平的职棒棒球联赛\". ?x <时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东南大学出过哪些科学家？",
        "output": "select ?x where { ?x <职业> <科学家_（从事科学研究的人群）> . ?x <毕业院校> <东南大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "法国国花的拉丁文学名是什么？",
        "output": "select ?y where { <法国_（法兰西共和国）> <国花> ?x. ?x <拉丁学名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高谭市的守护者的中文名是什么？",
        "output": "select ?x where { ?y <主要成就> \"高谭市守护者\". ?y <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《茶经》的作者被人们尊称为什么？",
        "output": "select ?y where { <茶经_（中国茶道奠基人陆羽所著茶学专著）> <作者> ?x. ?x <尊号> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "网易公司创始人被人们戏称为什么？",
        "output": "select ?y where { <网易公司> <创始人> ?x. ?x <别名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "主要食材是鸭脖子的休息食品品牌是？",
        "output": "select ?x where { ?x <主要食材> <鸭脖子>. ?x <分类> <休闲食品>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林徽因的丈夫的父亲是？",
        "output": "select ?x where { <林徽因_（中国建筑师、诗人、作家）> <丈夫> ?y. ?y <父亲> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "制作鸡排主要需要准备哪些材料？",
        "output": "select ?x where { <鸡排> <主要食材> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由上户彩主演的婚姻题材的日剧？",
        "output": "select ?x where { ?x <主演> <上户彩>. ?x <类型> <婚姻_（汉语词语）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为\"大蟒\"的国乒运动员？",
        "output": "select ?x where { ?x <别名> \"昕爷、大蟒\". ?x <运动项目> <乒乓球>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "漫威的母公司有多少名员工？",
        "output": "select ?z where { <漫威> <母公司> ?y . ?y <员工数> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《时间简史》的作者的英文全名是什么？",
        "output": "select ?y where { <时间简史_（斯蒂芬·霍金著作）> <作者> ?x. ?x <外文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "车辆驾驶方向和澳大利亚一样国家都在哪些洲？",
        "output": "select distinct ?y where { <澳大利亚> <道路通行> ?z.?x <道路通行> ?z.?x <所属洲> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小马哥有哪些主要成就？",
        "output": "select ?y where { ?x <别名>\"小马哥\". ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《根鸟》的作者有哪些代表作品？",
        "output": "select ?x where { <根鸟> <作者> ?y . ?y <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伊利企业董事长出生在？",
        "output": "select ?x where { <伊利_（内蒙古伊利实业集团股份有限公司）> <董事长> ?y. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郭麒麟师父的儿子叫什么名字？",
        "output": "select ?y where { <郭麒麟> <师父> ?x. ?x <儿子> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陈小春和陈冠希一起出演的电影有哪些？",
        "output": "select ?x where { ?x <主演> <陈冠希>. ?x <主演> <陈小春_（中国香港男歌手、演员）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国国民党的政治立场的核心是什么？",
        "output": "select ?z where { <中国国民党> <政治立场> ?y . ?y <核心> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尼采毕业学校的官网是什么？",
        "output": "select ?x where { <弗里德里希·威廉·尼采> <毕业院校> ?y. ?y <官网> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《盗墓笔记》的作者其笔名是？",
        "output": "select ?x where { <随想录> <作者> ?y. ?y <笔名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和子女一起演过电影电视剧的演员有谁？",
        "output": "select ?x where { ?x <子女> ?y. ?z <主演> ?x. ?z <主演> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国的第一任总统所属的政党是什么？",
        "output": "select ?y where { ?x <主要成就> \"担任美国首任总统\". ?x <所属政党> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "参演《武神赵子龙》的韩国女演员叫什么？",
        "output": "select ?x where { ?x <国籍> <韩国_（大韩民国）>. ?x <代表作品> <武神赵子龙_（2016年林更新、林允儿主演电视剧）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "联想公司的CEO在哪所院校毕业？",
        "output": "select ?p where { ?x <公司名称> ?y . filter regex(?y, \"联想\") . ?x <ceo> ?z . ?z <毕业院校> ?p . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "每周六晚20:20在湖南卫视播出的节目是？",
        "output": "select ?x where { ?x <播出频道> <湖南卫视>. ?x <播出时间> \"每周六晚20:20\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大什么时候入党？",
        "output": "select ?y where { ?x <别名> \"习大大\". ?x <入党时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨全仁在北京创办了什么企业？",
        "output": "select ?x where { ?x <创始人> <杨全仁>. ?x <总部地点> <中国北京>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《黑白之间》的演唱者的老公信什么教？",
        "output": "select ?z where { <黑白之间_（戚薇范逸臣演唱歌曲）> <演唱者> ?y. ?y <丈夫> ?x. ?x <宗教信仰> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "记忆魔法的导演是哪个国家的？",
        "output": "select ?x where { <记忆魔方_（美国电影）> <导演> ?y. ?y <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舒伯特出生城市有多大？",
        "output": "select ?y where { <舒伯特> <出生地> ?x. ?x <城市面积> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演唱《心墙》的歌手的星座是什么？",
        "output": "select ?y where { ?x <代表作品> <心墙_（郭静演唱歌曲）>. ?x <星座> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由大卫·凡·安肯导演，皮尔斯·布鲁斯南主演的电影是？",
        "output": "select ?x where { ?x <主演> <皮尔斯·布鲁斯南>. ?x <导演> <大卫·凡·安肯>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴西首都的时区？",
        "output": "select ?x where { <巴西_（巴西联邦共和国）> <首都> ?y. ?y <时区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大属于哪个民族？",
        "output": "select ?y where { ?x <别名> \"习大大\". ?x <民族> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "卧虎藏龙的导演是什么星座？",
        "output": "select ?y where { <卧虎藏龙_（李安导演电影）> <导演> ?x. ?x <星座> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辅佐姬发推翻商汤统治，并建立齐国的人是谁？",
        "output": "select ?x where { ?x <主要成就> \"辅佐周武王灭商扶仙\". ?x <主要成就> \"齐国始祖\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著有《藕与莼菜》一书的作者出生于何时？",
        "output": "select ?x where { <藕与莼菜> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们经常吃的东坡肉的发明者的字号是什么？",
        "output": "select ?y where { <东坡肉> <创制人> ?x. ?x <字号> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英伟达创立于哪年？",
        "output": "select ?y where { ?x <公司名称> \"英伟达\". ?x <成立时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "文化艺术出版社出版2010年6月21号出版的小说是哪本？",
        "output": "select ?x where { ?x <出版社> <文化艺术出版社>. ?x <出版时间> \"2010-06-21\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪位出生于捷克的足球门将的球衣号码是30？",
        "output": "select ?x where { ?x <场上位置> <门将>. ?x <球衣号码> \"30\". ?x <出生地> <捷克>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影阿凡达的导演的出生地是哪里？",
        "output": "select ?x where { <Avatar_（2009年上映詹姆斯·卡梅隆执导美国电影）> <导演> ?y. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孔子祖籍城市现有多少人口？",
        "output": "select ?x where { <孔子_（儒家学派创始人）> <祖籍> ?y. ?y <人口> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "复旦大学出了哪些数学家？",
        "output": "select ?x where { ?x <职业> <数学家_（数学家（世界著名数学家））> . ?x <毕业院校> <复旦大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中文名为巴宝莉的品牌创建于哪一年？",
        "output": "select ?x where { ?y <中文名称> \"巴宝莉\". ?y <创立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "翻译为\"Paradise above,Suzhou and Hangzhou below\"的典故出自哪？",
        "output": "select ?x where { ?y <外文名> \"Paradise above,Suzhou and Hangzhou below\". ?y <典故出自> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《悲惨世界》的作者的出生地是？",
        "output": "select ?x where { <悲惨世界_（法国作家雨果创作长篇小说）> <作者> ?y. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "pku坐落于什么位置？",
        "output": "select ?x where { ?y <简称> <pku_（北京大学的英文缩写）>. ?y <学校地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红楼梦中王熙凤丈夫的原型是谁？",
        "output": "select ?x where { <王熙凤> <丈夫> ?y. ?y <人物原型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孙子兵法的作者是哪个学派？",
        "output": "select ?y where { ?x <主要作品> <孙子兵法_（中国古典军事文化著作）>. ?x <学派> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《盗梦空间》由哪个公司出品？",
        "output": "select ?y where { ?x <中文名> \"盗梦空间\". ?x <出品公司> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由张艺谋导演，巩俐出演的电影有哪些？",
        "output": "select ?x where { ?x <主演> <巩俐>. ?x <导演> <张艺谋>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "所有球衣号码是23的篮球运动员有哪些？",
        "output": "select ?x where { ?x <球衣号码> \"23\". ?x <运动项目> <篮球_（球类运动）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《西游记》中，牛魔王的妻子的法宝是什么？",
        "output": "select ?y where { <牛魔王_（小说《西游记》中的角色）> <妻子> ?x. ?x <法宝> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金庸小说《天龙八部》中，段延庆的兄弟是谁？",
        "output": "select ?y where { ?x <中文名> \"段延庆\". ?x <兄弟> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "同时获得\"山东省优秀企业家\"和\"山东省劳动模范\"称号的是谁？",
        "output": "select ?x where { ?x <主要成就> \"山东省优秀企业家\". ?x <主要成就> \"山东省劳动模范\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影钢铁侠的主演都获得过那些奖项？",
        "output": "select ?x where { <Ironman_（美国2008年小罗伯特·唐尼主演电影）> <主演> ?y. ?y <主要成就> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名导演克里斯托弗·诺兰的代表作品都有哪些？",
        "output": "select ?y where { ?x <中文名> \"克里斯托弗·诺兰\" . ?x <职业> <导演> . ?x <代表作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玄元皇帝指的是哪位哲学家？",
        "output": "select ?x where { ?x <尊号> <玄元皇帝>. ?x <职业> <哲学家_（基础含义）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "列出上海的所有游戏公司吧？",
        "output": "select ?x where { ?x <经营范围> <游戏_（娱乐活动）>. ?x <总部地点> <上海_（中华人民共和国直辖市）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"伍豪\"是谁的笔名？",
        "output": "select ?x where { ?x <别名> \"伍豪\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有一位演员，6次打破香港电影票房纪录，主演电影《功夫》，他的出生地是哪里？",
        "output": "select ?x where { ?y <主要成就> \"6次打破香港电影票房纪录\". ?y <代表作品> <功夫_（2004年周星驰主演电影）>. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《白鹿原》里哪个演员是新疆人？",
        "output": "select ?x where { <白鹿原_（王全安执导电影）> <主演> ?x. ?x <出生地> <新疆_（中国自治区）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百度音乐十年至尊人气偶像、33次荣获最受欢迎男歌手奖的是谁？",
        "output": "select ?x where { ?x <主要成就> \"百度音乐十年至尊人气偶像\". ?x <主要成就> \"33次荣获最受欢迎男歌手奖\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "复旦大学出了哪些政治家？",
        "output": "select ?x where { ?x <职业> <政治家> . ?x <毕业院校> <复旦大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《忏悔录》的作者的信仰是？",
        "output": "select ?y where { ?x <代表作品> <忏悔录_（卢梭作品《忏悔录》）>. ?x <信仰> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由吉赛贝·托纳多雷导演，蒂姆·罗斯主演的电影曾获得过哪些奖项？",
        "output": "select ?x where { ?y <主演> <蒂姆·罗斯>. ?y <导演> <吉赛贝·托纳多雷>. ?y <主要奖项> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《苍蝇不叮无缝的蛋》的连载平台前身是什么？",
        "output": "select ?y where { <苍蝇不叮无缝的蛋> <连载平台> ?x . ?x <前身> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "写作了《论三位一体》的主教的历史评价是？",
        "output": "select ?y where { ?x <代表作品> <论三位一体>. ?x <职业> <主教_（宗教中的神职人员）>. ?x <历史评价> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汉初三杰中被封为留侯的是谁？",
        "output": "select ?x where { <汉初三杰> <成员> ?x. ?x <爵位> <留侯_（汉语词汇）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"美猴王\"会多少般变化？",
        "output": "select ?x where { ?y <称号> <美猴王_（2010年陈家奇执导动画片）>. ?y <技能> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纪晓岚当的是什么官？",
        "output": "select ?y where { ?x <别名> ?z . filter regex(?z, \"纪晓岚\") . ?x <官职> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《野草》的作者主要成就是？",
        "output": "select ?x where { <野草_（鲁迅创作散文诗集）> <作者> ?y. ?y <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《悲惨世界》的作者的血型是？",
        "output": "select ?x where { <悲惨世界_（法国作家雨果创作长篇小说）> <作者> ?y. ?y <血型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "木下秀吉有什么绰号？",
        "output": "select ?y where { ?x <别名> \"木下秀吉、羽柴秀吉\". ?x <绰号> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些哲学家属于笛卡尔学派？",
        "output": "select ?x where { ?x <学派> <理性主义>. ?x <职业> <哲学家_（基础含义）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你了解成立于1959年的综合医院有哪些吗？",
        "output": "select ?x where { ?x <医院类型> <综合医院>. ?x <成立时间>\"1959\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和博尔赫斯相同国籍的都有哪些人？",
        "output": "select ?x where { <豪尔赫·路易斯·博尔赫斯_（阿根廷作家）> <出生地> ?y.?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《这个杀手不太冷》和《V字仇杀队》共同的演员是？",
        "output": "select ?x where { <这个杀手不太冷> <主演> ?x. <V字仇杀队_（2005年詹姆斯·麦克提格执导电影）> <主演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《将进酒》的作者祖籍在哪里？",
        "output": "select ?x where { ?y <主要作品> <将进酒_（唐代李白诗作）>. ?y <祖籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "bilibili的董事长是什么血型？",
        "output": "select ?z where { <bilibili> <董事长> ?y . ?y <血型> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俄罗斯的国花有毒吗？",
        "output": "select ?x where { <俄罗斯_（俄罗斯联邦）> <国花> ?y. ?y <毒性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"现代遗传学之父\"毕业于哪所学校？",
        "output": "select ?x where { ?y <毕业院校> ?x. ?y <获得荣誉> \"现代遗传学之父\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张鲁一和周一围合作的电视剧是哪部？",
        "output": "select ?x where { ?x <主演> <张鲁一>. ?x <主演> <周一围>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新文化运动的发起者中那位出生于河北的志士别名为？",
        "output": "select ?y where { <新文化运动> <代表人物> ?x. ?x <出生地> <河北_（中国省级行政区）> . ?x <别名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金庸小说《天龙八部》中，无崖子和李秋水的师姐是谁？",
        "output": "select ?x where { ?x <性别> <女_（汉字）>. ?x <师弟/恋人> \"无崖子\". ?x <师妹> <李秋水_（金庸武侠小说《天龙八部》中的人物）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于1881年9月5日的作家是谁？",
        "output": "select ?x where { ?x <出生日期> \"1881-09-25\". ?x <职业> <作家_（汉语词语）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东京电视台出品的动画的导演有哪些？",
        "output": "select ?y where { ?x <出品> <东京电视台>. ?x <导演> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科比的老婆是做什么工作的？",
        "output": "select ?y where { ?x <丈夫> <科比·布莱恩特>. ?x <职业> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "复旦大学出了哪些作家？",
        "output": "select ?x where { ?x <职业> <作家_（汉语词语）> . ?x <毕业院校> <复旦大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林则徐的逝世地点是用什么方言？",
        "output": "select ?z where { ?x <中文名> \"林则徐\" . ?x <逝世地点> ?y . ?y <方言> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于柏林大学的经济学家有哪些？",
        "output": "select ?x where { ?x <职业> <经济学家_（拥有原创的经济学基础理论的经济学人）>. ?x <毕业院校> <柏林大学>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汤山邦彦导演的动画都是什么类型的？",
        "output": "select ?y where { ?x <导演> <汤山邦彦>. ?x <类型> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蔡元培毕业的学校在哪里？",
        "output": "select ?x where { <蔡元培> <毕业院校> ?y. ?y <地理位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为\"黑曼巴\"的球员的球衣号码是？",
        "output": "select ?x where { ?y <别名> \"黑曼巴\". ?y <球衣号码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚洲哪个国家的官方语言是阿拉伯语？",
        "output": "select ?x where { ?x <所属洲> <亚洲>. ?x <官方语言> <阿拉伯语>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金庸小说《天龙八部》中，段延庆和他的兄弟们都会什么武功？",
        "output": "select distinct ?z where { ?x <中文名> \"段延庆\". ?x <绝技> ?z. ?x <兄弟> ?y. ?y <武功> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉大学出了哪些作家？",
        "output": "select ?x where { ?x <职业> <作家_（汉语词语）> . ?x <毕业院校> <武汉大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "琵琶曲《十面埋伏》的特点是什么？",
        "output": "select ?y where { ?x <中文名> \"十面埋伏\". ?x <特点> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汪峰在专辑《信仰在空中飘扬》中发表了哪些代表性的作品？",
        "output": "select ?x where { ?x <所属专辑> <信仰在空中飘扬_（汪峰2009年发行音乐专辑）>. <汪峰_（歌手）> <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京大学和纽约州立大学布法罗分校的\"Robin\"是哪位中国大牛？",
        "output": "select ?x where { ?x <毕业院校> <北京大学>. ?x <毕业院校> <纽约州立大学布法罗分校>. ?x <外文名> \"Robin\". ?x <国籍> <中华人民共和国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钢铁侠有哪些队友？",
        "output": "select ?x where { <史塔克_（美国动漫及电影钢铁侠中的人物）> <所属团队> ?y. ?x <所属团队> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钱钟书的妻子的代表作有哪些？",
        "output": "select ?y where { ?x <丈夫> <钱钟书>. ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国北京有一所大学校庆日是5月4日，它的现任校长是谁？",
        "output": "select ?y where { ?x <校庆日>\"05-4\". ?x <现任校长> ?y . ?x <所属地区> <北京_（中华人民共和国首都）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"2010年度编程语言\"的设计者是谁？",
        "output": "select ?y where { ?x <荣誉> \"2010年度编程语言\". ?x <设计者> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美股指数有哪些？",
        "output": "select ?x where { <美股> <指数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生地产指数是什么指数？",
        "output": "select ?x where { <恒生地产指数> <指数类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中证TMT是什么指数？",
        "output": "select ?x where { <中证TMT> <指数类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深防御50是什么指数？",
        "output": "select ?x where { <深防御50> <指数类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全柴动力是哪个市场发行的股票？",
        "output": "select ?x where { <全柴动力> <市场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "立昂技术是哪个市场发行的股票？",
        "output": "select ?x where { <立昂技术> <市场> ?x. }"
    }
]