[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州国大雷迪森广场酒店的联系电话是多少？",
        "output": "select ?x where { <杭州国大雷迪森广场酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在青岛的青岛幻光之城星空艺术馆（台东旗舰店）都有哪些优惠信息？",
        "output": "select ?x where { <青岛幻光之城星空艺术馆（台东旗舰店）> <城市> <青岛> . <青岛幻光之城星空艺术馆（台东旗舰店）> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "博乐市有哪些4A级景点？",
        "output": "select ?x where { ?x <城市> <博乐市>. ?x <类型> <景点>. ?x <景点的等级A> \"4A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玩完沈阳科学宫，想去附近的景点去继续玩，请问附近5公里的景点包括什么？",
        "output": "select ?y where { <沈阳科学宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <沈阳>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆的营业时间？",
        "output": "select ?x where { <广州失恋博物馆> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "做几路车可以到达喀什噶尔老城？",
        "output": "select ?x where { <喀什噶尔老城> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅溪湖国际文化艺术中心艺术馆《流动的永恒》展内有停车场吗？",
        "output": "select ?x where { <梅溪湖国际文化艺术中心艺术馆《流动的永恒》展> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "达蓬山大酒店属于哪个品牌下的酒店？",
        "output": "select ?x where { <达蓬山大酒店> <酒店品牌名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京紫金山探险公园附近5公里的酒店有哪些？",
        "output": "select ?y where { <紫金山探险公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <南京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何到东莞梵高星空艺术馆？路线是什么？",
        "output": "select ?x where { <东莞梵高星空艺术馆> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕田峪长城的门票优惠政策都有什么？",
        "output": "select ?x where { <慕田峪长城> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚维景国际度假酒店有独栋的房吗？",
        "output": "select ?y where { <三亚维景国际度假酒店> <房型名称> ?y. ?y <房型类别> \"独栋\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长沙运达喜来登酒店附近5公里的景点有哪些？",
        "output": "select ?y where { <长沙运达喜来登酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <长沙>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什噶尔老城适合游玩几个小时？",
        "output": "select ?x where { <喀什噶尔老城> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宜兴大酒店是否提供wifi？",
        "output": "select ?x where { <宜兴大酒店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "扎什伦布寺内有酒店吗？",
        "output": "select ?x where { <扎什伦布寺> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巅峰乐园坐公交怎么去？",
        "output": "select ?x where { <重庆·巅峰乐园> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "峨眉山世纪阳光大酒店内有电梯吗？",
        "output": "select ?x where { <峨眉山世纪阳光大酒店> <是否有电梯> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津独角兽星空艺术馆和天津梵高星空艺术馆（天河城旗舰店）距离有多远？听说离得挺近的。",
        "output": "select ?t where { <天津独角兽星空艺术馆> <附近> ?cvt. ?cvt <实体名称> <天津梵高星空艺术馆（天河城旗舰店）>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安大唐不夜城附近1公里住哪合适？",
        "output": "select ?y where { <大唐不夜城> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <西安>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王府半岛酒店哪些房型有影音设备？",
        "output": "select ?y where { <王府半岛酒店> <房型名称> ?y. ?y <影音设备> \"有\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "参观纳木错国家风景区大概得花多少钱？",
        "output": "select ?x where { <纳木错国家风景区> <平均价格> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辽宁博物馆里面有可以吃饭的地方吗",
        "output": "select ?x where { <辽宁省博物馆> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫周围有哪个酒店可以付费接送机？",
        "output": "select ?y where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有接机服务> <有接机服务（收费）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景点等级为5A的天坛公园的优惠信息是什么？",
        "output": "select ?x where { <天坛公园> <景点的等级A> \"5A\" . <天坛公园> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住北京华侨大厦最早可以几点？",
        "output": "select ?time where { <北京华侨大厦> <酒店入住开始时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不可思议星空解压馆中荧光枕头大战是什么样的？",
        "output": "select ?x where { <不可思议星空解压馆> <娱乐项目名称> <荧光枕头大战>. <荧光枕头大战> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆附近2公里的景点？",
        "output": "select ?y where { <广州独角兽星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <广州>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在喀什市的喀什噶尔老城是否免费？",
        "output": "select ?x where { <喀什噶尔老城> <城市> <喀什市> . <喀什噶尔老城> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的哪些酒店带咖啡厅",
        "output": "select ?x where { ?x <城市> <杭州>. ?x <是否有咖啡厅> <有咖啡厅>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津的海河适合游玩几个小时？",
        "output": "select ?x where { <海河> <城市> <天津> . <海河> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽晶酒店的导航地址？",
        "output": "select ?x where { <北京丽晶酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郴州华天大酒店内有医务室吗？",
        "output": "select ?x where { <郴州华天大酒店> <是否有医务室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京金陵状元楼大酒店的酒店最早几点可以入住？",
        "output": "select ?x where { <南京金陵状元楼大酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大唐不夜城的平均价格是多少？",
        "output": "select ?x where { <大唐不夜城> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆的儿童优惠政策是什么？",
        "output": "select ?x where { <广州失恋博物馆> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从三亚红色娘子军演艺公园到国光豪生度假酒店有多远？",
        "output": "select ?t where { <三亚红色娘子军演艺公园> <附近> ?cvt. ?cvt <实体名称> <三亚国光豪生度假酒店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "想去玩紫金山探险公园中蓝线项目，请问有啥约束条件吗？",
        "output": "select ?x where { <紫金山探险公园> <娱乐项目名称> <蓝线（难度4级）>. <蓝线（难度4级）> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京金陵状元楼大酒店离紫金山探险公园多远？",
        "output": "select ?t where { <南京金陵状元楼大酒店> <附近> ?cvt. ?cvt <实体名称> <紫金山探险公园>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉光谷金盾酒店附近5公里的景点都包括什么？",
        "output": "select ?y where { <武汉光谷金盾大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <武汉>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州哪家丽思卡尔顿的酒店可以免费存行李？",
        "output": "select ?x where { ?x <城市> <广州>. ?x <类型> <酒店>. ?x <酒店品牌名称> <丽思卡尔顿>. ?x <是否有行李寄存> <行李寄存免费>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大唐不夜城附近有会议室的酒店？",
        "output": "select ?y  where { <大唐不夜城> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有会议室> ?z. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玉龙雪山蓝月谷是否免费？",
        "output": "select ?x where { <玉龙雪山蓝月谷> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京瑞吉酒店附近5公里的景点包括哪些？",
        "output": "select ?y where { <北京瑞吉酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波南苑环球酒店哪些房间能住三个人？",
        "output": "select ?y where { <宁波南苑环球酒店> <房型名称> ?y. ?y <容纳人数> \"3.0\"^^<http://www.w3.org/2001/XMLSchema#float>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈阳科学宫的联系电话是多少？",
        "output": "select ?x where { <沈阳科学宫> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "5A景区宝石山在哪个城市？",
        "output": "select ?x where { <宝石山> <景点的等级A> \"5A\" . <宝石山> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "带多少钱可以去奥林匹克森林公园游玩吗？",
        "output": "select ?x where { <奥林匹克森林公园> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园附近5km内最贵的酒店是多少钱？",
        "output": "select ?price  where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY desc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "临海华侨大酒店内有婚宴服务吗？",
        "output": "select ?x where { <临海华侨大酒店> <是否有婚宴服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "离故宫最近的酒店人均800以下酒店是哪一家？",
        "output": "select ?y  where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?price <= 800). } ORDER BY asc(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆的最佳游玩时间是什么季节？",
        "output": "select ?x where { <广州失恋博物馆> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海安哥拉巨兔体验馆有商店吗？",
        "output": "select ?x where { <上海安哥拉巨兔体验馆> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中山路上那个时空魔方艺术馆能玩几个小时？",
        "output": "select ?x where { <时空魔方艺术馆（中山路旗舰店）> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绍兴开元名都大酒店平均价格多少？",
        "output": "select ?x where { <绍兴开元名都大酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店的梦外滩影视主题公园人均大概多少？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <城市> <横店> . <横店梦外滩影视主题公园> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚到北京入住到金茂威斯汀大饭店，请问附近5公里低于五十块钱的景点都有啥？",
        "output": "select ?y where { <金茂北京威斯汀大饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>. ?y <平均价格> ?price filter(?price < 50) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园在哪个城市",
        "output": "select ?x where { <天坛公园> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）中无限地井项目有什么限制吗？例如对身高年龄方面。",
        "output": "select ?x where { <杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）> <娱乐项目名称> <无限地井>. <无限地井> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "去苏州出差，准备去大名鼎鼎的苏州博物馆观赏一下，请问它附近的交通路线有什么推荐吗？",
        "output": "select ?x where { <苏州博物馆> <城市> <苏州> . <苏州博物馆> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在贵阳豪生的酒店都有啥？",
        "output": "select ?x where { ?x <城市> <贵阳> . ?x <酒店品牌名称> <豪生> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中山路的时空魔方艺术馆附近住哪个酒店能租车呢？",
        "output": "select ?y where { <时空魔方艺术馆（中山路旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <类型> <酒店>. ?y <是否有租车服务> <有租车服务>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "能简短描述一下5D流星雨古装星空馆（东城店）中流星雨失恋博物馆吗？",
        "output": "select ?x where { <5D流星雨古装星空馆（东城店）> <娱乐项目名称> <流星雨失恋博物馆>. <流星雨失恋博物馆> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赛里木湖有哪些景观值得一看",
        "output": "select ?x where { <赛里木湖风景名胜区> <娱乐项目名称> ?x. ?x <类型> <项目> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住地窝堡机场那边的乌鲁木齐天缘酒店最早几点？",
        "output": "select ?time where { <乌鲁木齐天缘酒店（地窝堡机场店）> <酒店入住开始时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州哪些景点可以玩半天以上",
        "output": "select ?x where { ?x <城市> <杭州>. ?x <类型> <景点>. ?x <建议游玩时长> \"半天-1天\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "紫金山探险公园内有吸烟区吗？",
        "output": "select ?x where { <紫金山探险公园> <是否有吸烟区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神玉艺术馆的优惠政策都有哪些？",
        "output": "select ?x where { <神玉艺术馆> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泸沽湖有几个等级为4A的景点？",
        "output": "select (count(?x) as ?count_city) where { ?x <城市> <泸沽湖>. ?x <景点的等级A> \"4A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南省博物馆的景点等级？",
        "output": "select ?x where { <湖南省博物馆> <景点的等级A> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住上海银星皇冠假日酒店最早几点？",
        "output": "select ?x where { <上海银星皇冠假日酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院的官方网站是什么？",
        "output": "select ?x where { <南京博物院> <景点官方网站> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园有哪些优惠政策？",
        "output": "select ?x where { <北海公园> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广西沃顿国际大酒店的早餐类型是啥样的",
        "output": "select ?x where { <广西沃顿国际大酒店> <早餐类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住金皇大酒店平均多少钱？",
        "output": "select ?x where { <天津金皇大酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉华美达光谷大酒店2公里内有什么景点？",
        "output": "select ?y where { <武汉华美达光谷大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <武汉>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黎城县的壶山温泉联系电话是多少？",
        "output": "select ?x where { <壶山温泉> <城市> <黎城县> . <壶山温泉> <电话> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安钟楼梦幻星空抖乐园平均价格是多少？",
        "output": "select ?x where { <西安梦幻星空抖乐园（钟楼旗舰店）> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园和神玉艺术馆有多少距离？",
        "output": "select ?t where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> <神玉艺术馆>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "未成年人能入住海门东恒盛国际大酒店吗？",
        "output": "select ?x where { <海门东恒盛国际大酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京嘉里大酒店在金茂北京威斯汀大饭店的方向？",
        "output": "select ?x where { <北京嘉里大酒店> <位于> ?cvt.  ?cvt <实体名称> <金茂北京威斯汀大饭店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门星空艺术馆的平均价格是多少？",
        "output": "select ?x where { <厦门星空艺术馆> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南郊宾馆最晚几点入住？",
        "output": "select ?x where { <南郊宾馆> <酒店入住结束时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五缘湾万嘀帆船出海俱乐部在哪？",
        "output": "select ?x where { <五缘湾万嘀帆船出海俱乐部> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院是免费的吗？",
        "output": "select ?x where { <国家大剧院> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "溪口银凤度假村哪个房型能住四个人呢？",
        "output": "select ?y where { <溪口银凤度假村> <房型名称> ?y. ?y <容纳人数> \"4.0\"^^<http://www.w3.org/2001/XMLSchema#float>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京故宫博物院附近5公里\t的景点有哪些？",
        "output": "select ?y where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京独角兽星空艺术馆附近以收费接站的酒店呢？",
        "output": "select ?y  where { <南京独角兽星空艺术馆旗舰店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有接站服务> <有接站服务（收费）>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京北海公园附近5公里的景点都有哪些？",
        "output": "select ?y where { <北海公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉锦江国际大酒店附近5000m去哪玩好？",
        "output": "select ?y where { <武汉锦江国际大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <武汉>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以简短介绍一下厦门星空艺术馆中的海洋奇缘项目吗？",
        "output": "select ?x where { <厦门星空艺术馆> <娱乐项目名称> <海洋奇缘>. <海洋奇缘> <类型> <项目>. <海洋奇缘> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的宝石山是免费的吗？",
        "output": "select ?x where { <宝石山> <城市> <杭州> . <宝石山> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆自然博物馆新馆的景区等级是什么？",
        "output": "select ?x where { <重庆自然博物馆（新馆）> <景点的等级A> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛海尔洲际酒店附近有哺乳室的景点",
        "output": "select ?y where { <青岛海尔洲际酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有母婴室> ?z. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门艾美酒店有哪些房型是大床间？",
        "output": "select ?y where { <厦门艾美酒店> <房型名称> ?y. ?y <房型类别> \"大床间（单间）\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京爱情博物展（新街口总店）内有商店吗？",
        "output": "select ?x where { <南京爱情博物展（新街口总店）> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉萨瑞吉度假酒店内有温泉吗？",
        "output": "select ?x where { <拉萨瑞吉度假酒店> <是否有温泉> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西湖中湖滨晴雨的营业时间？",
        "output": "select ?x where { <西湖风景名胜区（西湖）> <娱乐项目名称> <湖滨晴雨>. <湖滨晴雨> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉新世界酒店附近可以免费帮寄存行李的景点？",
        "output": "select ?y  where { <武汉新世界酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有行李寄存> <有免费行李寄存>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安天域凯莱大饭店中的凯莱雅致双床房有影音设备吗？",
        "output": "select ?x where { <西安天域凯莱大饭店>     <房型名称>      <凯莱雅致双床房>. <凯莱雅致双床房>  <影音设备> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福州世纪金源大饭店的wifi情况？",
        "output": "select ?x where { <福州世纪金源大饭店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽晶酒店位于中航泊悦酒店的什么方位？",
        "output": "select ?x where { <北京丽晶酒店> <位于> ?cvt.  ?cvt <实体名称> <北京中航泊悦酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "台山君海悦凤凰酒店的详细地址？",
        "output": "select ?x where { <台山君海悦凤凰酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳富临大酒店最多有住几个人的房型",
        "output": "select (max(?x) as ?max_x) where { <深圳富临大酒店> <房型名称> ?y. ?y <容纳人数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京金陵状元楼大酒店附近2公里的景点有哪些？",
        "output": "select ?y where { <南京金陵状元楼大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <南京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "听说空中之翼航空飞行跳伞俱乐部中的双人高空跳伞很刺激，什么时候营业啊？",
        "output": "select ?x where { <空中之翼航空飞行跳伞俱乐部> <娱乐项目名称> <双人高空跳伞>. <双人高空跳伞> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "秦皇国际大酒店内有干洗服务吗？",
        "output": "select ?x where { <秦皇国际大酒店> <是否有干洗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京香格里拉大酒店内有多功能厅吗？",
        "output": "select ?x where { <南京香格里拉大酒店> <是否有多功能厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京东方君悦酒店有二十五平左右的房型吗？",
        "output": "select ?y where { <北京东方君悦大酒店> <房型名称> ?y. ?y <房屋面积> \"25\"^^<http://www.w3.org/2001/XMLSchema#float>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆的所在城市是哪？",
        "output": "select ?x where { <广州失恋博物馆> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京独角兽星空艺术馆旗舰店的建议游玩时长？",
        "output": "select ?x where { <南京独角兽星空艺术馆旗舰店> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在天津,且酒店品牌名称为皇冠假日的酒店都有啥？",
        "output": "select ?x where { ?x <城市> <天津> . ?x <酒店品牌名称> <皇冠假日> . ?x <类型> <酒店>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在宁波, 距离天一广场梵高星空艺术馆旗舰店1公里的酒店有哪些？",
        "output": "select ?y where { <宁波梵高星空艺术馆（天一广场旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <宁波>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南省博物馆什么时候最适合游玩？",
        "output": "select ?x where { <湖南省博物馆> <是否免费> \"全年免费\" . <湖南省博物馆> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "准备从国家地理探险家中心到沈阳梵高星空艺术馆，往哪个方向走？",
        "output": "select ?x where { <沈阳梵高星空艺术馆（益田假日世界店）> <位于> ?cvt.  ?cvt <实体名称> <国家地理探险家中心>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆建议游玩时长是几个小时？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园附近有温泉的酒店",
        "output": "select ?y  where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有温泉> <有温泉>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "合肥泓瑞金陵大酒店的详细地理位置？",
        "output": "select ?x where { <合肥泓瑞金陵大酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "提供洗衣服务的雍和宫附近的酒店求推荐",
        "output": "select ?y  where { <雍和宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有洗衣服务> <有洗衣服务>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景点等级为4A的沈阳科学宫的详细地址是多少？",
        "output": "select ?x where { <沈阳科学宫> <景点的等级A> \"4A\" . <沈阳科学宫> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么时候适合去游玩重庆的自然博物馆新馆？",
        "output": "select ?x where { <重庆自然博物馆（新馆）> <城市> <重庆> . <重庆自然博物馆（新馆）> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店梦外滩影视主题公园有住的地方吗？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "抚州荣誉国际酒店内有暖气吗？",
        "output": "select ?x where { <抚州荣誉国际酒店> <是否有暖气> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "润达奇妙萌宠乐园在哪所城市？",
        "output": "select ?x where { <润达奇妙萌宠乐园> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波的梵高艺术馆的营业时间是什么时候？",
        "output": "select ?x where { <宁波梵高星空艺术馆（天一广场旗舰店）> <城市> <宁波> . <宁波梵高星空艺术馆（天一广场旗舰店）> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩附近哪个酒店有多功能厅？",
        "output": "select ?y where { <外滩> <附近> ?cvt. ?cvt <实体名称> ?y.  ?y <是否有多功能厅>   <有多功能厅>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阳春东湖国际大酒店内有喝咖啡的地方吗？",
        "output": "select ?x where { <阳春东湖国际大酒店> <是否有咖啡厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京恋爱博物馆比较近的可帮忙洗衣的酒店",
        "output": "select ?y  where { <南京恋爱博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有洗衣服务> <有洗衣服务>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院玩几个小时合适？",
        "output": "select ?x where { <南京博物院> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东阳世贸君澜大酒店的支付方式都有哪些？",
        "output": "select ?x where { <东阳世贸君澜大酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景点等级为4A的北海公园的官方网站是多少？",
        "output": "select ?x where { <北海公园> <景点的等级A> \"4A\" . <北海公园> <景点官方网站> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅里雪山国家公园里面有没有酒店啊？",
        "output": "select ?x where { <梅里雪山国家公园> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀纳斯景区的最佳游玩时间？",
        "output": "select ?x where { <喀纳斯景区> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福州世纪金源大饭店内有婚宴服务吗？",
        "output": "select ?x where { <福州世纪金源大饭店> <是否有婚宴服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院在凤凰中心的方位？",
        "output": "select ?x where { <国家大剧院> <位于> ?cvt.  ?cvt <实体名称> <凤凰中心>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如果准备把沈阳科学宫中的项目全部玩一遍，大概需要几个小时？",
        "output": "select ?x where { <沈阳科学宫> <是否免费> \"全年免费\" . <沈阳科学宫> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "昆明佳华广场酒店退宿时间你知道嘛？",
        "output": "select ?y where {  <昆明佳华广场酒店> <酒店退房时间> ?y.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京金丝利喜来登酒店内有沙滩吗？",
        "output": "select ?x where { <南京金丝利喜来登酒店> <是否有沙滩> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园是5A的景点，价格是多少呀？贵不？",
        "output": "select ?x where { <天坛公园> <景点的等级A> \"5A\" . <天坛公园> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安天域凯莱大饭店中的凯莱家庭客房有电脑吗？",
        "output": "select ?g where { <西安天域凯莱大饭店>     <房型名称>      <凯莱家庭客房>. <凯莱家庭客房>  <电脑配置> ?g. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟的交通有哪些？",
        "output": "select ?x where { <九寨沟风景区> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛附近5km内最便宜的酒店是哪一家？",
        "output": "select ?y  where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY asc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州国大雷迪森广场酒店附近5公里的景点包括哪些？",
        "output": "select ?y where { <杭州国大雷迪森广场酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雍和宫附近3公里内，能在晚上六点入住的酒店有哪些",
        "output": "select ?x where { <雍和宫> <附近> ?cvt. ?cvt <距离值> ?distance. filter(?distance <= 3.0) ?cvt <实体名称> ?x. ?x <类型> <酒店>. ?x <酒店入住开始时间> ?time. filter(?time < \"18:00\"^^<http://www.w3.org/2001/XMLSchema#dateTime>). }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "到北京啦，请问清华大学艺术博物馆附近5公里的景点都有哪些？",
        "output": "select ?y where { <清华大学艺术博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园附近的哪些酒店可以租到车？",
        "output": "select ?y where { <北海公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有租车服务> <有租车服务>.?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咸宁碧桂园凤凰温泉酒店的支付方式包括哪些？",
        "output": "select ?x where { <咸宁碧桂园凤凰温泉酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京昆仑饭店可以带狗狗入住吗？",
        "output": "select ?x where { <北京昆仑饭店> <是否有允许带宠物> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雍和宫附近有可以擦鞋的酒店吗？",
        "output": "select ?y where { <雍和宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有擦鞋服务> <有擦鞋服务>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园适合游玩多久？",
        "output": "select ?x where { <天坛公园> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日坛宾馆周边1公里内有哪些酒店啊？",
        "output": "select ?y where { <日坛宾馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <北京>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华晨宝马铁西工厂可以停车吗",
        "output": "select ?x where { <华晨宝马铁西工厂> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫玩几个小时能全部逛完？",
        "output": "select ?x where { <故宫博物院（故宫）> <城市> <北京> . <故宫博物院（故宫）> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家地理探险家中心设立在哪个城市呢？",
        "output": "select ?x where { <国家地理探险家中心> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的北海公园的官方门票是多少钱？",
        "output": "select ?x where { <北海公园> <城市> <北京> . <北海公园> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园中的智慧海是什么？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <智慧海>. <智慧海> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东北大厦行政豪华套房型是门禁是什么样的呀？",
        "output": "select ?g where { <东北大厦> <房型名称> <行政豪华套>. <行政豪华套> <门禁类型> ?g. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛丽晶大酒店附近2公里的酒店还有哪些？",
        "output": "select ?y where { <青岛丽晶大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <青岛>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕田峪长城的淡旺季是什么时候？",
        "output": "select ?x where { <慕田峪长城> <淡季旺季> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在诸暨市有几家豪生的酒店？",
        "output": "select ?x where { ?x <城市> <诸暨> . ?x <酒店品牌名称> <豪生> . }"
    }
]