[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万科是哪个行业？",
        "output": "select ?x where { <万科> <行业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全柴动力所在的股票市场实行哪种交易制度？",
        "output": "select ?x where { <全柴动力> <市场> ?y. ?y <交易制度> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券披露三大报是指哪三个？",
        "output": "select ?x where { <证券披露三大报> <相关报纸> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "期权开户有年龄限制吗？",
        "output": "select ?x where { <期权开户> <年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份实际控制人？",
        "output": "select ?x where { <大华股份> <实际控制人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份市盈率？",
        "output": "select ?x where { <大华股份> <市盈率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通交易存在哪些风险？",
        "output": "select ?x where { <港股通> <交易风险> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份所属概念？",
        "output": "select ?x where { <大唐电信> <概念> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "熔断机制是什么时候开始实施的？",
        "output": "select ?x where { <熔断机制> <实施时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "熔断机制是什么时候暂停实施的？",
        "output": "select ?x where { <熔断机制> <暂停时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何计算市盈率？",
        "output": "select ?x where { <市盈率> <公式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "合格境外机构投资者的英文简称是什么？",
        "output": "select ?x where { <合格境外机构投资者> <英文简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国债发行的方式？",
        "output": "select ?x where { <国债发行> <方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "地方债的期限有哪些？",
        "output": "select ?x where { <地方债> <期限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "企业财务的三大报表有哪些？",
        "output": "select ?x where { <企业财务> <三大报表> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些投资者可以参与港股通？",
        "output": "select ?x where { <港股通> <投资者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信用账户三方存管的银行有哪些？",
        "output": "select ?x where { <信用账户三方存管> <银行> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券公司可以经营哪些业务？",
        "output": "select ?x where { <证券公司> <经营业务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上市公司收购可采取哪些方式？",
        "output": "select ?x where { <上市公司> <收购方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通委托能使用哪些限价盘？",
        "output": "select ?x where { <港股通委托> <限价盘类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通交易有哪些限制？",
        "output": "select ?x where { <港股通> <交易限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "配股缴款期是几天？",
        "output": "select ?x where { <配股> <缴款期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生香港综合指数的分类有哪些？",
        "output": "select ?x where { <恒生香港综合指数> <分类> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "召开临时股东大会的条件有哪些？",
        "output": "select ?x where { <召开临时股东大会> <条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券龙头股有哪些？",
        "output": "select ?x where { <证券> <龙头股> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "担保证券转入时间？",
        "output": "select ?x where { <担保证券> <转入时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "担保资金转入时间？",
        "output": "select ?x where { <担保资金> <转入时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "收购要约的期限？",
        "output": "select ?x where { <收购要约> <期限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "A股账户销户有哪些注意事项？",
        "output": "select ?x where { <A股账户销户> <注意事项> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券竞价交易的方式有哪些？",
        "output": "select ?x where { <证券竞价交易> <方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沪市新股申购数量要求？",
        "output": "select ?x where { <沪市新股申购> <数量要求> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深市新股申购数量要求？",
        "output": "select ?x where { <深市新股申购> <数量要求> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "限售股的分类？",
        "output": "select ?x where { <限售股> <分类> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股份有限公司设立的条件？",
        "output": "select ?x where { <股份有限公司> <设立条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "一个投资者最多可以申请开立几个Ａ股账户？",
        "output": "select ?x where { <A股账户> <最多申请个数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "集合竞价时间？",
        "output": "select ?x where { <集合竞价> <时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浪潮软件收盘价？",
        "output": "select ?x where { <浪潮软件> <收盘价> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "边缘计算概念的股票有哪些？",
        "output": "select ?x where { <边缘计算概念> <股票> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科创板设立地点？",
        "output": "select ?x where { <科创板> <设立地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科创板重点支持哪些产业？",
        "output": "select ?x where { <科创板> <支持产业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵薇割韭菜，收到了证监会什么处罚？",
        "output": "select ?x where { <赵薇> <处罚> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "认购期权的特点？",
        "output": "select ?x where { <认购期权> <特点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "立昂技术的股票代码？",
        "output": "select ?x where { <立昂技术> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "A股纳入MSCI指数是什么时候？",
        "output": "select ?x where { <A股> <纳入MSCI指数时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "MSCI新兴市场指数与中国相关的有哪些?",
        "output": "select ?x where { <MSCI新兴市场指数> <中国相关> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银证转账的时间？",
        "output": "select ?x where { <银证转账> <时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票在除权日当天名称前冠以什么字样？",
        "output": "select ?x where { <除权> <标识> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "除息的英文简写？",
        "output": "select ?x where { <除息> <英文简写> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上交所国债逆回购的起点金额？",
        "output": "select ?x where { <上交所国债逆回购> <起点金额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信用账户销户条件？",
        "output": "select ?x where { <信用账户> <销户条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上证有多少家上市公司？",
        "output": "select ?x where { <上证> <上市公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上证的平均市盈率是多少？",
        "output": "select ?x where { <上证> <平均市盈率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上证的总流通股本是多少？",
        "output": "select ?x where { <上证> <总流通股本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上证的总流通市值是多少？",
        "output": "select ?x where { <上证> <总流通市值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上证的总市值是多少？",
        "output": "select ?x where { <上证> <总市值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证有多少家上市公司？",
        "output": "select ?x where { <深证> <上市公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证的平均市盈率是多少？",
        "output": "select ?x where { <深证> <平均市盈率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证的总流通市值是多少？",
        "output": "select ?x where { <深证> <总流通市值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证的总市值是多少？",
        "output": "select ?x where { <深证> <总市值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证上市证券数？",
        "output": "select ?x where { <深证> <上市证券数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证主板上市公司数？",
        "output": "select ?x where { <深证主板> <上市公司数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证中小板上市公司数？",
        "output": "select ?x where { <深证中小板> <上市公司数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证创业板上市公司数？",
        "output": "select ?x where { <深证创业板> <上市公司数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "公开发行上市对企业有什么风险？",
        "output": "select ?x where { <上市> <风险> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "公开发行上市对企业有什么约束？",
        "output": "select ?x where { <上市> <约束> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国债回购证券代码首四位?",
        "output": "select ?x where { <国债回购> <证券代码首四位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米上市地点？",
        "output": "select ?x where { <小米> <上市地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米发行价？",
        "output": "select ?x where { <小米> <发行价> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "道氏理论有哪三个核心思想？",
        "output": "select ?x where { <道氏理论> <核心思想> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米的承销商？",
        "output": "select ?x where { <小米> <承销商> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米的创始人？",
        "output": "select ?x where { <小米> <创始人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "比特币的创始人是谁？",
        "output": "select ?x where { <比特币> <创始人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "比特币的特征？",
        "output": "select ?x where { <比特币> <特征> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九大对冲基金公司？",
        "output": "select ?x where { <九大对冲基金公司> <相关公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2019年全球富豪榜榜首的是？",
        "output": "select ?x where { <福布斯全球富豪榜> <榜首> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2019年全球品牌500强榜首是哪个国家的？",
        "output": "select ?x where { <全球品牌价值500强> <榜首> ?y. ?y <国家> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通交易的最大手数？",
        "output": "select ?x where { <港股通> <最大交易手数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通股票暂停交易的情况？",
        "output": "select ?x where { <港股通> <暂停交易情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "债券质押式回购的风险？",
        "output": "select ?x where { <债券质押式回购> <风险> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "300017的员工人数？",
        "output": "select ?x where { ?y <股票代码> <300017>. ?y <员工人数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布丁股份董事长的年龄？",
        "output": "select ?x where { <布丁股份> <董事长> ?y. ?y <年龄> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新股申购的条件？",
        "output": "select ?x where { <新股申购> <条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "指定交易有何优点？",
        "output": "select ?x where { <指定交易> <优点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香港联交所是哪四家合并而成的？",
        "output": "select ?x where { <香港联交所> <组成> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票质押式回购业务优势？",
        "output": "select ?x where { <股票质押式回购> <优势> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么情况下会被暂停上市？",
        "output": "select ?x where { <被暂停上市> <情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么情况下会被终止上市？",
        "output": "select ?x where { <被终止上市> <情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票质押式回购业务的融资期限？",
        "output": "select ?x where { <股票质押式回购业务> <融资期限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金公司有哪些？",
        "output": "select ?x where { <基金公司> <相关公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维持担保比例计算公式？",
        "output": "select ?x where { <维持担保比例> <公式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "约定购回式证券交易的交易时间？",
        "output": "select ?x where { <约定购回式证券> <交易时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "存托凭证以人民币还是外币计价？",
        "output": "select ?x where { <存托凭证> <计价货币> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证监会的全称是？",
        "output": "select ?x where { <证监会> <全称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "短期国债的偿还期限？",
        "output": "select ?x where { <短期国债> <偿还期限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深港股票市场交易互联互通机制是什么的全称？",
        "output": "select ?x where { ?x <全称> <深港股票市场交易互联互通机制>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是产品三要素？",
        "output": "select ?x where { <产品> <三要素> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深交所封闭式证券投资基金证券代码的编制原则?",
        "output": "select ?x where { <深交所封闭式证券投资基金证券代码> <编制原则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "约定购回的警戒线？",
        "output": "select ?x where { <约定购回> <警戒线> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "约定购回的处置线？",
        "output": "select ?x where { <约定购回> <处置线> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "公开发行公司债券的条件?",
        "output": "select ?x where { <公司债券> <发行条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上交所可转债债转股数量规定？",
        "output": "select ?x where { <上交所可转债债转> <数量规定> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可转债债转股的规则？",
        "output": "select ?x where { <可转债债转股> <规则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股交收制度？",
        "output": "select ?x where { <港股> <交收制度> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "A股交收制度？",
        "output": "select ?x where { <A股> <交收制度> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日K线是红色代表什么意思？",
        "output": "select ?x where { <日K线> <红色含义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "购买开放式基金的条件？",
        "output": "select ?x where { <购买开放式基金> <条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金的运作方式有哪些？",
        "output": "select ?x where { <基金> <运作方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金的报价单位？",
        "output": "select ?x where { <基金> <报价单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "封闭式基金的认购方式有哪些？",
        "output": "select ?x where { <封闭式基金> <认购方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳ETF基金卖出后资金什么时候到账？",
        "output": "select ?x where { <深圳ETF> <到账时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金分红方式有哪些？",
        "output": "select ?x where { <基金分红> <方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "货币基金的特点？",
        "output": "select ?x where { <货币基金> <特点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金的交易时间？",
        "output": "select ?x where { <基金> <交易时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金分红有哪些条件？",
        "output": "select ?x where { <基金分红> <条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金开户支持哪些证件类型？",
        "output": "select ?x where { <基金开户> <证件类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开放式基金的类型有哪些？",
        "output": "select ?x where { <开放式基金> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金认购的收费模式？",
        "output": "select ?x where { <基金认购> <收费模式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以T+0交易的基金有哪些？",
        "output": "select ?x where { <基金> <T+0> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以实现T+0交易的货币基金产品有哪些？",
        "output": "select ?x where { <货币基金> <T+0> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索罗斯经典名言？",
        "output": "select ?x where { <索罗斯> <经典名言> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索罗斯狙击香港发生在什么时候？",
        "output": "select ?x where { <索罗斯狙击香港> <发生时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《金融炼金术》一书的作者是？",
        "output": "select ?x where { <《金融炼金术》> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股神的主要成就？",
        "output": "select ?x where { ?y <别名> <股神>. ?y <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沪指2850点被称为什么底？",
        "output": "select ?x where { <沪指2850> <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《华尔街之狼》原型是谁？",
        "output": "select ?x where { <《华尔街之狼》> <原型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "詹森指数的公式？",
        "output": "select ?x where { <詹森指数> <公式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《猫鼠游戏》讲诉了一个诈骗天才从FBI历史上最年轻的通缉犯到FBI金融安全顾问的故事，该角色的原型是？",
        "output": "select ?x where { <猫鼠游戏> <原型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴菲特的投资名言？",
        "output": "select ?x where { <巴菲特> <投资名言> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴菲特午餐是从哪年开始拍卖的？",
        "output": "select ?x where { <巴菲特午餐> <起始年份> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华尔街的铜牛雕像身长是？",
        "output": "select ?x where { <华尔街的铜牛雕像> <身长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的监事会主席？",
        "output": "select ?x where { <青岛啤酒> <监事会主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的总裁？",
        "output": "select ?x where { <青岛啤酒> <总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的董事会秘书？",
        "output": "select ?x where { <青岛啤酒> <董事会秘书> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的董事长？",
        "output": "select ?x where { <青岛啤酒> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的副总裁？",
        "output": "select ?x where { <青岛啤酒> <副总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的执行董事？",
        "output": "select ?x where { <青岛啤酒> <执行董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的股东监事？",
        "output": "select ?x where { <青岛啤酒> <股东监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的非执行董事？",
        "output": "select ?x where { <青岛啤酒> <非执行董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的独立董事？",
        "output": "select ?x where { <青岛啤酒> <独立董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的总会计师？",
        "output": "select ?x where { <青岛啤酒> <总会计师> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的职工监事？",
        "output": "select ?x where { <青岛啤酒> <职工监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的财务总监？",
        "output": "select ?x where { <青岛啤酒> <财务总监> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛啤酒的股东有？",
        "output": "select ?x where { <青岛啤酒> <股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在青岛啤酒持股1.3%的是哪家？",
        "output": "select ?x where { <青岛啤酒> <股东> ?x. ?x <持股> <1.3%>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风险警示股票有哪些？",
        "output": "select ?x where { <股票> <风险警示> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海市场大宗交易的条件？",
        "output": "select ?x where { <上海市场> <大宗交易条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳市场大宗交易的条件？",
        "output": "select ?x where { <深圳市场> <大宗交易条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广发证券有哪些融资类业务？",
        "output": "select ?x where { <广发证券> <融资类业务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广发证券的客服电话？",
        "output": "select ?x where { <广发证券> <客服电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "个股期权的合约类型？",
        "output": "select ?x where { <个股期权> <合约类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "个股期权的交割方式？",
        "output": "select ?x where { <个股期权> <交割方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "个股期权价格变动的影响因素有哪些？",
        "output": "select ?x where { <个股期权价格变动> <影响因素> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "个股期权合约要素？",
        "output": "select ?x where { <个股期权> <合约要素> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上交所期权交易方式？",
        "output": "select ?x where { <上交所期权> <交易方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "期权的交易方式有？",
        "output": "select ?x where { <期权> <交易方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老三板A股的报价单位？",
        "output": "select ?x where { <老三板A股> <报价单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老三板B股的报价单位？",
        "output": "select ?x where { <老三板B股> <报价单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老三板股票有涨跌幅限制吗？",
        "output": "select ?x where { <老三板股票> <涨跌幅限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "旧三板股票转让的交易费用？",
        "output": "select ?x where { <旧三板股票转让> <交易费用> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天弘基金官方网站？",
        "output": "select ?x where { <天弘基金> <网址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天弘基金成立时间？",
        "output": "select ?x where { <天弘基金> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天弘基金客服邮箱为？",
        "output": "select ?x where { <天弘基金> <客服邮箱> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "K线的计算周期有哪些？",
        "output": "select ?x where { <K线> <计算周期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "K线看涨形态有？",
        "output": "select ?x where { <K线形态> <看涨> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美股什么颜色代表上涨？",
        "output": "select ?x where { <美股> <上涨颜色> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "A股什么颜色代表上涨？",
        "output": "select ?x where { <A股> <上涨颜色> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "K线图别名有？",
        "output": "select ?x where { <K线图> <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股什么颜色代码下跌？",
        "output": "select ?x where { <港股> <下跌颜色> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沪港通的重要意义体现在哪些方面？",
        "output": "select ?x where { <沪港通> <重要意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沪港通标的股票范围？",
        "output": "select ?x where { <沪港通> <标的股票范围> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通买入后何时可以卖出？",
        "output": "select ?x where { <港股通> <交易机制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开通港股通权限时冻结资金金额？",
        "output": "select ?x where { <开通港股通权限> <冻结金额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通买卖港股使用哪种货币报价？",
        "output": "select ?x where { <港股通> <报价货币> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港股通买卖港股使用哪种货币交收？",
        "output": "select ?x where { <港股通> <交收货币> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是融资融券担保物？",
        "output": "select ?x where { <融资融券> <担保物> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "融资融券的交易成本有哪些？",
        "output": "select ?x where { <融资融券> <交易成本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "融资融券交易佣金上限？",
        "output": "select ?x where { <融资融券> <交易佣金上限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "融资融券负债类型？",
        "output": "select ?x where { <融资融券> <负债类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "融资融券取保线是多少？",
        "output": "select ?x where { <融资融券> <取保线> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "一人可以开立多个信用账户吗？",
        "output": "select ?x where { <融资融券> <最多账户数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "债券的收益包括哪些？",
        "output": "select ?x where { <债券> <收益> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "债券的交易方式？",
        "output": "select ?x where { <债券> <交易方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银行间债券市场的债券交易类型有哪些？",
        "output": "select ?x where { <银行间债券市场的债券交易> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "债券回购有哪些类型？",
        "output": "select ?x where { <债券回购> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "公司债券暂停的情形有哪些？",
        "output": "select ?x where { <公司债券> <暂停情形> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "机构债券投资范围？",
        "output": "select ?x where { <机构债券> <投资范围> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "历任中国证监会主席？",
        "output": "select ?x where { <证监会> <主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现任证监会主席是谁？",
        "output": "select ?x where { <证监会> <现任主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现任证监会主席毕业于哪所学校？",
        "output": "select ?x where { <证监会> <现任主席> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘士余任职期间，中国股市发生哪些变化？",
        "output": "select ?x where { <刘士余> <政绩> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "B股的委托申报方式？",
        "output": "select ?x where { <B股> <委托申报方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "B股交易的费用？",
        "output": "select ?x where { <B股交易> <费用> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "B股的交收规则？",
        "output": "select ?x where { <B股> <交收规则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "B股以什么币种交易？",
        "output": "select ?x where { <B股> <币种> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票交易费用？",
        "output": "select ?x where { <股票> <交易费用> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "ST股票的最大涨跌幅是多少？",
        "output": "select ?x where { <ST股票> <最大涨跌幅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票的交易时间？",
        "output": "select ?x where { <股票> <交易时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票最低买多少股？",
        "output": "select ?x where { <股票> <起点数量> ?x. }"
    }
]