[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《马可·波罗游记》的作者是哪国人？",
        "output": "select ?y where { <马可·波罗游记_（马可·波罗口述、鲁思梯谦记录游记）> <作者> ?x . ?x <国籍> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成吉思汗是对谁的尊称？",
        "output": "select ?x where { <成吉思汗_（大蒙古国建立者）> <中文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们尊称孙文先生为？",
        "output": "select ?y where { ?x <中文名> \"孙文\" . ?x <尊称> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雍正皇帝在位期间的主要成就？",
        "output": "select ?x where { <雍正_（清世宗年号）> <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玫瑰在英语里叫做？",
        "output": "select ?x where { <玫瑰_（蔷薇科蔷薇属植物）> <英文名称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "富士山所属国家的首都是哪里？",
        "output": "select ?y where { <富士山> <地点> ?x . ?x <首都> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "村上春树的哪部作品首版刊发时间为1987年？",
        "output": "select ?x where { <村上春树_（日本著名作家）> <代表作品> ?x.  ?x <首版时间> \"1987\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "村上春树是什么时候出生的？",
        "output": "select ?x where { <村上春树_（日本著名作家）> <出生日期> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯的法人有什么外号？",
        "output": "select ?x where { <腾讯> <法定代表人> ?y.  ?y <别名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李相赫擅长玩哪些女性英雄？",
        "output": "select ?x where { <李相赫> <擅长英雄> ?x.  ?x <性别> <女_（汉字）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英文名字是\"WestDoor\"的玩家是哪个国家的人？",
        "output": "select ?x where { ?y <外文名> \"WestDoor\".  ?y <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得NBA最有价值球员奖（2008）的球员的球衣号码是多少？",
        "output": "select ?x where { ?y <主要奖项> \"NBA最有价值球员奖（2008）\".  ?y <球衣号码> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科比的老婆的工作是什么？",
        "output": "select ?x where { <科比·布莱恩特> <妻子> ?y.  ?y <职业> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "权力的游戏第六季的编剧毕业于哪个学校？",
        "output": "select ?x where { <权力的游戏第六季> <编剧> ?y.  ?y <毕业院校> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国总统罗斯福什么时候去世的？",
        "output": "select ?x where { <罗斯福_（美国第三十二届总统）> <逝世日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《射雕英雄传》里黄蓉的爸爸用什么武器？",
        "output": "select ?x where { <黄蓉_（金庸武侠小说《射雕英雄传》女主角）> <父亲> ?y.  ?y <武器> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林心如和香港演员朱茵共同出演的电视剧有？",
        "output": "select ?x where { ?x <主演> <林心如>.  ?x <主演> <朱茵_（中国香港女演员）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冯柏源导演的电视剧有哪些是张卫健主演的？",
        "output": "select ?x where { ?x <主演> <张卫健>.  ?x <导演> <冯柏源> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朱茵和唐嫣共同饰演过哪个经典角色？",
        "output": "select ?x where { ?x <饰演> <唐嫣>.  ?x <饰演> <朱茵_（中国香港女演员）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清扬洗发水请过哪些中国名人当代言人？",
        "output": "select ?x where { <清扬_（洗发水品牌）> <代言人> ?x.  ?x <国籍> <中华人民共和国> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "法国在哪个洲？",
        "output": "select ?x where { <法国_（法兰西共和国）> <所属洲> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "法国主要信仰什么宗教？",
        "output": "select ?x where { <法国_（法兰西共和国）> <主要宗教> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张敬轩签了哪个唱片公司？",
        "output": "select ?x where { <张敬轩> <唱片公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手王菲是什么星座？",
        "output": "select ?x where { <王菲_（华语女歌手、演员）> <星座> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《红豆》出自于哪个专辑？",
        "output": "select ?x where { <红豆_（王菲演唱歌曲）> <所属专辑> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "专辑《唱游》中哪首歌是由柳重言谱曲的？",
        "output": "select ?x where { ?x <所属专辑> <唱游>.  ?x <谱曲> <柳重言> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李荣浩哪首歌的风格是乡村摇滚？",
        "output": "select ?x where { <李荣浩_（中国内地男歌手）> <代表作品> ?x.  ?x <音乐风格> <乡村摇滚> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诗人李白的祖籍是什么气候？",
        "output": "select ?x where { <李白_（唐朝著名诗人）> <祖籍> ?y.  ?y <气候条件> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《行路难》是哪个朝代的诗人创作的？",
        "output": "select ?x where { <行路难_（李白诗作）> <作者> ?y.  ?y <所处时代> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "作《帝京篇》的古人信仰什么学派？",
        "output": "select ?x where { <帝京篇_（李世民作唐诗）> <作者> ?y.  ?y <信仰> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "9·11事件发生在哪里？",
        "output": "select ?x where { <9·11事件> <地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本·拉登最知名的罪行导致多少人受伤？",
        "output": "select ?x where { <本·拉登> <主要罪行> ?y.  ?y <受伤> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李荆有什么著名成就？",
        "output": "select ?x where { <李荆> <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "运动员李翔宇的母校的校训是什么？",
        "output": "select ?x where { <李翔宇_（田径运动员）> <毕业院校> ?y.  ?y <校训> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手胡琳出演过的电影片长是多少？",
        "output": "select ?x where { ?y <主演> <胡琳_（广东籍歌手）>.  ?y <片长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "瑞金有多少人口？",
        "output": "select ?x where { <瑞金> <人口> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "虎门林则徐纪公园有什么特别的典故吗？",
        "output": "select ?x where { <虎门林则徐纪公园> <历史典故> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手赵雷在2011年8月7日发行了哪首歌？",
        "output": "select ?x where { <赵雷_（民谣歌手、音乐人）> <代表作品> ?x.  ?x <发行时间> \"2011-08-07\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咖喱起源的国家的首都是什么？",
        "output": "select ?x where { <咖喱_（多种香料调配而成的酱料）> <起源> ?y.  ?y <首都> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本哪位国家领导人出生于山口县？",
        "output": "select ?x where { <日本_（日本国）> <国家领袖> ?x.  ?x <出生地> <山口县> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "漂亮的刘亦菲会哪些才艺啊？",
        "output": "select ?x where { <刘亦菲_（影视女演员、歌手）> <特长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "给我推荐几个出生于赣州的歌手？",
        "output": "select ?x where { ?x <出生地> <赣州_（江西省地级市）>.  ?x <职业> <歌手_（职业名称）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "木星是由哪个国家的科学家发现的？",
        "output": "select ?x where { <木星_（太阳系八大行星之一）> <发现者> ?y.  ?y <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伽利略在1590年提出了什么重要理论？",
        "output": "select ?x where { ?x <提出者> <伽利略·伽利雷>.  ?x <提出时间> \"1590\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坦桑尼亚道路驾驶靠哪边通行？",
        "output": "select ?x where { <坦桑尼亚> <道路通行> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"生活如此多娇\"是哪个公司的口号？",
        "output": "select ?x where { ?x <公司口号> \"生活如此多娇\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伟大的领袖毛主席是什么时候诞生的？",
        "output": "select ?x where { <毛泽东_（无产阶级革命家）> <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些知名的女性小提琴家？",
        "output": "select ?x where { ?x <职业> <小提琴家_（著名小提琴家）> . ?x <性别> <女_（汉字）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "威尼斯的气候成因是什么？",
        "output": "select ?x where { <威尼斯_（意大利城市）> <气候条件> ?y.  ?y <成因> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "导演诺兰2017年的哪部作品出品了？",
        "output": "select ?x where { ?x <导演> <诺兰_（英国导演）> . ?x <出品时间> \"2017\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朋友说我\"注孤生\"，他到底是什么意思？",
        "output": "select ?y where { <注孤生> <解释> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些学校开设社会科学部？",
        "output": "select ?x where { ?x <主要院系> <社会科学部> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学共青团具有什么性质？",
        "output": "select ?x where { <北京大学共青团> <性质> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国际名称为CREGC的公司成立于什么时候？",
        "output": "select ?y where { ?x <外文名称> \"CREGC\" . ?x <成立时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在京华出版社出版的书中，《蓝毛衣》的译者共翻译哪几本书？",
        "output": "select ?y where { <蓝毛衣> <译者> ?x . ?y <译者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "荣获2010年度编程语言称号的语言于何时发行？",
        "output": "select ?y where { ?x <荣誉> \"2010年度编程语言\" . ?x <发行时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在1968年被发明，用于代替键盘繁琐的指令的设备是？",
        "output": "select ?x where { ?x <发明时间> \"1968\" . ?x <作用> \"代替键盘繁琐的指令\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "方如沁是哪部武侠游戏中的角色？",
        "output": "select ?x where { <方如沁_（单机游戏《古剑奇谭一》人物）> <登场作品> ?x . ?x <游戏类型> <武侠_（武侠文化）>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于香港，曾获得第28届金像奖最佳男主角提名的他与陈妍希共同主演哪部作品？",
        "output": "select ?y where { ?x <出生地> <香港_（中华人民共和国特别行政区）> . ?x <主要成就> \"第28届金像奖最佳男主角提名\" . ?y <主演> ?x. ?y <主演> <陈妍希> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《鬼子来了》的导演的代表作品中荣获亚洲电影大奖和最高票房亚洲电影大奖的影片的外文名称是？",
        "output": "select ?z where { ?x <代表作品> <鬼子来了> . ?x <代表作品> ?y . ?y <主要奖项> \"亚洲电影大奖 最高票房亚洲电影大奖\" . ?y <外文名> ?z.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"天涯海角\"这一地区的最佳旅游时间是？",
        "output": "select ?x where { <天涯海角_（海南省三亚市天涯海角游览区）> <最佳旅游时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本山大叔背后的经纪公司是哪个？",
        "output": "select ?y where { ?x <别名> \"本山大叔\" . ?x <经纪公司> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "联合国宪章来自哪个国际组织？",
        "output": "select ?x where { ?x <宪章> \"联合国宪章\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "总部设在杭州且主营电子商务和网上支付的公司是？",
        "output": "select ?x where { ?x <总部地点> <杭州_（浙江省省会）> . ?x <经营范围> <电子商务> . ?x <经营范围> <网上支付> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洛克王国大冒险是由哪一家互联网公司开发的？",
        "output": "select ?x where { <洛克王国大冒险1-8册> <作者> ?x . ?x <经营范围> <互联网_（网际网络）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百度文库由哪家公司经营？",
        "output": "select ?x where { <百度文库合作平台> <类属> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "今日头条的官方网址是？",
        "output": "select ?x where { <今日头条> <官网> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纪梵希金色年华的制造商所在国家的最大城市有什么称号？",
        "output": "select ?o where { <纪梵希金色年华> <制造商> ?x . ?x <国别> ?y . ?y <最大城市> ?z . ?z <别名> ?o.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "终极联盟3的制片公司的母公司的总部设立在哪？",
        "output": "select ?z where { <终极联盟3> <作者> ?x . ?x <母公司> ?y. ?y <总部地点> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我国辽宁舰的下水时间是什么时候？",
        "output": "select ?x where { <辽宁号航空母舰> <下水> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲《我和我的祖国》的原唱的代表作品中，由乔羽填词的歌曲是？",
        "output": "select ?x where { <我和我的祖国_（李谷一演唱的歌曲）> <歌曲原唱> <李谷一> . <李谷一> <代表作品> ?x. ?x <填词> <乔羽_（北京大学歌剧研究院名誉院长）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "15个月成就大满贯的他参加的是什么运动项目?",
        "output": "select ?y where { ?x <重要事件> \"15个月成就大满贯\" . ?x <运动项目> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德云社的主旨是什么？",
        "output": "select ?x where { <德云社> <主旨> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著有《矛盾论》的无产阶级革命家的毕业院校是？",
        "output": "select ?y where { ?x <代表作品> <矛盾论> . ?x <毕业院校> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼和诺尔大草原所处城市的车牌代码是多少？",
        "output": "select ?y where { <呼和诺尔大草原> <地区> ?x . ?x <车牌代码> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "总部位于北京市海淀区学院路甲 5 号的那所公司的口号是？",
        "output": "select ?y where { ?x <办公地址> \"北京市海淀区学院路甲 5 号\" . ?x <口号> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电子竞技的基本元素是什么？",
        "output": "select ?x where { <电子竞技> <基本元素> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郎平所带领的体育项目起源于哪个国家？",
        "output": "select ?y where { <郎平_（中国排球队著名运动员）> <运动项目> ?x . ?x <起源> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汉字最早出现在什么时候？",
        "output": "select ?x where { <汉字> <最早出现历史> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵匡胤建立的国家的监察机构有？",
        "output": "select ?y where { ?x <开国皇帝> <赵匡胤_（宋朝开国皇帝）> . ?x <监察机构> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《春望》一诗的作者主要创作哪些作品？",
        "output": "select ?y where { ?x <主要作品> <春望_（杜甫五言律诗）> . ?x <主要作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "扬子江的英文名是什么?",
        "output": "select ?x where { <扬子江_（长江下游河段的旧称）> <外文名称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些射手座的四川籍歌手？",
        "output": "select ?x where { ?x <职业> <歌手_（职业名称）> . ?x <星座> <射手座_（占星学）> . ?x <出生地> <成都_（四川省成都市）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "设立五一劳动节的重大意义是什么？",
        "output": "select ?x where { <五一国际劳动节> <节日意义> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞机的最早发明者的英文名是什么？",
        "output": "select ?y where { <飞机_（交通工具）> <发明者> ?x. ?x <外文名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "既属于鸫科又属于红胸鸲亚种的鸟类是？",
        "output": "select ?x where { ?x <科> <鸫科> . ?x <亚种> <红胸鸲> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "总部设在天津市的文化传播公司有哪些？",
        "output": "select ?x where { ?x <经营范围> <文化传播> . ?x <总部地点> <天津_（中华人民共和国直辖市）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "1780年诞生的那类舞蹈流行于哪个大洲？",
        "output": "select ?y where { ?x <形式> <舞蹈形式>. ?x <流行地区> ?y. ?x <起源时间> <1780年>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王者荣耀游戏中属于商朝的英雄有？",
        "output": "select ?y where { ?x <中文名> \"王者荣耀\" . ?y <所处时代> <商朝> . ?x <主要角色> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何鉴定一枚宝石？",
        "output": "select ?x where { ?x <鉴定对象> \"宝石\" . ?x <类别> <鉴定方法> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳的乳制品公司有哪些？",
        "output": "select ?x where { ?x <经营范围> <乳制品> . ?x <总部地点> <深圳> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大夫有什么含义？",
        "output": "select ?x where { <大夫> <释义> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲怒放的生命的演唱者出生于何时？",
        "output": "select ?y where { <怒放的生命_（2005年汪峰音乐专辑）> <专辑歌手> ?x . ?x <出生日期> ?y.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哥哥出生于什么地方？",
        "output": "select ?y where { ?x <别名> \"哥哥\" . ?x <出生地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴塞罗那俱乐部的现任主席是谁？",
        "output": "select ?x where { <巴塞罗那_（足球俱乐部）> <主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得二十世纪最佳俱乐部的是哪只足球队？",
        "output": "select ?x ?y where { ?x <运动项目> <足球>.  ?x <主要荣誉> \"二十世纪最佳俱乐部\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尤文图斯成立于何时？",
        "output": "select ?x ?y where { <尤文图斯足球俱乐部> <成立时间> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西甲共有多少支足球队？",
        "output": "select ?x where { <西班牙足球甲级联赛> <联赛级别> <足球联赛> . <西班牙足球甲级联赛> <球队数量> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为红军的足球俱乐部是？",
        "output": "select ?x where { ?x <运动项目> <足球> . ?x <球队绰号> \"红军）\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅西获得过几次西甲冠军？",
        "output": "select ?x where { <里奥·梅西_（阿根廷足球运动员）> <主要奖项> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拥有西班牙和阿根廷双重国籍的足球运动员有哪些？",
        "output": "select ?x where { ?x <国籍> <西班牙_（西班牙王国）> . ?x <国籍> <阿根廷_（阿根廷共和国）> . ?x <运动项目> <足球> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拥有西班牙和巴西双重国籍的足球运动员有哪些？",
        "output": "select ?x where { ?x <国籍> <西班牙_（西班牙王国）> . ?x <国籍> <巴西_（巴西联邦共和国）> . ?x <运动项目> <足球> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴西的主要宗教是什么？",
        "output": "select ?x ?y where { <巴西_（巴西联邦共和国）> <主要宗教> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国花为康乃馨的国家有哪些？",
        "output": "select ?x where { ?x <主要城市> ?y . ?x <国花> <康乃馨_（石竹属植物）>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "圣斗士星矢中号称神的化身的人的生日？",
        "output": "select ?y where { ?x <登场作品> <圣斗士星矢_（车田正美作画的漫画）> . ?x <其他名称> \"神的化身\" . ?x <生日> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "圣斗士星矢中紫龙在哪里修行？",
        "output": "select ?y where { <紫龙_（动漫《圣斗士星矢》中的人物）> ?x <圣斗士星矢_（车田正美作画的漫画）> . <紫龙_（动漫《圣斗士星矢》中的人物）> <修行地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些人出生在9月19日？",
        "output": "select ?y where { ?y <生日> \"09-19\".}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生在9月25日的秘书有哪些？",
        "output": "select ?x where { ?x <生日> \"09-25\" . ?x <职位> <秘书> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"蜜蜂\"是哪个明星的粉丝？",
        "output": "select ?x where { ?x <粉丝名> \"蜜蜂\".}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "linux的创始人毕业于哪个学校？",
        "output": "select ?y where { <Linxu系统> <创始人> ?x . ?x <毕业院校> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "樱木花道的外号有哪些?",
        "output": "select ?x where { <樱木花道> <其他名称> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "灌篮高手里哪些人司职控球后卫？",
        "output": "select ?x where { ?x <登场作品> <灌篮高手_（井上雄彦著作漫画）> . ?x <场上位置> <控球后卫> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "灌篮高手里哪些巨蟹座的人司职小前锋？",
        "output": "select ?x where { ?x <登场作品> <灌篮高手_（井上雄彦著作漫画）> . ?x <场上位置> <小前锋> . ?x <星座> <巨蟹座_（占星学）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动画片魔神英雄传的发行时间是什么时候？",
        "output": "select ?x where { <魔神英雄传_（日本SUNRISE公司制作的系列动画片）> <发行时间> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李寿全的张三的歌被哪些人翻唱过？",
        "output": "select ?x where { <张三的歌_（李寿全演唱歌曲）> <翻唱> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "狄仁杰之通天帝国的主演还有哪些职业？",
        "output": "select ?y where { ?x <代表作品> <通天帝国_（徐克执导电影）> . ?x <职业> <演员_（职业）> . ?x <职业> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国合伙人的导演还有哪些职业？",
        "output": "select distinct ?y where { ?x <代表作品> <中国合伙人_（2013年陈可辛执导电影）> . ?x <职业> <导演> . ?x <职业> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "同时出演中国合伙人和赵氏孤儿的演员是谁？",
        "output": "select ?x where { ?x <代表作品> <中国合伙人_（2013年陈可辛执导电影）> . ?x <代表作品> <赵氏孤儿_（2010年陈凯歌执导电影）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曾获得过\"台湾电影金马奖最佳导演\"和\"亚太电影节最佳男主角\"的人有哪些?",
        "output": "select ?x where { ?x <主要成就> \"台湾电影金马奖最佳导演\" . ?x <主要成就> \"亚太电影节最佳男主角\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "战争之王的演员有哪些?",
        "output": "select ?x where{ {?x <代表作品> <战争之王_（美国2005年尼古拉斯·凯奇主演电影）>} union {?x <登场作品> <战争之王_（美国2005年尼古拉斯·凯奇主演电影）>} union {?x <饰演> <战争之王_（美国2005年尼古拉斯·凯奇主演电影）>}}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Beyonce的代表作品有哪些？",
        "output": "select ?x where { ?y <别名> \"Beyonce\" . ?y <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "facebook全球粉丝最多的人是谁？",
        "output": "select ?x where{ ?x <主要成就> \"facebook粉丝全球第一\".}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孙悟空有哪些独门绝技？",
        "output": "select ?x where{ <孙悟空_（古典名著《西游记》中的主角）> <技能> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些球员获得过中超本土最佳射手？",
        "output": "select ?x where{ ?x <主要奖项> \"中超本土最佳射手\".}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德扑选手有哪些?",
        "output": "select ?x where{ ?x <运动项目> <德克萨斯扑克_（玩家对玩家的公共牌类游戏）> .}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为\"美洲的首都\"的美国城市在哪个州？",
        "output": "select ?y where { ?x <别名> \"美洲的首都\" . ?x <所属地区> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "原本属于俄罗斯的美国的州是哪个？",
        "output": "select ?x where { ?x <所属地区> <美国_（美利坚合众国）> . ?x <原属国> <俄罗斯帝国> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "既是政治家又是军人又是律师的人有哪些?",
        "output": "select ?x where { ?x <职业> <政治家> . ?x <职业> <律师_（职业）> . ?x <职业> <军人> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "既是政治家又是演员又是律师的人有哪些?",
        "output": "select ?x where { ?x <职业> <政治家> . ?x <职业> <律师_（职业）> . ?x <职业> <演员_（职业）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魔术师约翰逊穿多少号球衣？",
        "output": "select ?y where { ?x <别名> \"Magic Johnson（魔术师约翰逊）\" . ?x <球衣号码> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国四大菜系分别是什么？",
        "output": "select ?x where{<四大菜系> <分类> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基督教分为哪几个流派？",
        "output": "select ?x where{ <基督教> <三大流派> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由中本聪提出的电子货币流通平台主要是？",
        "output": "select ?y where { ?x <概念创始人> \"中本聪\" . ?x <种类> <电子货币_（通过电子化方式支付的货币）> . ?x <流通平台> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本的忍者主要是做什么的？",
        "output": "select ?x where{ <忍者_（日本特殊职业）> <作用> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "松花蛋是哪个游戏里的人物？",
        "output": "select ?x where{ ?x <主要角色> <松花蛋>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "连续三年获得全球500强企业榜首的连锁超市是哪家公司？",
        "output": "select ?x where { ?x <公司性质> <连锁超市> . ?x <荣誉> \"连蝉三年全球500强企业中居首位\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乔布斯创立的公司主要经营哪些产品？",
        "output": "select ?y where { ?x <创始人> <史蒂夫·乔布斯_（美国苹果公司联合创始人）> . ?x <经营范围> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红黄相间，鲜香酸甜的家常菜需要哪些食材？",
        "output": "select ?y where { ?x <特点> \"红黄相间，鲜香酸甜\" . ?x <主要食材> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "火箭奥沙利文出生于哪里？",
        "output": "select ?x where{ <罗尼·奥沙利文> <出生地> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "草泥马的别称是什么?",
        "output": "select ?x where{ <羊驼> <别称> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "时尚界著名的老佛爷留下了哪些不朽的成就？",
        "output": "select ?x where { <老佛爷_（知名设计师卡尔·拉格斐）> <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胃癌的发病诱因有哪些？",
        "output": "select ?x where { <胃癌_（医疗百科）> <常见病因> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "粉丝名为千纸鹤的该明星的经纪公司是？",
        "output": "select ?x where { ?y <粉丝名称> \"千纸鹤\" . ?y <经纪公司> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "经典女香\"水之恋\"的品牌下还有哪些香水？",
        "output": "select ?x where {  <水之恋女士香水> <设计师> ?y . ?z <创立者> ?y . ?x <品牌> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《小王子》的作者都有哪些代表作品？",
        "output": "select ?x where { <小王子（中英文对照）> <作者> ?y . ?y <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧武林外传里口头禅是额滴神啊的人物的小姑子的哥哥是谁？",
        "output": "select ?z where {  <额滴神啊> <人物> ?y . ?x <哥哥> ?z . ?x <嫂子> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧武林外传里厨师李秀莲的妈妈叫什么？",
        "output": "select ?x where { ?x <儿子> ?y . ?y <职业> <厨师> . ?y <中文名> \"李秀莲\"\t  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧武林外传里提到的天下第一女捕头是？",
        "output": "select ?x where {  ?x <主要成就> \"成为天下第一女捕头\" . ?x <登场作品> <武林外传_（2006年章回体古装情景喜剧）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张翠山在冰火岛认识了谁，后来有了儿子？",
        "output": "select ?x where {  <冰火岛> <居住人> ?x . <张翠山> <妻子> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纪晓芙的女儿后来嫁给了谁？",
        "output": "select ?x where {  <纪晓芙> <女儿> ?y . ?x <妻子> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郭襄建立的门派后来都有哪些弟子？",
        "output": "select ?x where { <郭襄> <传人> ?x .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨过和小龙女的后代都会哪些武功？",
        "output": "select ?x where {  ?y <先祖> <杨过> . ?y <先祖> <龙儿_（小说《神雕侠侣》中小龙女的爱称）> . {?y <主要武功> ?x.} UNION  {?y <其它武功> ?x.} }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "情深深雨濛濛中陆振华的提到名字的两任妻子都叫什么？",
        "output": "select ?x where {  {?x <丈夫> <陆振华_（《烟雨濛濛》《情深深雨濛濛》人物）>.} UNION  {<陆振华_（《烟雨濛濛》《情深深雨濛濛》人物）> <妻子> ?x.} }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "情深深雨濛濛中\"白玫瑰\"的恋人叫？",
        "output": "select ?x where {  ?y <其他名称> \"白玫瑰、依萍、依萍小姐\" . ?y <恋人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "敏惠恭和元妃生前的寝宫是？",
        "output": "select ?x where {  ?y <别名> \"敏惠恭和元妃，\" . ?y <寝宫> ?x .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕容云海的女朋友的初恋的心上人是？",
        "output": "select ?x where {  <慕容云海> <女友> ?y . ?y <初恋> ?z . ?x <喜欢的人> ?z .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冥王星是哪个星座的守护星？",
        "output": "select ?x where {  ?x <主宰行星> <冥王星_（太阳系中的一个天体）> .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "游戏idolish7的声优是哪些人？",
        "output": "select ?x where {  <idolish7> <主要配音> ?x.  filter(!regex(str(?x),\".*韩国.*\")) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "包含御手杵、次郎太刀的游戏作品的声优有哪些？",
        "output": "select ?x where {  <次郎太刀> <登场作品> ?y.  ?y <主要配音> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "游戏刀剑乱舞是围绕什么主题展开的？",
        "output": "select ?x where {  <刀剑乱舞_（日本网页游戏）> <内容主题> ?x.   }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名的亚历山大大帝的亲人有哪些？",
        "output": "select ?x where {  {<亚历山大大帝_（马其顿国王、亚历山大帝国皇帝）> <妻子> ?x.}  UNION  {<亚历山大大帝_（马其顿国王、亚历山大帝国皇帝）> <儿子> ?x.}}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名的亚历山大大帝一生最大的成就是？",
        "output": "select ?x where {  <亚历山大大帝_（马其顿国王、亚历山大帝国皇帝）> <主要成就> ?x .   }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被法国人民称为奥尔良的少女的是？",
        "output": "select ?x where {  ?x <称号> <奥尔良少女> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乖离剑出自于的这部作品中登场人物有哪些？",
        "output": "select ?x where {  <乖离剑> <出处> ?y . ?x <登场作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为老萨的乒乓球运动员是？",
        "output": "select ?x where {  ?x <运动项目> <乒乓球> . ?x <别名> \"老萨\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2001年的乒乓球世界杯男单冠军是哪国球员？",
        "output": "select ?x where {  ?y <国籍> ?x . ?y <主要奖项> \"2001年 乒乓球世界杯男单冠军\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得2002年乒乓球世界杯男单冠军的运动员来自哪个国家？",
        "output": "select ?x where {  ?y <国籍> ?x . ?y <主要奖项> \"2002年乒乓球世界杯男单冠军\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李隼教练带出过哪位队员曾夺得奥运冠军？",
        "output": "select ?x where {  ?x <教练> <李隼> . ?x <主要奖项> \"2004年雅典奥运会女单冠军\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国国乒队中哪些运动员是弧圈结合快攻打法？",
        "output": "select ?x where {  ?x <所属运动队> <中国乒乓球队> . ?x <专业特点> <弧圈结合快攻打法> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "御坂美琴的能力等级是多少？",
        "output": "select ?y where { ?x <代表人物> <御坂美琴> . ?x <能力等级> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在魔法禁术目录中，index的中文名是什么？",
        "output": "select ?x where { <index_（《魔法禁书目录》中的角色）> <中文名> ?x . }"
    }
]