[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "余额宝正式上线时间",
        "output": "select ?x where { <余额宝> <上线时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银信合作理财产品",
        "output": "select ?x where { <银信合作理财产品> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欧美黄金市场上交易黄金，使用的计量单位",
        "output": "select ?x where { <欧美黄金市场> <交易计量单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金市场指数的代表",
        "output": "select ?x where { <黄金市场> <代表指数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伦敦国际黄金市场上的黄金现货交易方式",
        "output": "select ?x where { <伦敦黄金市场> <现货交易方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金期货交易的标准量",
        "output": "select ?x where { <黄金期货> <交易标准量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界四大证券交易所是哪4个",
        "output": "select ?x where { <证券交易所> <四强排名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海证券交易所成立时间",
        "output": "select ?x where { <上海证券交易所> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "正规期货交易平台有哪些",
        "output": "select ?x where { <期货交易平台> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股指期货的开盘时间",
        "output": "select ?x where { <股指期货> <开盘时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股指期货的收盘时间",
        "output": "select ?x where { <股指期货> <收盘时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中金所期货指数IF是什么英文单词的缩写",
        "output": "select ?x where { <中金所期货指数> <英文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中金所期货指数IH是什么意思",
        "output": "select ?x where { <中金所期货指数> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融衍生工具中option是什么意思",
        "output": "select ?x where { <option_期权> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融衍生工具中forward是什么意思",
        "output": "select ?x where { <forward_远期合约> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融衍生工具中futures是什么意思",
        "output": "select ?x where { <futures_期货> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海期货交易所的可交易品类有哪些",
        "output": "select ?x where { <上海期货交易所> <上市品种>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连商品交易所的可交易品种有哪些",
        "output": "select ?x where { <大连商品交易所> <上市品种>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑州商品交易所的可交易品种都包括什么",
        "output": "select ?x where { <郑州商品交易所> <上市品种>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海国际能源交易中心的可交易品种有什么",
        "output": "select ?x where { <上海国际能源交易中心> <上市品种>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海国际能源交易中心的可交易品种有几个",
        "output": "select ?x where { <上海国际能源交易中心> <上市数量>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国金融期货交易所的可交易品种有哪些",
        "output": "select ?x where { <中国金融期货交易所> <上市品种>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "商品期货的集合竞价时间在什么时候",
        "output": "select ?x where { <商品期货> <集合竞价时间>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国十大保险公司",
        "output": "select ?x where { <保险公司> <十强排名> ?x.?x <国家> <中国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国平安的客服电话是多少",
        "output": "select ?x where { <中国平安> <客服电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "GPIC是什么保险公司?",
        "output": "select ?x where { <GPIC> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人们常说的\"五险一金\"都指的是什么?",
        "output": "select ?x where { <五险一金> <包含> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险的四项基本原则是什么?",
        "output": "select ?x where { <保险> <原则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险中三差的是指什么?",
        "output": "select ?x where { <三差> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安保险有哪几种啊",
        "output": "select ?x where { <平安保险> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安保险诞生时间",
        "output": "select ?x where { <平安保险> <公司成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国平安的公司口号",
        "output": "select ?x where { <平安保险> <公司口号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国平安的总部地点",
        "output": "select ?x where { <平安保险> <总部地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的注册资本",
        "output": "select ?x where { <平安保险> <注册资本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人民币的货币符号是什么",
        "output": "select ?x where { <人民币> <货币符号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港元的货币符号是什么",
        "output": "select ?x where { <港元> <货币符号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中华人民共和国大陆地区的法定货币是什么",
        "output": "select ?x where { <中国> <法定货币> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人民币发行方",
        "output": "select ?x where { <人民币> <发行方> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人民币的基本单位",
        "output": "select ?x where { <人民币> <基本单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第五套人民币的发行时间",
        "output": "select ?x where { <第五套人民币> <发行时间>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第四套人民币的退出流通时间",
        "output": "select ?x where { <第四套人民币> <退出流通时间>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第一套人民币的最大面额",
        "output": "select ?x where { <第一套人民币> <最大面额>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第五套人民币硬币的券别",
        "output": "select ?x where { <第五套人民币硬币> <面额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第五套人民币纸币的最小面额",
        "output": "select ?x where { <第五套人民币纸币> <最小面额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第29届奥林匹克运动会纪念钞面额?",
        "output": "select ?x where { <纪念钞_（第29届奥林匹克运动会）> <面额>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第29届奥林匹克运动会纪念钞的发行量",
        "output": "select ?x where { <纪念钞_（第29届奥林匹克运动会）> <发行量>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "货币市场基金信用等级的划分类别",
        "output": "select ?x where { <货币市场基金信用等级> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长期资金借贷必须坚持的基本原则?",
        "output": "select ?x where { <长期资金借贷> <原则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人民币兑外币市场的交易方式",
        "output": "select ?x where { <人民币兑外币市场> <交易方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可转让大额定期存单的签发方",
        "output": "select ?x where { <可转让大额定期存单> <签发方> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银行发行可转让大额定期存单的方式",
        "output": "select ?x where { <可转让大额定期存单> <发行方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "典当市场的构成主体",
        "output": "select ?x where { <典当市场> <构成主体> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "短期证券市场的构成",
        "output": "select ?x where { <短期证券市场> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国货币市场构成",
        "output": "select ?x where { <美国货币市场> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "商业票据的发行者主要有?",
        "output": "select ?x where { <商业票据> <发行方> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "商业票据市场的类型",
        "output": "select ?x where { <商业票据市场> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "商业票据的发行方式",
        "output": "select ?x where { <商业票据> <发行方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "私募市场运作工具有哪些",
        "output": "select ?x where { <私募市场> <运作工具> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信贷市场的构成主体",
        "output": "select ?x where { <信贷市场> <构成主体> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贷款期限组成",
        "output": "select ?x where { <贷款期限> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纪念币的分类",
        "output": "select ?x where { <纪念币> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "比特币的发明人",
        "output": "select ?x where { <比特币> <发明者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "比特币最大的特点是什么?",
        "output": "select ?x where { <比特币> <特点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "货币的五大职能",
        "output": "select ?x where { <货币> <职能> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电子货币的种类",
        "output": "select ?x where { <电子货币> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金交易指定的清算银行有哪些",
        "output": "select ?x where { <黄金交易市场> <清算机构> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些高管?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的高管数量?",
        "output": "select ?x where { <维力医疗> <高管数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些男性高管?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <性别> <男>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些女性高管?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <性别> <女>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗女性高管的数量?",
        "output": "select ?x where { <维力医疗> <女性高管数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些高管年龄在50岁以上?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <大于> <50岁>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗哪个高管年龄最大?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <年龄> <最大>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗哪个高管年龄最小?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <年龄> <最小>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些高管年纪不到50?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <小于> <50岁>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些高管1970年前出生?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <出生早于> <1970年>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗董事长是谁?",
        "output": "select ?x where { <维力医疗> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗董事长的出生时间?",
        "output": "select ?x where { <维力医疗> <董事长> ?y. ?y <出生时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗董事长的学历?",
        "output": "select ?x where { <维力医疗> <董事长> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗董事长的上任时间?",
        "output": "select ?x where { <维力医疗> <董事长> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗公司成立时间?",
        "output": "select ?x where { <维力医疗> <公司成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗公司全称?",
        "output": "select ?x where { <维力医疗> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些高管硕士学历?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <学历类别> <硕士>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些高管本科学历?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <学历类别> <本科>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗有哪些高管大专学历?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <学历类别> <大专>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的第一任董事长?",
        "output": "select ?x where { <维力医疗> <第一任董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的副董事长?",
        "output": "select ?x where { <维力医疗> <副董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的法人?",
        "output": "select ?x where { <维力医疗> <公司法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的财务总监?",
        "output": "select ?x where { <维力医疗> <财务总监> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的董事成员?",
        "output": "select ?x where { <维力医疗> <董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的独立董事成员?",
        "output": "select ?x where { <维力医疗> <独立董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的监事会成员?",
        "output": "select ?x where { <维力医疗> <监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的监事会主席?",
        "output": "select ?x where { <维力医疗> <监事会主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的有几位副总经理?",
        "output": "select ?x where { <维力医疗> <副总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的职工监事是谁?",
        "output": "select ?x where { <维力医疗> <职工监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的最新上任的独立董事是谁?",
        "output": "select ?x where { <维力医疗> <现任独立董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的独立董事的上任时间?",
        "output": "select ?x where { <维力医疗> <独立董事> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗第一任董事长的上任时间?",
        "output": "select ?x where { <维力医疗> <第一任董事长> ?y. ?y <上任时间>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的向董国籍?",
        "output": "select ?x where { <向彬_(维力医疗董事长)> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的向董的毕业院校?",
        "output": "select ?x where { <向彬_(维力医疗董事长)> <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的法人的毕业院校?",
        "output": "select ?x where { <维力医疗> <公司法人> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的向董的硕士学位?",
        "output": "select ?x where { <向彬_(维力医疗董事长)> <硕士学位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的高管中的双学士学位是哪两个学位?",
        "output": "select ?x where { <维力医疗> <公司高管> ?y. ?y <双学士学位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的高管中谁是复旦大学毕业的?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <毕业院校> <复旦大学>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的陈云桂中拥有哪2两个专业的学士学位?",
        "output": "select ?x where { <维力医疗> <公司高管> ?y. ?y <双学士学位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的舒杰在哪个学校毕业的?",
        "output": "select ?x where { <舒杰_(维力医疗高管)> <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的舒杰毕业专业?",
        "output": "select ?x where { <舒杰_(维力医疗高管)> <毕业专业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的赵彤威毕业专业?",
        "output": "select ?x where { <赵彤威_(维力医疗高管)> <毕业专业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的赵彤威在哪个学校毕业的?",
        "output": "select ?x where { <赵彤威_(维力医疗高管)> <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗的谭文晖在哪些公司担任独立董事?",
        "output": "select ?x where { <谭文晖_(维力医疗高管)> <曾任职公司> ?x. ?x <职位名称> <独立董事>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗哪个高管曾任韦士泰董事长",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <曾任职公司> <韦士泰>. ?x <曾任职位> <董事长>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗哪个高管曾任韦士泰的董事?",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <曾任职公司> <韦士泰>. ?x <曾任职位> <董事>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗哪个高管曾被评为广州市青年技术创新标兵",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <授予称号> <广州市青年技术创新标兵>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "维力医疗哪个高管曾任番禺维力总经理",
        "output": "select ?x where { <维力医疗> <公司高管> ?x. ?x <曾任职公司> <番禺维>. ?x <曾任职位> <总经理>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "000016的公司名称是什么?",
        "output": "select ?x where { <000016> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团股份有限公司的公司简称?",
        "output": "select ?x where { <康佳集团股份有限公司> <公司简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的非职工监事是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <非职工监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的总裁是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的副总裁是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <副总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的董事局主席是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <董事局主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的非独立董事有谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <非独立董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的董事会秘书是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <董事会秘书> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的监事长是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <监事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的职工监事是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <职工监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的财务总监是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <财务总监> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "传染性软疣在什么科室就诊？",
        "output": "select ?x where { <传染性软疣> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斑釉牙属于什么?",
        "output": "select ?x where { <斑釉牙> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支气管扩张属于什么?",
        "output": "select ?x where { <支气管扩张> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢深静脉血栓形成属于什么?",
        "output": "select ?x where { <下肢深静脉血栓形成> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢深静脉血栓形成在什么科室就诊？",
        "output": "select ?x where { <下肢深静脉血栓形成> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢深静脉血栓形成的同义词是什么？",
        "output": "select ?x where { <下肢深静脉血栓形成> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢深静脉血栓形成涉及哪些症状？",
        "output": "select ?x where { <下肢深静脉血栓形成> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "噬血细胞综合征属于什么?",
        "output": "select ?x where { <噬血细胞综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "局限性外耳道炎属于什么?",
        "output": "select ?x where { <局限性外耳道炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "骨质疏松属于什么?",
        "output": "select ?x where { <骨质疏松> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "流行性感冒属于什么?",
        "output": "select ?x where { <流行性感冒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么措施预防流行性感冒？",
        "output": "select ?x where { <流行性感冒> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "流行性感冒有哪些症状？",
        "output": "select ?x where { <流行性感冒> <症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "流行性感冒应该去哪个科室就诊？",
        "output": "select ?x where { <流行性感冒> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "流行性感冒会涉及哪些症状？",
        "output": "select ?x where { <流行性感冒> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霍奇金病属于什么?",
        "output": "select ?x where { <霍奇金病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肛裂属于什么?",
        "output": "select ?x where { <肛裂> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿猫叫综合征属于什么?",
        "output": "select ?x where { <小儿猫叫综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "单纯疱疹在什么科室就诊？",
        "output": "select ?x where { <单纯疱疹> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蜂窝织炎属于什么?",
        "output": "select ?x where { <蜂窝织炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蜂窝织炎在什么科室就诊？",
        "output": "select ?x where { <蜂窝织炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蜂窝织炎还与什么症状有关？",
        "output": "select ?x where { <蜂窝织炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "围绝经期综合征属于什么?",
        "output": "select ?x where { <围绝经期综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胰腺癌属于什么?",
        "output": "select ?x where { <胰腺癌> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胰腺癌属于什么科？",
        "output": "select ?x where { <胰腺癌> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胰腺癌的同义词是什么？",
        "output": "select ?x where { <胰腺癌> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胰腺癌还与什么症状有关？",
        "output": "select ?x where { <胰腺癌> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阴道炎属于什么?",
        "output": "select ?x where { <阴道炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拇囊炎属于什么?",
        "output": "select ?x where { <拇囊炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Turner综合征属于什么?",
        "output": "select ?x where { <Turner综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气胸属于什么?",
        "output": "select ?x where { <气胸> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气胸涉及什么检查？",
        "output": "select ?x where { <气胸> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汗斑属于什么?",
        "output": "select ?x where { <汗斑> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "过敏性哮喘属于什么?",
        "output": "select ?x where { <过敏性哮喘> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "室间隔缺损属于什么?",
        "output": "select ?x where { <室间隔缺损> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乳头内陷属于什么?",
        "output": "select ?x where { <乳头内陷> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝囊肿属于什么?",
        "output": "select ?x where { <肝囊肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低钙血症属于什么?",
        "output": "select ?x where { <低钙血症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脉管炎属于什么?",
        "output": "select ?x where { <脉管炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性会厌炎属于什么?",
        "output": "select ?x where { <急性会厌炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性会厌炎在什么科室就诊？",
        "output": "select ?x where { <急性会厌炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性会厌炎涉及什么症状？",
        "output": "select ?x where { <急性会厌炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "防风通圣丸是中药还是西药？",
        "output": "select ?x where { <防风通圣丸> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "藿香正气胶囊是中药还是西药？",
        "output": "select ?x where { <藿香正气胶囊> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "连花清瘟胶囊是中药还是西药？",
        "output": "select ?x where { <连花清瘟胶囊> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "疏风解毒胶囊属于什么药？",
        "output": "select ?x where { <疏风解毒胶囊> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "解毒胶囊是中药还是西药？",
        "output": "select ?x where { <解毒胶囊> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏合香丸属于什么药种？",
        "output": "select ?x where { <苏合香丸> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安宫牛黄丸属于什么药种？",
        "output": "select ?x where { <安宫牛黄丸> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血必净注射液属于什么药种？",
        "output": "select ?x where { <血必净注射液> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿腹泻散属于什么药种？",
        "output": "select ?x where { <小儿腹泻散> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿腹泻贴属于什么药种？",
        "output": "select ?x where { <小儿腹泻贴> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿腹泻宁合剂属于什么药种？",
        "output": "select ?x where { <小儿腹泻宁合剂> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "干咳属于什么？",
        "output": "select ?x where { <干咳> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "干咳涉及怎样的症状？",
        "output": "select ?x where { <干咳> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "干咳与哪些疾病有关？",
        "output": "select ?x where { <干咳> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸困难属于什么？",
        "output": "select ?x where { <呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸困难涉及哪些症状？",
        "output": "select ?x where { <呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸困难与哪些疾病有关？",
        "output": "select ?x where { <呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸困难的指标看什么？",
        "output": "select ?x where { <呼吸困难> <指标> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞属于什么？",
        "output": "select ?x where { <鼻塞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞涉及哪些症状？",
        "output": "select ?x where { <鼻塞> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞与哪些疾病有关？",
        "output": "select ?x where { <鼻塞> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹泻属于什么？",
        "output": "select ?x where { <腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹泻与哪些疾病有关？",
        "output": "select ?x where { <腹泻> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "流涕属于什么？",
        "output": "select ?x where { <流涕> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咽痛属于什么？",
        "output": "select ?x where { <咽痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咽痛涉及什么检查？",
        "output": "select ?x where { <咽痛> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咽痛涉及哪些症状？",
        "output": "select ?x where { <咽痛> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咽痛与哪些疾病有关？",
        "output": "select ?x where { <咽痛> <涉及疾病> ?x. }"
    }
]