[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平卧呼吸困难该如何预防？",
        "output": "select ?x where { <平卧呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平卧呼吸困难的起因是什么？",
        "output": "select ?x where { <平卧呼吸困难> <起因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是平卧呼吸困难？",
        "output": "select ?x where { <平卧呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水肿伴呼吸困难、紫绀该如何预防？",
        "output": "select ?x where { <水肿伴呼吸困难、紫绀> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断水肿伴呼吸困难、紫绀？",
        "output": "select ?x where { <水肿伴呼吸困难、紫绀> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防吸气性呼吸困难？",
        "output": "select ?x where { <吸气性呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸气性呼吸困难在医学专科中属于什么科？",
        "output": "select ?x where { <吸气性呼吸困难> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸气性呼吸困难如何诊断？",
        "output": "select ?x where { <吸气性呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心源性呼吸困难该怎么预防？",
        "output": "select ?x where { <心源性呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心源性呼吸困难有怎样的诊断依据？",
        "output": "select ?x where { <心源性呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸痛伴呼吸困难有哪些预防措施？",
        "output": "select ?x where { <胸痛伴呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断胸痛伴呼吸困难？",
        "output": "select ?x where { <胸痛伴呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阵发性夜间呼吸困难是否具有传染性？",
        "output": "select ?x where { <阵发性夜间呼吸困难> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于阵发性夜间呼吸困难，有怎样的预防措施？",
        "output": "select ?x where { <阵发性夜间呼吸困难> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断阵发性夜间呼吸困难？",
        "output": "select ?x where { <阵发性夜间呼吸困难> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞及反射性头痛要如何预防？",
        "output": "select ?x where { <鼻塞及反射性头痛> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断鼻塞及反射性头痛？",
        "output": "select ?x where { <鼻塞及反射性头痛> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防鼻塞排出脓性或血性分泌物？",
        "output": "select ?x where { <鼻塞排出脓性或血性分泌物> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断鼻塞排出脓性或血性分泌物？",
        "output": "select ?x where { <鼻塞排出脓性或血性分泌物> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "侧卧时位于下侧鼻腔出现鼻塞需要怎么预防？",
        "output": "select ?x where { <侧卧时位于下侧鼻腔出现鼻塞> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断侧卧时位于下侧鼻腔出现鼻塞？",
        "output": "select ?x where { <侧卧时位于下侧鼻腔出现鼻塞> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "女性周期性鼻塞和鼻衄该怎么预防？",
        "output": "select ?x where { <女性周期性鼻塞和鼻衄> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "女性周期性鼻塞和鼻衄有怎样的诊断依据？",
        "output": "select ?x where { <女性周期性鼻塞和鼻衄> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阵发性鼻塞有哪些预防措施？",
        "output": "select ?x where { <阵发性鼻塞> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阵发性鼻塞是怎么诊断的？",
        "output": "select ?x where { <阵发性鼻塞> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吞咽痛该怎么预防？",
        "output": "select ?x where { <吞咽痛> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断吞咽痛？",
        "output": "select ?x where { <吞咽痛> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吞咽痛而拒食该如何预防？",
        "output": "select ?x where { <吞咽痛而拒食> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吞咽痛而拒食的起因是什么？",
        "output": "select ?x where { <吞咽痛而拒食> <起因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断吞咽痛而拒食？",
        "output": "select ?x where { <吞咽痛而拒食> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性腹泻要如何预防？",
        "output": "select ?x where { <病毒性腹泻> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性腹泻有怎样的诊断依据？",
        "output": "select ?x where { <病毒性腹泻> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "分泌性腹泻应该如何预防？",
        "output": "select ?x where { <分泌性腹泻> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "分泌性腹泻是怎么诊断的？",
        "output": "select ?x where { <分泌性腹泻> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹泻与便秘交替能有哪些预防措施？",
        "output": "select ?x where { <腹泻与便秘交替> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断腹泻与便秘交替？",
        "output": "select ?x where { <腹泻与便秘交替> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹泻为水样带黏液恶臭无脓血该怎么预防？",
        "output": "select ?x where { <腹泻为水样带黏液恶臭无脓血> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹泻为水样带黏液恶臭无脓血如何诊断？",
        "output": "select ?x where { <腹泻为水样带黏液恶臭无脓血> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹痛伴腹泻该怎么预防？",
        "output": "select ?x where { <腹痛伴腹泻> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹痛伴腹泻该如何诊断？",
        "output": "select ?x where { <腹痛伴腹泻> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "生理性腹泻需要做哪些预防措施？",
        "output": "select ?x where { <生理性腹泻> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习惯性腹泻要怎么预防？",
        "output": "select ?x where { <习惯性腹泻> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断习惯性腹泻？",
        "output": "select ?x where { <习惯性腹泻> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心悸伴消瘦、腹泻要做哪些预防措施？",
        "output": "select ?x where { <心悸伴消瘦、腹泻> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"慢性乙型肝炎患者发病位置在哪里？\"",
        "output": "select ?x where { <慢性乙型肝炎> <常见发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有慢性乙型肝炎应该去哪个科室就诊？",
        "output": "select ?x where { <慢性乙型肝炎> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性乙型肝炎会伴随什么样的病症？",
        "output": "select ?x where { <慢性乙型肝炎> <常见症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈椎病是怎么造成的？",
        "output": "select ?x where { <颈椎病> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈椎病又叫什么？",
        "output": "select ?x where { <颈椎病> <名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "骨髓炎是怎么引起的？",
        "output": "select ?x where { <骨髓炎> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "骨髓炎的外文名称是什么？",
        "output": "select ?x where { <骨髓炎> <英文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "骨髓炎患者应该在什么科就诊？",
        "output": "select ?x where { <骨髓炎> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "骨髓炎患者会有怎样的症状表现？",
        "output": "select ?x where { <骨髓炎> <常见症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "骨髓炎的发病部位是哪儿？",
        "output": "select ?x where { <骨髓炎> <常见发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霉菌性阴道炎还能称作什么？",
        "output": "select ?x where { <霉菌性阴道炎> <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霉菌性阴道炎多发生在哪种人群？",
        "output": "select ?x where { <霉菌性阴道炎> <多发群体> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霉菌性阴道炎是怎么引发的？",
        "output": "select ?x where { <霉菌性阴道炎> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霉菌性阴道炎是怎么传播的？",
        "output": "select ?x where { <霉菌性阴道炎> <传播途径> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霉菌性阴道炎患者应在哪个科室就诊？",
        "output": "select ?x where { <霉菌性阴道炎> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霉菌性阴道炎会有怎样的症状？",
        "output": "select ?x where { <霉菌性阴道炎> <常见症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿肺炎是由于什么导致的？",
        "output": "select ?x where { <新生儿肺炎> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "滴虫性阴道炎是怎么传播的？",
        "output": "select ?x where { <滴虫性阴道炎> <传播途径> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "滴虫性阴道炎的外文名称是什么？",
        "output": "select ?x where { <滴虫性阴道炎> <英文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "滴虫性阴道炎患者应该去哪个科室就诊？",
        "output": "select ?x where { <滴虫性阴道炎> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痛性抽搐患者会有哪些症状表现？",
        "output": "select ?x where { <痛性抽搐> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痛性抽搐在医学外科中属于什么科？",
        "output": "select ?x where { <痛性抽搐> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "角结膜干燥症患者应该去哪个科室就诊？",
        "output": "select ?x where { <角结膜干燥症> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "角结膜干燥症患者会有哪些临床的症状表现？",
        "output": "select ?x where { <角结膜干燥症> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "角结膜干燥症是怎么引发的？",
        "output": "select ?x where { <角结膜干燥症> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "角结膜干燥症多发生在哪个人群之中？",
        "output": "select ?x where { <角结膜干燥症> <多发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雀斑常显现在人身体的什么部位？",
        "output": "select ?x where { <雀斑> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有雀斑应该去哪个科室咨询？",
        "output": "select ?x where { <雀斑> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "为什么会出现雀斑？",
        "output": "select ?x where { <雀斑> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么人群容易有雀斑？",
        "output": "select ?x where { <雀斑> <多发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肾衰竭患者应该去哪个科室就诊？",
        "output": "select ?x where { <肾衰竭> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肾衰竭是怎么造成的？",
        "output": "select ?x where { <肾衰竭> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "会厌炎的另一个名称是什么？",
        "output": "select ?x where { <会厌炎> <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "会厌炎患者应该去哪个科室就诊？",
        "output": "select ?x where { <会厌炎> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "会厌炎是如何引发的？",
        "output": "select ?x where { <会厌炎> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝内胆管结石是怎么造成的？",
        "output": "select ?x where { <肝内胆管结石> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝内胆管结石患者应该去哪个科室就诊？",
        "output": "select ?x where { <肝内胆管结石> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡又称为什么？",
        "output": "select ?x where { <口腔溃疡> <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡会不会传染？",
        "output": "select ?x where { <口腔溃疡> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡是怎么引起的？",
        "output": "select ?x where { <口腔溃疡> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡患者会出现怎样的病症？",
        "output": "select ?x where { <口腔溃疡> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡患者多处于哪种人群？",
        "output": "select ?x where { <口腔溃疡> <多发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三叉神经痛患者应该去哪个科室就诊？",
        "output": "select ?x where { <三叉神经痛> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种人群容易三叉神经痛？",
        "output": "select ?x where { <三叉神经痛> <多发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "类风湿关节炎患者应该去哪个科室就诊？",
        "output": "select ?x where { <类风湿关节炎> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "类风湿关节炎患者会有怎样的病症反应？",
        "output": "select ?x where { <类风湿关节炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种人群容易患有类风湿关节炎？",
        "output": "select ?x where { <类风湿关节炎> <多发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "输卵管积液是否会传染？",
        "output": "select ?x where { <输卵管积液> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "输卵管积液患者会有怎样的症状表现？",
        "output": "select ?x where { <输卵管积液> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多囊肾是怎么造成的？",
        "output": "select ?x where { <多囊肾> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "消化性溃疡患者应该去哪个科室就诊？",
        "output": "select ?x where { <消化性溃疡> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "消化性溃疡患者有哪些病症？",
        "output": "select ?x where { <消化性溃疡> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸入性肺炎是怎么引起的？",
        "output": "select ?x where { <吸入性肺炎> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断吸入性肺炎？",
        "output": "select ?x where { <吸入性肺炎> <诊断方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸入性肺炎患者有怎样的病症表现？",
        "output": "select ?x where { <吸入性肺炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸入性肺炎哪种人群容易患有？",
        "output": "select ?x where { <吸入性肺炎> <常见始发于> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些因素最容易诱发吸入性肺炎？",
        "output": "select ?x where { <吸入性肺炎> <风险因子（英语：Riskfactor）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与吸入性肺炎相似的疾病或共病是什么？",
        "output": "select ?x where { <吸入性肺炎> <相似疾病或共病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝衰竭通常是由于什么引起的？",
        "output": "select ?x where { <肝衰竭> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝衰竭患者应在什么科就诊？",
        "output": "select ?x where { <肝衰竭> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "先天愚型是由于什么导致的？",
        "output": "select ?x where { <先天愚型> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "先天愚型还能称作什么？",
        "output": "select ?x where { <先天愚型> <名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "增龄性黄斑变性的病因是什么？",
        "output": "select ?x where { <增龄性黄斑变性> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "增龄性黄斑变性也叫什么？",
        "output": "select ?x where { <增龄性黄斑变性> <名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支气管肺炎的发病位置在人体的什么地方？",
        "output": "select ?x where { <支气管肺炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支气管肺炎患者应在什么科就诊？",
        "output": "select ?x where { <支气管肺炎> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九江隶属于远洲旗下的酒店有哪些？",
        "output": "select ?x where { ?x <城市> <九江> . ?x <酒店品牌名称> <远洲> . ?x <类型> <酒店> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问颐和园中文昌院什么时候对外开放？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <文昌院>. <文昌院> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都博物馆新馆内有商店吗？",
        "output": "select ?x where { <成都博物馆新馆> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门京闽中心酒店有4个人能住的房间吗？",
        "output": "select ?y where { <厦门京闽中心酒店> <房型名称> ?y. ?y <容纳人数> \"4.0\"^^<http://www.w3.org/2001/XMLSchema#float>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在昆明, 且距离佳华广场酒店附近5公里的景点有哪些？",
        "output": "select ?y where { <昆明佳华广场酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <昆明>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫内有餐厅吗？",
        "output": "select ?x where { <布达拉宫> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学艺术博物馆在日坛宾馆的哪个方向呀？",
        "output": "select ?x where { <清华大学艺术博物馆> <位于> ?cvt.  ?cvt <实体名称> <日坛宾馆>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周六想去4A的景山公园游玩，联系方式是？",
        "output": "select ?x where { <景山公园> <景点的等级A> \"4A\" . <景山公园> <电话> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "萤火虫星空艺术馆（钟楼旗舰店）附近2公里有哪些地点呀？",
        "output": "select ?y where { <萤火虫星空艺术馆（钟楼旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贵阳喜来登贵航酒店附近5公里还有哪些酒店推荐？",
        "output": "select ?y where { <贵阳喜来登贵航酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <贵阳>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江门逸豪酒店的豪华景观套房的床大概多大？",
        "output": "select ?x where { <江门逸豪酒店> <房型名称> <豪华景观套房>. <豪华景观套房> <床的详情> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕田峪长城适合玩多久？",
        "output": "select ?x where { <慕田峪长城> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉锦江国际大酒店房型为行政景观大床套房最多能住几个人呀？",
        "output": "select ?g where { <武汉锦江国际大酒店>     <房型名称>      <行政景观大床套房>. <行政景观大床套房>      <容纳人数> ?g. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津梵高星空艺术馆（天河城旗舰店）附近2公里有什么好玩的？",
        "output": "select ?y where { <天津梵高星空艺术馆（天河城旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津梵高星空艺术馆（天河城旗舰店）适合什么时候玩？",
        "output": "select ?x where {<天津梵高星空艺术馆（天河城旗舰店）> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东城的5D流星雨星空馆的娱乐区是什么样的？可以描述一下吗？",
        "output": "select ?x where { <5D流星雨古装星空馆（东城店）> <娱乐项目名称> <娱乐区>. <娱乐区> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "5D流星雨古装星空馆（东城店）的详细地址？",
        "output": "select ?x where { <5D流星雨古装星空馆（东城店）> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "惠东县品牌为喜来登的酒店都有啥啊？",
        "output": "select ?x where { ?x <城市> <惠东县> . ?x <酒店品牌名称> <喜来登> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "温岭市有多少曙光国际品牌的酒店？",
        "output": "select (count(?x) as ?count_hotel) where {      ?x <城市> <温岭市>.     ?x <酒店品牌名称> <曙光国际>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从雍和宫出发去神玉艺术馆，请问往哪个方向前进？",
        "output": "select ?x where { <神玉艺术馆> <位于> ?cvt.  ?cvt <实体名称> <雍和宫>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "旅游第一站准备去北海公园，第二站准备去天坛公园，请问这两个景点距离多远？",
        "output": "select ?t where { <北海公园> <附近> ?cvt. ?cvt <实体名称> <天坛公园>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "5D流星雨古装星空馆（东城店）是免费的吗？",
        "output": "select ?x where { <5D流星雨古装星空馆（东城店）> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咸宁有哪些碧桂园凤凰的酒店？",
        "output": "select ?x where { ?x <城市> <咸宁> . ?x <酒店品牌名称> <碧桂园凤凰> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅溪湖艺术中心《流动的永恒》展中的戏剧崩塌是什么东西？",
        "output": "select ?x where { <梅溪湖国际文化艺术中心艺术馆《流动的永恒》展> <娱乐项目名称> <戏剧崩塌>. <戏剧崩塌> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园的门票多少钱？",
        "output": "select ?x where { <景山公园> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赣州锦江国际酒店内有高尔夫球场吗？",
        "output": "select ?x where { <赣州锦江国际酒店> <是否有高尔夫球场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园位于雍和宫的什么方向？",
        "output": "select ?x where {  <颐和园> <位于> ?cvt.  ?cvt <实体名称> <雍和宫>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都香格里拉大酒店内能免费停车吗？",
        "output": "select ?x where { <成都香格里拉大酒店> <是否有免费停车> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贵阳世纪金源饭店内有叫醒服务吗？",
        "output": "select ?x where { <贵阳世纪金源大饭店> <是否有叫醒服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王府半岛酒店的入住时间？",
        "output": "select ?x where { <王府半岛酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "17岁能自己入住三明宾馆天元国际吗？",
        "output": "select ?x where { <三明宾馆·天元国际> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京华侨大厦的最早入住时间几点？",
        "output": "select ?x where { <北京华侨大厦> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津的梵高星空艺术馆（天河城旗舰店）门票是多少钱？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <城市> <天津> . <天津梵高星空艺术馆（天河城旗舰店）> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛幻光之城星空艺术馆收费吗？",
        "output": "select ?x where { <青岛幻光之城星空艺术馆（台东旗舰店）> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园的优惠政策都有啥？",
        "output": "select ?x where { <颐和园> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在杭州西湖风景名胜区（西湖）附近5公里的景点包括哪些？",
        "output": "select ?y where { <西湖风景名胜区（西湖）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?d. filter(?d<=5). ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "描述一下大连梵高梦境星空馆里面的无限星空项目是什么样子的",
        "output": "select ?x where { <大连梵高梦境星空馆> <娱乐项目名称> <无限星空>. <无限星空> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "延庆县有凯悦酒店吗？",
        "output": "select ?x where { ?x <城市> <延庆县> . ?x <酒店品牌名称> <凯悦> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中信宁波国际大酒店附近2公里的景点都有什么？",
        "output": "select ?y where { <中信宁波国际大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开元名都酒店在哪些城市？",
        "output": "select distinct ?x where { ?y <城市> ?x. ?y <类型> <酒店>. ?y <酒店品牌名称> <开元名都>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "合肥天鹅湖大酒店的最晚退房时间是几点？",
        "output": "select ?x where { <合肥天鹅湖大酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫和拉萨圣地天堂洲际大饭店距离多远？",
        "output": "select ?t where { <布达拉宫> <附近> ?cvt. ?cvt <实体名称> <拉萨圣地天堂洲际大饭店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从长沙芙蓉国温德姆至尊豪廷大酒店到长沙中维神农大酒店有几公里？",
        "output": "select ?t where { <长沙芙蓉国温德姆至尊豪廷大酒店> <附近> ?cvt. ?cvt <实体名称> <长沙中维神农大酒店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园内有储物柜租赁吗？",
        "output": "select ?x where { <北海公园> <是否有储物柜租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆的详细地址？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园距离奥林匹克森林公园多远？",
        "output": "select ?t where { <北海公园> <附近> ?cvt. ?cvt <实体名称> <奥林匹克森林公园>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕田峪长城的平均价格是多少？",
        "output": "select ?x where { <慕田峪长城> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院的地址在哪？",
        "output": "select ?x where { <国家大剧院> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五个人去秀兰饭店住，哪个房型合适啊？",
        "output": "select ?y where { <秀兰饭店> <房型名称> ?y. ?y <容纳人数> \"5.0\"^^<http://www.w3.org/2001/XMLSchema#float>. ?y <类型> <房型>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京爱情博物展（新街口总店）坐落在哪所城市？",
        "output": "select ?y where {      <南京爱情博物展（新街口总店）> <城市> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆君豪大饭店的电话号是多少？",
        "output": "select ?x where { <重庆君豪大饭店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在淮北品牌名称为金陵连锁的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <淮北> . ?x <酒店品牌名称> <金陵连锁> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连凯宾斯基饭店有无线网吗？",
        "output": "select ?x where { <大连凯宾斯基饭店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆附近5公里的景点有哪些？",
        "output": "select ?y where { <广州失恋博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京哪些酒店可以办婚礼",
        "output": "select ?x where { ?x <城市> <北京>. ?x <是否有婚宴服务> <提供婚宴服务,可能收费>. ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "离雍和宫最近的酒店是哪家？",
        "output": "select ?y where { <雍和宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津新桃园酒店附近5公里的景点都有？",
        "output": "select ?y where { <天津新桃园酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <天津>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫附近哪个酒店带桌球室？",
        "output": "select ?y where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有桌球室> <有台球室>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "离颐和园最近的酒店是哪一个？",
        "output": "select ?y  where { <颐和园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大庆包括几个4A级别的景点？",
        "output": "select ?x where {      ?x <城市> <大庆>.     ?x <景点的等级A> \"4A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凤凰中心边下有禁止吸烟楼层的酒店有哪些？",
        "output": "select ?y  where { <凤凰中心> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有无烟楼层> ?z. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海银星皇冠假日酒店都能用什么方式支付？",
        "output": "select ?x where { <上海银星皇冠假日酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在苏州的苏州博物馆什么时候营业？",
        "output": "select ?x where { <苏州博物馆> <城市> <苏州> . <苏州博物馆> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京中心大酒店附近有哪些景点？",
        "output": "select ?x where { <南京中心大酒店> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安梦幻星空抖乐园（钟楼旗舰店）附近5公里的景点都有哪些？",
        "output": "select ?y where { <西安梦幻星空抖乐园（钟楼旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "解放路的镇江国际饭店几点退房吗？",
        "output": "select ?time where { <镇江国际饭店（解放路店）> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京皇冠假日酒店在哪",
        "output": "select ?x where { <北京中关村皇冠假日酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安阳光国际酒店提供干洗衣服的服务吗",
        "output": "select ?x where { <西安阳光国际大酒店> <是否有干洗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州中国大酒店的电话号码是多少？",
        "output": "select ?x where { <广州中国大酒店> <电话> ?x. }"
    }
]