[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京千禧大酒店附近有餐厅的景点",
        "output": "select ?y  where { <北京千禧大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有餐厅> <有餐厅>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清水湾的戒浪不冲浪俱乐部内有餐厅吗？",
        "output": "select ?x where { <戒浪不冲浪俱乐部（清水湾店）> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长春开元名都大酒店内有健身房吗？",
        "output": "select ?x where { <长春开元名都大酒店> <是否有健身房> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连梵高梦境星空馆的详细地址在哪？",
        "output": "select ?x where { <大连梵高梦境星空馆> <是否免费> \"全年收费\" . <大连梵高梦境星空馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在南京香格里拉大酒店附近1公里的酒店都有哪些？",
        "output": "select ?y where { <南京香格里拉大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <南京>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张家界京武铂尔曼酒店内能加床吗？",
        "output": "select ?x where { <张家界京武铂尔曼酒店> <是否有能加床> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟县5A的景点适合游玩几天？",
        "output": "select ?x where { ?y <城市> <九寨沟县> . ?y <类型> <景点> . ?y <景点的等级A> \"5A\" . ?y <建议游玩时长> ?x .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张家界青和锦江国际酒店附近一公里还有什么酒店？",
        "output": "select ?y where { <张家界青和锦江国际酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <张家界>. ?y <类型>  <酒店>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在株洲有几家华天品牌的酒店？",
        "output": "select (count(?x) as ?count_hotel) where {  ?x <城市> <株洲> .  ?x <酒店品牌名称> <华天> . ?y <类型> <酒店> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉阿拉丁神灯星空科技馆（新世界旗舰馆）的平均价格是多少？",
        "output": "select ?x where { <武汉阿拉丁神灯星空科技馆（新世界旗舰馆）> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洛阳东山宾馆旗下的酒店有哪些？",
        "output": "select ?x where { ?x <城市> <洛阳> . ?x <酒店品牌名称> <东山宾馆> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "昨天刚到常熟，请问皇冠假日品牌下的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <常熟> . ?x <酒店品牌名称> <皇冠假日> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "温岭市有多少个价格少于1k的曙光国际品牌的酒店？",
        "output": "select (count(?x) as ?count_hotel) where { ?x <城市> <温岭市>. ?x <酒店品牌名称> <曙光国际>. ?x <平均价格> ?price. filter(?price < 1000). ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南九天温泉酒店内有轮椅租赁服务吗？",
        "output": "select ?x where { <思南九天温泉酒店> <是否有轮椅租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫能租婴儿车吗？",
        "output": "select ?x where { <故宫博物院（故宫）> <是否有婴儿车租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚龙湾红树林度假酒店的早餐价格是多少？",
        "output": "select ?x where { <亚龙湾红树林度假酒店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆有酒店吗？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "廊坊市品牌为阿尔卡迪亚的酒店都有什么呀？",
        "output": "select ?x where { ?x <城市> <廊坊> . ?x <酒店品牌名称> <阿尔卡迪亚国际酒店> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金茂北京威斯汀饭店在北京西苑饭店的哪个方向？",
        "output": "select ?x where { <金茂北京威斯汀大饭店> <位于> ?cvt.  ?cvt <实体名称> <北京西苑饭店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "想自驾游，杭州索菲特西湖大酒店能帮忙租车吗？",
        "output": "select ?x where {  <杭州索菲特西湖大酒店>\t<是否有租车服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆的优待政策是什么？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乌鲁木齐有那几家美丽华酒店呢？",
        "output": "select ?x where { ?x <城市> <乌鲁木齐> . ?x <酒店品牌名称> <美丽华酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "未成年人可以入住北京的新世纪日航饭店吗？",
        "output": "select ?x where { <北京新世纪日航饭店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魔都星空艺术馆中的独角兽的梦项目什么时候开门？",
        "output": "select ?x where { <魔都星空艺术馆> <娱乐项目名称> <独角兽的梦>. <独角兽的梦> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波凯洲皇冠假日酒店可以几点退房？",
        "output": "select ?time where { <宁波凯洲皇冠假日酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在思南县且景点的等级为4A，请问是哪个景点？",
        "output": "select ?x where { ?x <城市> <思南县> . ?x <景点的等级A> \"4A\" . ?x <类型> <景点> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "壶山温泉儿童有什么优惠吗？",
        "output": "select ?x where { <壶山温泉> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京千禧大酒店附近可以帮寄存书包的景点",
        "output": "select ?y  where { <北京千禧大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有行李寄存> <有免费行李寄存>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店梦外滩影视主题公园平均是多少钱一个人？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "容易睡过头，杭州中都青山湖畔大酒店有叫醒服务吗？",
        "output": "select ?x where { <杭州中都青山湖畔大酒店> <是否有叫醒服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大庆博物馆是免费的吗？",
        "output": "select ?x where { <大庆市博物馆> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津金皇酒店附近可以帮寄存行李箱的景点",
        "output": "select ?y  where { <天津金皇大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有行李寄存> <有免费行李寄存>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都新东方千禧大酒店有wifi吗？",
        "output": "select ?x where { <成都新东方千禧大酒店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京香格里拉大酒店附近5公里有哪些好玩的？",
        "output": "select ?t where { <南京香格里拉大酒店> <附近> ?cvt. ?cvt <实体名称> ?t. ?cvt <距离值> ?d. ?t <类型> <景点>. filter(?d <=5)}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泰州宾馆有五个人的房间吗？",
        "output": "select ?y where { <泰州宾馆> <房型名称> ?y. ?y <容纳人数> \"5.0\"^^<http://www.w3.org/2001/XMLSchema#float>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大庆市博物馆是什么等级的景点？",
        "output": "select ?x where { <大庆市博物馆> <城市> <大庆> . <大庆市博物馆> <景点的等级A> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本溪富虹国际饭店能办婚礼吗？",
        "output": "select ?x where { <本溪富虹国际饭店> <是否有婚宴服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "禅泉度假酒店是收费还是免费？",
        "output": "select ?x where { <禅泉度假酒店> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园中的宿云檐什么时候对外开放？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <宿云檐>. <宿云檐> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长春开元名都大酒店的支付方式包括哪些？",
        "output": "select ?x where { <长春开元名都大酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆君豪大饭店的价格是多少？",
        "output": "select ?y where { <重庆君豪大饭店> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳阳光酒店的地址在哪？",
        "output": "select ?x where { <深圳阳光酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不可思议星空解压馆的平均价格是多少？",
        "output": "select ?x where { <不可思议星空解压馆> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京金丝利喜来登酒店附近2公里的景点有哪些？",
        "output": "select ?y where { <南京金丝利喜来登酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <南京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福州富力威斯汀酒店内有接送服务吗？该酒店的营业时间是什么时候？",
        "output": "select ?x where { <福州富力威斯汀酒店> <是否有接送服务-营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫附近5km内最贵的酒店是多少钱？",
        "output": "select ?price  where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY desc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园的有什么优惠政策吗？",
        "output": "select ?x where { <颐和园> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赛里木湖风景名胜区的电话是多少？",
        "output": "select ?x where { <赛里木湖风景名胜区> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "首都宾馆（原首都大酒店）位于京都信苑饭店的什么方向？",
        "output": "select ?x where { <首都宾馆（原首都大酒店）> <位于> ?cvt.  ?cvt <实体名称> <京都信苑饭店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江西宾馆的早餐价格是多少？",
        "output": "select ?x where { <江西宾馆> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆的地址在哪？",
        "output": "select ?x where { <广州失恋博物馆> <城市> <广州> . <广州失恋博物馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园的网站是什么？",
        "output": "select ?x where { <景山公园> <景点官方网站> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京王府半岛酒店附近5公里的景点包括？",
        "output": "select ?y where { <王府半岛酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大庆市博物馆在哪？",
        "output": "select ?x where { <大庆市博物馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美丽华酒店的平均价格是多少？",
        "output": "select ?x where { <美丽华酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕田峪长城有什么门票优惠吗？",
        "output": "select ?x where { <慕田峪长城> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州博物馆是免费的吗？",
        "output": "select ?x where { <苏州博物馆> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在苏州有几个泛太平洋品牌的酒店？",
        "output": "select (count(?x) as ?count_city) where {  ?x <城市> <苏州> .  ?x <酒店品牌名称> <泛太平洋> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛附近的哪些酒店可以租到车？",
        "output": "select ?y where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有租车服务> <有租车服务>.?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在杭州西湖星空魔幻城附近5公里都有哪些高端霸气上档次的高于1000块钱的酒店？",
        "output": "select ?y where { <杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <酒店>. ?y <平均价格> ?price filter(?price > 1000) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国园林博物馆可以驾车入院吗？",
        "output": "select ?x where { <中国园林博物馆> <是否有驾车入院> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在苏州,且品牌为皇冠假日的酒店都有啥？",
        "output": "select ?x where { ?x <城市> <苏州> . ?x <酒店品牌名称> <皇冠假日> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州博物馆的建议游玩时长是几个小时？",
        "output": "select ?x where { <苏州博物馆> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆自然博物馆分哪些厅",
        "output": "select ?x where { <重庆自然博物馆（新馆）> <娱乐项目名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在厦门，中山路的时空魔方艺术馆附近2000m的景点包括？",
        "output": "select ?y where { <时空魔方艺术馆（中山路旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <厦门>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "时空魔方艺术馆（中山路旗舰店）怎么去方便？",
        "output": "select ?x where { <时空魔方艺术馆（中山路旗舰店）> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈阳梵高星空艺术馆（益田假日世界店）有商店吗？",
        "output": "select ?x where { <沈阳梵高星空艺术馆（益田假日世界店）> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周六想玩江汉路梵高星空美术馆中的麦田磨坊，都有什么呀？",
        "output": "select ?x where { <梵高星空美术馆（江汉路旗舰店）> <娱乐项目名称> <梵高的麦田磨坊>. <梵高的麦田磨坊> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神玉艺术馆的联系方式是多少？",
        "output": "select ?x where { <神玉艺术馆> <电话> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛附近有哪些带有游泳池的酒店呢？",
        "output": "select ?y where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有游泳池> <有室内泳池>.   ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大庆市博物馆内有wifi吗？",
        "output": "select ?x where { <大庆市博物馆> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万豪酒店附近2公里的景点有哪些？",
        "output": "select ?x where { <贵州天怡豪生大酒店> <位于> ?cvt.  ?cvt <实体名称> <贵阳喜来登贵航酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛周围哪些酒店有室内游泳池呢？",
        "output": "select ?y where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有游泳池> <有室内泳池>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在杭州西湖星空魔幻城附近5公里的酒店都有啥？",
        "output": "select ?y where { <杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辽阳富虹国际饭店内有行政酒廊吗？",
        "output": "select ?x where { <辽阳富虹国际饭店> <是否有行政酒廊> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连梵高星空馆对老人和小孩有什么优惠？",
        "output": "select ?x where { <大连梵高梦境星空馆> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王府半岛酒店附近有吃饭地方的酒店推荐一下",
        "output": "select ?y  where { <王府半岛酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有餐厅> <有餐厅>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中奥马哥孛罗大酒的支付方式包括哪些？",
        "output": "select ?x where { <北京中奥马哥孛罗大酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鹏润国际大酒店隶属哪个酒店品牌？",
        "output": "select ?x where { <鹏润国际大酒店> <酒店品牌名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开元名都大酒店的平均价格是多少",
        "output": "select ?x where { <宁波开元名都大酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在沈阳，东北大厦附近5公里的景点有哪些？",
        "output": "select ?y where { <东北大厦> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <沈阳>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "珠海度假村酒店内有吸烟区吗？",
        "output": "select ?x where { <珠海度假村酒店> <是否有吸烟区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不可思议星空解压馆的详细地址是哪儿？",
        "output": "select ?x where { <不可思议星空解压馆> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中国大饭店几点提供餐食？",
        "output": "select ?x where { <北京中国大饭店> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东莞梵高星空艺术馆距离东城的流星雨古装星空馆远不远？",
        "output": "select ?t where { <东莞梵高星空艺术馆> <附近> ?cvt. ?cvt <实体名称> <5D流星雨古装星空馆（东城店）>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宝石山是全年免费的吗？",
        "output": "select ?x where { <宝石山> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蓝海国际在东营都有什么酒店？",
        "output": "select ?x where { ?x <城市> <东营> . ?x <酒店品牌名称> <蓝海国际> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问故宫到东方君悦大酒店得步行多远？",
        "output": "select ?t where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> <北京东方君悦大酒店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "紫金山探险公园什么时间营业？",
        "output": "select ?x where { <紫金山探险公园> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曲靖官房大酒店要多少钱？",
        "output": "select ?x where { <曲靖官房大酒店> <平均价格> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于武汉的阿拉丁神灯星空科技馆（新世界旗舰馆）的平均价格是多少？",
        "output": "select ?x where { <武汉阿拉丁神灯星空科技馆（新世界旗舰馆）> <城市> <武汉> . <武汉阿拉丁神灯星空科技馆（新世界旗舰馆）> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们适合在外滩玩几个小时？",
        "output": "select ?x where { <外滩> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园的联系电话是多少？",
        "output": "select ?x where { <景山公园> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辽宁省博物馆的官网是什么？",
        "output": "select ?x where { <辽宁省博物馆> <景点官方网站> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的北大博雅国际酒店附近2公里的景点有哪些？",
        "output": "select ?y where { <北大博雅国际酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园附近5公里有哪些可以停车的酒店",
        "output": "select ?x where { <北海公园> <附近> ?cvt. ?cvt <距离值> ?distance. filter(?distance <= 5.0) ?cvt <实体名称> ?x. ?x <类型> <酒店>. ?x <是否有停车场> <有停车场>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凤凰中心内有储物柜租赁服务吗？",
        "output": "select ?x where { <凤凰中心> <是否有储物柜租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海魔都星空艺术馆附近5公里的景点都有什么？",
        "output": "select ?y where { <魔都星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <上海>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆是免费的不？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京的永银钱币博物馆什么时候营业啊？",
        "output": "select ?x where { <永银钱币博物馆> <城市> <南京> . <永银钱币博物馆> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东莞梵高星空艺术馆有啥优惠吗？",
        "output": "select ?x where { <东莞梵高星空艺术馆> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辽宁省博物馆在哪所城市？",
        "output": "select ?x where { <辽宁省博物馆> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不可思议星空解压馆内有停车场吗？",
        "output": "select ?x where { <不可思议星空解压馆> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩附近哪些酒店有禁烟楼层",
        "output": "select ?y  where { <外滩> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有无烟楼层> ?z. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京独角兽星空艺术馆旗舰店距离永银钱币博物馆有多远？",
        "output": "select ?t where { <南京独角兽星空艺术馆旗舰店> <附近> ?cvt. ?cvt <实体名称> <永银钱币博物馆>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院内有储物柜租赁服务吗？",
        "output": "select ?x where { <故宫博物院（故宫）> <是否有储物柜租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院内有停车场吗？",
        "output": "select ?x where { <南京博物院> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的浙江世贸君澜大饭店附近2km有啥在十五块钱以内的景点可以玩吗？",
        "output": "select ?y where { <浙江世贸君澜大饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <杭州>. ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 15) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚龙湾红树林度假酒店的电话是什么？",
        "output": "select ?x where { <亚龙湾红树林度假酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安皇冠假日酒店属于哪个品牌旗下的酒店？",
        "output": "select ?x where { <西安皇冠假日酒店> <酒店品牌名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的浙江世贸君澜大饭店附近5公里的景点包括哪些？",
        "output": "select ?y where { <浙江世贸君澜大饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在广州的那个失恋博物馆收费吗？",
        "output": "select ?x where { <广州失恋博物馆> <城市> <广州> . <广州失恋博物馆> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园周围有能打高尔夫的酒店吗？",
        "output": "select ?y where { <北海公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <类型> <酒店>. ?y <是否有高尔夫球场> <有高尔夫球场，可能收费>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院什么季节最适合游玩？",
        "output": "select ?x where { <南京博物院> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下周想去游玩景点等级为4A的沈阳科学宫，请问科学宫的官方网站是多少啊？",
        "output": "select ?x where { <沈阳科学宫> <景点的等级A> \"4A\" . <沈阳科学宫> <景点官方网站> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住长沙运达喜来登酒店，有年龄限制吗？",
        "output": "select ?x where { <长沙运达喜来登酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州宝石山2公里内还有哪些景点可以玩？",
        "output": "select ?y where { <宝石山> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不可思议星空解压馆所在城市是？",
        "output": "select ?x where { <不可思议星空解压馆> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曲院风荷电瓶船码头有停车场吗？",
        "output": "select ?x where { <曲院风荷电瓶船码头> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳富苑皇冠假日套房酒店附近1公里的酒店还有哪些？",
        "output": "select ?y where { <深圳富苑皇冠假日套房酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <深圳>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园和北海公园附近有哪些酒店",
        "output": "select ?x where { ?x <附近> ?cvt1. ?cvt1 <实体名称> <景山公园>. ?x <附近> ?cvt2. ?cvt2 <实体名称> <北海公园>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京新街口爱情博物展附近哪个酒店能洗衣服呢？",
        "output": "select ?y where { <南京爱情博物展（新街口总店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有洗衣服务> <有洗衣服务>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海外滩附近2公里的景点有哪些？",
        "output": "select ?y where { <外滩> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <上海>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安钟楼梦幻星空抖乐园旗舰店有停车场吗？",
        "output": "select ?x where { <西安梦幻星空抖乐园（钟楼旗舰店）> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江阴黄嘉喜来登酒店的具体地址？",
        "output": "select ?x where { <江阴黄嘉喜来登酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "珠海来魅力假日酒店的酒店最早入住开始时间？",
        "output": "select ?x where { <珠海来魅力假日酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽景湾国际酒店内有桑拿浴室吗？",
        "output": "select ?x where { <北京丽景湾国际酒店> <是否有桑拿浴室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波天一广场梵高星空艺术馆怎么走？",
        "output": "select ?x where { <宁波梵高星空艺术馆（天一广场旗舰店）> <城市> <宁波> . <宁波梵高星空艺术馆（天一广场旗舰店）> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫钟表馆内有餐厅吗？",
        "output": "select ?x where { <故宫钟表馆> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐山属于维景国际的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <唐山> . ?x <酒店品牌名称> <维景国际> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安梦幻星空抖乐园（钟楼旗舰店）中情人床垫项目是什么呀？",
        "output": "select ?x where { <西安梦幻星空抖乐园（钟楼旗舰店）> <娱乐项目名称> <情人床垫>. <情人床垫> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在沈阳科学宫，基础科学展厅的项目营业时间是什么时候？",
        "output": "select ?x where { <沈阳科学宫> <娱乐项目名称> <基础科学展厅>. <基础科学展厅> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京的独角兽星空馆旗舰店能便宜点吗？",
        "output": "select ?x where { <南京独角兽星空艺术馆旗舰店> <城市> <南京> . <南京独角兽星空艺术馆旗舰店> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国宾酒店附近哪些景点有餐厅呢？",
        "output": "select ?y  where { <北京国宾酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有餐厅> <有餐厅>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "峨眉山世纪阳光大酒店的早餐类型包括哪些？",
        "output": "select ?x where { <峨眉山世纪阳光大酒店> <早餐类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园附近5公里的酒店和景点都有哪些",
        "output": "select ?x where { <景山公园> <附近> ?cvt. ?cvt <距离值> \"5\"^^<http://www.w3.org/2001/XMLSchema#float>. ?cvt <实体名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南九天温泉酒店的人均价格是多少？",
        "output": "select ?x where { <思南九天温泉酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的国家大剧院有什么优待政策？",
        "output": "select ?x where { <国家大剧院> <城市> <北京> . <国家大剧院> <优待政策> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川岷山饭店最晚几点退房？",
        "output": "select ?x where { <四川岷山饭店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在北京，神玉艺术馆附近5公里的景点都有什么？",
        "output": "select ?y where { <神玉艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "据说故宫博物院中的景仁宫很好玩，请问这个项目对身高或者年龄有什么限制吗？",
        "output": "select ?x where { <故宫博物院（故宫）> <娱乐项目名称> <景仁宫>. <景仁宫> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉新世界酒店附近5公里的酒店有哪些？",
        "output": "select ?y where { <武汉新世界酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <武汉>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在沈阳的辽宁省博物馆是免费的吗？",
        "output": "select ?x where { <辽宁省博物馆> <城市> <沈阳> . <辽宁省博物馆> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皇冠假日品牌的酒店在天津有几个？",
        "output": "select (count(?x) as ?count_hotel) where { ?x <酒店品牌名称> <皇冠假日>. ?x <城市> <天津> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京千禧大酒店附近五公里且低于100的景点能推荐一下吗？",
        "output": "select ?y where { <北京千禧大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 100) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉华美达光谷大酒店什么时候可以入住？",
        "output": "select ?time where { <武汉华美达光谷大酒店> <酒店入住开始时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五缘湾万嘀帆船出海俱乐部内有餐厅吗？",
        "output": "select ?x where { <五缘湾万嘀帆船出海俱乐部> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在南京的紫金山探险公园什么时候营业？",
        "output": "select ?x where { <紫金山探险公园> <城市> <南京> . <紫金山探险公园> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩距离上海兴国宾馆丽笙多远？",
        "output": "select ?t where { <外滩> <附近> ?cvt. ?cvt <实体名称> <上海兴国宾馆丽笙精选>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舟山喜来登绿城酒店内有沙滩吗？",
        "output": "select ?x where { <舟山喜来登绿城酒店> <是否有沙滩> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海皇廷世际酒店内有游戏室吗？",
        "output": "select ?x where { <上海皇廷世际酒店> <是否有游戏室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京嘉里大酒店附近的哪个景点可以免费提供婴儿车使用呢？",
        "output": "select ?y  where { <北京嘉里大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有婴儿车租赁> <有免费婴儿车租赁>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在思南县的九天温泉酒店的交通信息是什么呀？方便分享一下交通路线吗？",
        "output": "select ?x where { <思南九天温泉酒店> <城市> <思南县> . <思南九天温泉酒店> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华侨大厦附近哪些酒店可以停车",
        "output": "select ?x where { <北京华侨大厦> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <是否有停车场> <有停车场>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫怎么走？",
        "output": "select ?x where { <布达拉宫> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纳木错国家风景区中的药王石的项目描述？",
        "output": "select ?x where { <纳木错国家风景区> <娱乐项目名称> <药王石>. <药王石> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我想了解一下等级为5A的慕田峪长城的淡季旺季情况，可以简单介绍一下吗？",
        "output": "select ?x where { <慕田峪长城> <景点的等级A> \"5A\" . <慕田峪长城> <淡季旺季> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园门票价格？",
        "output": "select ?y where {  <北海公园> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景点等级为4A的北海公园坐落在哪所城市？",
        "output": "select ?x where { <北海公园> <景点的等级A> \"4A\" . <北海公园> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国丝绸博物馆内有停车场？",
        "output": "select ?x where { <中国丝绸博物馆> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽晶酒店附近5公里的酒店包括哪些？",
        "output": "select ?y where { <北京丽晶酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <酒店>.}"
    }
]