[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在镇江国际饭店解放路店附近5公里低于600块钱都有什么酒店可以入住？",
        "output": "select ?y where { <镇江国际饭店（解放路店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <镇江>. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?price < 600) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有几个5A景点？",
        "output": "select (count(?x) as ?count_city) where { ?x <城市> <北京>. ?x <类型> <景点>. ?x <景点的等级A> \"5A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在宁波, 且距离开元名都大酒店附近5公里的饭店有哪些？",
        "output": "select ?y where { <宁波开元名都大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <宁波>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国殇墓园有停车的地方吗？",
        "output": "select ?x where { <国殇墓园> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫什么时候玩最合适？",
        "output": "select ?x where { <布达拉宫> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园适合游玩多久？",
        "output": "select ?x where { <颐和园> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京长城饭店离北京希尔顿酒店多远？",
        "output": "select ?x where { <北京长城饭店（原北京喜来登长城饭店）> <附近> ?cvt. ?cvt <实体名称> <北京希尔顿酒店>. ?cvt <距离值> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门星空艺术馆有wifi服务吗？",
        "output": "select ?x where { <厦门星空艺术馆> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆·巅峰乐园中的ZTR蝙蝠车几点可以玩？",
        "output": "select ?x where { <重庆·巅峰乐园> <娱乐项目名称> <ZTR蝙蝠车>. <ZTR蝙蝠车> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京独角兽星空艺术馆旗舰店要多少钱？",
        "output": "select ?y where { <南京独角兽星空艺术馆旗舰店> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京千禧大酒店附近收费停车场的景点",
        "output": "select ?y  where { <北京千禧大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有停车场> <有收费停车场>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园附近哪个酒店可以办婚宴？",
        "output": "select ?y where { <颐和园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有婚宴服务> <提供婚宴服务,可能收费>.  ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从国家大剧院到北京丽景湾国际酒店，需要往哪个方向走？",
        "output": "select ?x where { <北京丽景湾国际酒店> <位于> ?cvt.  ?cvt <实体名称> <国家大剧院>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纳木错国家风景区收费吗？",
        "output": "select ?x where { <纳木错国家风景区> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "600块钱可以入住柳州丽笙酒店吗？",
        "output": "select ?x where { <柳州丽笙酒店> <平均价格> ?x.  FILTER (?x < 600)}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皇朝万豪酒店边上有可以玩的地方吗",
        "output": "select ?x where { <沈阳皇朝万豪酒店> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安的梦幻星空抖乐园（钟楼旗舰店）的平均消费是多少？",
        "output": "select ?x where { <西安梦幻星空抖乐园（钟楼旗舰店）> <城市> <西安> . <西安梦幻星空抖乐园（钟楼旗舰店）> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绍兴饭店定哪个房型可以加床啊？",
        "output": "select ?y where { <绍兴饭店> <房型名称> ?y. ?y <是否可以加床> \"可以加床\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欧亚国际酒店能加床吗？",
        "output": "select ?x where { <欧亚国际酒店> <是否有能加床> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "壶山温泉里有哪些项目没限制？",
        "output": "select ?y where { <壶山温泉> <娱乐项目名称> ?y. ?y <项目限制（一般指身高年龄限制）> \"无限制\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从江汉路那家的梵高星空美术馆出发，往哪个方向走可以到达武汉新世界酒店？",
        "output": "select ?x where {  <武汉新世界酒店> <位于> ?cvt.  ?cvt <实体名称> <梵高星空美术馆（江汉路旗舰店）>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫适合玩几个小时？",
        "output": "select ?x where { <布达拉宫> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何去故宫博物院？有什么建议路线吗？",
        "output": "select ?x where {  <故宫博物院（故宫）> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京饭店附近有免费储物柜出租的景点",
        "output": "select ?y  where { <北京饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有储物柜租赁> <有免费储物柜租赁>.  ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "距离青岛香格里拉大酒店附近2公里的景点有哪些呀？",
        "output": "select ?y where { <青岛香格里拉大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <青岛>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄山香茗酒店有没有传真？",
        "output": "select ?x where { <黄山香茗酒店> <是否有传真> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州国大雷迪森广场酒店的平均价格是多少？",
        "output": "select ?x where { <杭州国大雷迪森广场酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海宁市中品牌名称为锦江酒店有哪些？",
        "output": "select ?x where { ?x <城市> <海宁市> . ?x <酒店品牌名称> <锦江酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在綦江县的重庆·巅峰乐园什么时间营业？",
        "output": "select ?x where { <重庆·巅峰乐园> <城市> <綦江县> . <重庆·巅峰乐园> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柳巷的猫咪博物馆有商店吗？",
        "output": "select ?x where { <猫咪博物馆（柳巷旗舰店）> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大唐不夜城都有哪些项目？",
        "output": "select ?y where { <大唐不夜城> <娱乐项目名称> ?y. ?y <类型> <项目> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海外滩有哪些游览景点",
        "output": "select ?x where { <外滩> <娱乐项目名称> ?x . <外滩> <城市> <上海>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中关村皇冠假日酒店附近5公里的景点有哪些？",
        "output": "select ?y where { <北京中关村皇冠假日酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海宁皮都锦江大酒店内有擦鞋服务吗？",
        "output": "select ?x where { <海宁皮都锦江大酒店> <是否有擦鞋服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在南京，永银钱币博物馆附近5公里的景点有什么？",
        "output": "select ?y where { <永银钱币博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <南京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅州客天下国际大酒店的退房时间？",
        "output": "select ?time where { <梅州客天下国际大酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何到达北海公园？有推荐的交通路线吗？",
        "output": "select ?x where { <北海公园> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "廉润初心文化传播推广中心内有无线网？",
        "output": "select ?x where { <廉润初心文化传播推广中心> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波万豪酒店附近5公里的景点包括？",
        "output": "select ?y where { <宁波万豪酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <宁波>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南护城河是什么等级的景点？",
        "output": "select ?x where { <济南护城河> <景点的等级A> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何到达沈阳科学宫？有推荐的路线吗？",
        "output": "select ?x where { <沈阳科学宫> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南护城河有母婴室吗？",
        "output": "select ?x where { <济南护城河> <是否有母婴室> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "时空魔方艺术馆什么时候去比较好？",
        "output": "select ?x where { <时空魔方艺术馆（中山路旗舰店）> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "以国家大剧院为中心，颐和园位于什么方位？",
        "output": "select ?x where {  <颐和园> <位于> ?cvt.  ?cvt <实体名称> <国家大剧院>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宝利来国际大酒店能来飞机场接我吗？",
        "output": "select ?x where { <宝利来国际大酒店>\t<是否有接机服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "溪口银凤度假村的电话是多少？",
        "output": "select ?x where { <溪口银凤度假村> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绍兴国际大酒店有wifi吗？",
        "output": "select ?x where { <绍兴国际大酒店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门五缘湾万嘀帆船出海俱乐部最佳游玩时间是什么时候？",
        "output": "select ?x where { <五缘湾万嘀帆船出海俱乐部> <城市> <厦门> . <五缘湾万嘀帆船出海俱乐部> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州太美啦，请问从西湖星空魔幻城（星空艺术馆品牌旗舰店）出发，5公里以内都有什么酒店？",
        "output": "select ?y where { <杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以描述一下天坛公园中的无梁殿吗？",
        "output": "select ?x where { <天坛公园> <娱乐项目名称> <无梁殿>. <无梁殿> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园是几A级风景区？",
        "output": "select ?x where { <颐和园> <景点的等级A> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "敦煌有那几家阳光酒店？",
        "output": "select ?x where { ?x <城市> <敦煌市> . ?x <类型> <酒店> . ?x <酒店品牌名称> <阳光酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东营东胜大厦几点可以吃饭？",
        "output": "select ?x where { <东营东胜大厦> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问三亚红色娘子军演艺公园中的红色火焰70岁老人有限制吗？",
        "output": "select ?x where { <三亚红色娘子军演艺公园> <娱乐项目名称> <红色火焰>. <红色火焰> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江汉路的梵高星空美术馆附近哪些酒店有免费的室外游泳池？",
        "output": "select ?y where { <梵高星空美术馆（江汉路旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有游泳池> <室外泳池免费>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州白云机场铂尔曼大酒店的年龄限制？",
        "output": "select ?x where { <广州白云机场铂尔曼大酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "温州万和豪生大酒店的详细地址？",
        "output": "select ?x where { <温州万和豪生大酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州安哥拉巨兔体验馆有吃饭的地方吗？",
        "output": "select ?x where { <杭州安哥拉巨兔体验馆> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在天津，独角兽星空艺术馆附近2公里的景点都有啥？",
        "output": "select ?y where { <天津独角兽星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <天津>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连梵高梦境星空馆的营业时间是什么时候？",
        "output": "select ?x where { <大连梵高梦境星空馆> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园到北京友谊宾馆有多远？",
        "output": "select ?t where { <颐和园> <附近> ?cvt. ?cvt <实体名称> <北京友谊宾馆（贵宾楼）>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院的东北方向有哪些酒店",
        "output": "select ?x where { ?cvt <实体名称> <国家大剧院>. ?cvt <方向> <东北方向>. ?x <位于> ?cvt. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "5A级别的景点在济南有多少个？",
        "output": "select (count(?x) as ?count_city) where {      ?x <城市> <济南>.     ?x <景点的等级A> \"5A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无锡太湖饭店内有班车可以坐吗？",
        "output": "select ?x where { <无锡太湖饭店> <是否有班车服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德钦县有哪些4A景点？",
        "output": "select ?x where { ?x <城市> <德钦县> . ?x <景点的等级A> \"4A\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海洲大饭店的就餐时间是几点？",
        "output": "select ?x where { <海洲大饭店> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景点等级为5A的喀纳斯景区有什么门票优惠政策？",
        "output": "select ?x where { <喀纳斯景区> <景点的等级A> \"5A\" . <喀纳斯景区> <优待政策> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫儿童有什么优惠吗？",
        "output": "select ?x where { <故宫博物院（故宫）> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆君豪大饭店附近5公里的景点收费吗？",
        "output": "select ?x where { <重庆君豪大饭店> <附近> ?cvt . ?cvt <实体名称> ?y . ?y <城市> <重庆> . ?cvt <距离值> ?distance . filter(?distance <= 5.0) ?y <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海银星皇冠假日附近还有什么酒店可以打保龄球？",
        "output": "select ?y where { <上海银星皇冠假日酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有保龄球馆> <有保龄球馆>. ?y <类型> <酒店>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家地理探险家中心的官方门票价格是多少钱？",
        "output": "select ?x where { <国家地理探险家中心> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州西湖可以玩多久？",
        "output": "select ?x where { <西湖风景名胜区（西湖）> <城市> <杭州> . <西湖风景名胜区（西湖）> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州博物馆什么时候对外营业？",
        "output": "select ?x where { <苏州博物馆> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "羊卓雍措建议玩多久？",
        "output": "select ?x where { <羊卓雍措> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海安哥拉巨兔体验馆有wifi吗？",
        "output": "select ?x where { <上海安哥拉巨兔体验馆> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京恋爱博物馆在南京博物院的哪个方向？",
        "output": "select ?x where { <南京恋爱博物馆> <位于> ?cvt.  ?cvt <实体名称> <南京博物院>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宜春明月山维景温泉度假酒店有游泳池吗？",
        "output": "select ?x where { <宜春明月山维景国际温泉度假酒店> <是否有游泳池> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神玉艺术馆官方门票价格是多少？",
        "output": "select ?x where { <神玉艺术馆> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波梵高星空艺术馆（天一广场旗舰店）在哪所城市？",
        "output": "select ?x where { <宁波梵高星空艺术馆（天一广场旗舰店）> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "查一下焦作的戴斯大酒店有哪些",
        "output": "select ?x where { ?x <城市> <焦作> . ?x <酒店品牌名称> <戴斯大酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "合肥的元一希尔顿酒店哪些个房型有全天热水呢？",
        "output": "select ?y where { <合肥元一希尔顿酒店> <房型名称> ?y. ?y <热水供应时间> \"24小时热水\". ?y <类型> <房型> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉萨的布达拉宫平均价格是多少？",
        "output": "select ?x where { <布达拉宫> <城市> <拉萨> . <布达拉宫> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在清华大学艺术博物馆附近5公里价格低于1000元且城市在北京的酒店有哪些？",
        "output": "select ?y where { <清华大学艺术博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?price < 1000)}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凤凰中心附近没有抽烟区的酒店",
        "output": "select ?y  where { <凤凰中心> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有吸烟区> <无吸烟区>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安梦幻星空抖乐园钟楼旗舰店在大唐不夜城的什么方向？",
        "output": "select ?x where { <西安梦幻星空抖乐园（钟楼旗舰店）> <位于> ?cvt.  ?cvt <实体名称> <大唐不夜城>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈阳皇朝万豪酒店附近5公里有哪些好玩的？",
        "output": "select ?y where { <沈阳皇朝万豪酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5.0) ?y <城市> <沈阳>. ?y <类型> <景点>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么时候去纳木错风景区玩最合适？",
        "output": "select ?x where { <纳木错国家风景区> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫附近5km内最便宜的酒店是哪一家？",
        "output": "select ?y  where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY asc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海的外滩进去多少钱？",
        "output": "select ?x where { <外滩> <城市> <上海> . <外滩> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园的最佳游玩时间是什么时候？",
        "output": "select ?x where { <天坛公园> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在无锡,且酒店品牌为金陵连锁的酒店有哪些？",
        "output": "select ?x where { ?x <城市> <无锡> . ?x <酒店品牌名称> <金陵连锁> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "山西丽华大酒店内能寄存行李吗？",
        "output": "select ?x where { <山西丽华大酒店> <是否有行李寄存> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州白云机场铂尔曼大酒店内有游戏室吗？",
        "output": "select ?x where { <广州白云机场铂尔曼大酒店> <是否有游戏室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什噶尔老城收门票不？",
        "output": "select ?x where { <喀什噶尔老城> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在苏州的苏州博物馆建议游玩多少几个小时？",
        "output": "select ?x where { <苏州博物馆> <城市> <苏州> . <苏州博物馆> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州博物馆的吴塔国宝什么时候能进？",
        "output": "select ?x where { <苏州博物馆>\t<娱乐项目名称>\t<吴塔国宝>.  <吴塔国宝> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州索菲特西湖大酒店附近5公里的景点都有哪些？",
        "output": "select ?y where { <杭州索菲特西湖大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什噶尔老城平均价格？",
        "output": "select ?x where { <喀什噶尔老城> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都明宇尚雅饭店的早餐多少钱？",
        "output": "select ?x where { <成都明宇尚雅饭店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什噶尔老城的电话是多少？",
        "output": "select ?x where { <喀什噶尔老城> <电话> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安哥拉巨兔体验馆内可以携带自拍杆吗？",
        "output": "select ?x where { <爱玩萌兔安哥拉巨兔体验馆（黄兴路旗舰店）> <是否有携带自拍杆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅里雪山国家公园规划玩几天合适？",
        "output": "select ?x where { <梅里雪山国家公园> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全年免费的湖南省博物馆的营业时间是什么时候？",
        "output": "select ?x where { <湖南省博物馆> <是否免费> \"全年免费\" . <湖南省博物馆> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "描述一下天津梵高星空馆中的月亮船？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <娱乐项目名称> <月亮船>. <月亮船> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天河城那边的天津梵高星空艺术馆附近有哪些酒店提供充电车位呢？",
        "output": "select ?y where { <天津梵高星空艺术馆（天河城旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有充电车位> <有充电车位>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "圆明新园内可以携带自拍杆吗？",
        "output": "select ?x where { <圆明新园（夏苑）> <是否有携带自拍杆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的神玉艺术馆有哪些优惠信息？",
        "output": "select ?x where { <神玉艺术馆> <城市> <北京> . <神玉艺术馆> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫附近5km内最贵的酒店是哪一家？",
        "output": "select ?y  where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY desc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泉州有多少金陵连锁品牌的酒店？",
        "output": "select (count(?x) as ?count_city) where {  ?x <城市> <泉州> .  ?x <酒店品牌名称> <金陵连锁> . ?x <类型> <酒店> .}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州富力丽思卡尔顿的房间都分什么类别呢？",
        "output": "select distinct ?z where { <广州富力丽思卡尔顿酒店> <房型名称> ?y. ?y <房型类别> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在香港美利酒店最晚可以几点办理退房？",
        "output": "select ?time where { <香港美利酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赛里木湖风景名胜区的官方价格是多少？",
        "output": "select ?x where { <赛里木湖风景名胜区> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院的详细地址？",
        "output": "select ?x where { <故宫博物院（故宫）> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州西湖到宝石山要几公里？",
        "output": "select ?t where { <西湖风景名胜区（西湖）> <附近> ?cvt. ?cvt <实体名称> <宝石山>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住杭州开元名都大酒店多少钱？",
        "output": "select ?x where { <杭州开元名都大酒店> <平均价格> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州吴宫太平洋酒店有面积在15-35左右的房间吗？",
        "output": "select ?y where { <苏州吴宫泛太平洋酒店> <房型名称> ?y. ?y <房屋面积> \"15-35\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家地理探险家中心内有停车场吗？",
        "output": "select ?x where { <国家地理探险家中心> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院中的乾东五所景点什么时候对外开放呀？",
        "output": "select ?x where { <故宫博物院（故宫）> <娱乐项目名称> <乾东五所>. <乾东五所> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园门票需要多少钱？",
        "output": "select ?x where {<北海公园> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全年收费的萤火虫星空艺术馆（钟楼旗舰店）有什么优惠政策？",
        "output": "select ?x where { <萤火虫星空艺术馆（钟楼旗舰店）> <是否免费> \"全年收费\" . <萤火虫星空艺术馆（钟楼旗舰店）> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如意湖景区的所在城市是哪？",
        "output": "select ?x where { <如意湖景区> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从不可思议星空解压馆出发，往哪个方向走可以到达武汉新世界酒店？",
        "output": "select ?x where {  <武汉新世界酒店> <位于> ?cvt.  ?cvt <实体名称> <不可思议星空解压馆>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三明天元酒店有免费的wifi吗",
        "output": "select ?x where { <三明宾馆·天元国际> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈阳皇朝万豪酒店的支付方式包括哪些？",
        "output": "select ?x where { <沈阳皇朝万豪酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚到北京入住到金茂威斯汀大饭店，请问附近5公里的景点都有啥？",
        "output": "select ?y where { <金茂北京威斯汀大饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院内有储物柜租赁服务吗？",
        "output": "select ?x where { <国家大剧院> <是否有储物柜租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅溪湖国际文化艺术中心艺术馆《流动的永恒》展有啥优惠信息？",
        "output": "select ?x where { <梅溪湖国际文化艺术中心艺术馆《流动的永恒》展> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京绿地洲际酒店附近有哪些景点可以储物柜呢",
        "output": "select ?y  where { <南京绿地洲际酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有储物柜租赁> <有免费储物柜租赁>.  ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉锦江国际大酒店中行政高级豪华大床房中有屏幕显示器吗？",
        "output": "select ?x where { <武汉锦江国际大酒店> <房型名称> <行政高级豪华大床房>. <行政高级豪华大床房> <显示器配置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海东郊宾馆可以通过什么支付？",
        "output": "select ?x where { <上海东郊宾馆> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京励骏酒店多少钱一晚？",
        "output": "select ?x where { <北京励骏酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在浪卡子县的羊卓雍措是免费的吗？",
        "output": "select ?x where { <羊卓雍措> <城市> <浪卡子县> . <羊卓雍措> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛附近5km内最贵的酒店是哪一家？",
        "output": "select ?y  where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY desc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在宁波，梵高星空艺术馆位于万豪酒店的方向？",
        "output": "select ?x where { <宁波梵高星空艺术馆（天一广场旗舰店）> <位于> ?cvt.  ?cvt <实体名称> <宁波万豪酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛附近3公里内最便宜的酒店是多少钱？",
        "output": "select ?price  where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 3). } ORDER BY asc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的孤山公园附近有什么公交？",
        "output": "select ?x where { <孤山公园> <城市> <杭州> . <孤山公园> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什的噶尔老城什么时候去玩最合适？",
        "output": "select ?x where { <喀什噶尔老城> <城市> <喀什市> . <喀什噶尔老城> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乌鲁木齐天缘酒店所有楼层都允许抽烟吗？",
        "output": "select ?x where { <乌鲁木齐天缘酒店（地窝堡机场店）> <是否有无烟楼层> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "温州滨海大酒店几点之前必须退？",
        "output": "select ?x where { <温州滨海大酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津天河城梵高星空艺术馆的营业时间？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <城市> <天津> . <天津梵高星空艺术馆（天河城旗舰店）> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东莞梵高星空艺术馆最佳游玩时间是什么季节？",
        "output": "select ?x where { <东莞梵高星空艺术馆> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区里面的芳草海项目什么时候营业？",
        "output": "select ?x where { <九寨沟风景区> <娱乐项目名称> <芳草海>. <芳草海> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "之前的绿城雷迪森酒店那个房间有24小时热水呢？",
        "output": "select ?y where { <新昌尊蓝山居（原绿城雷迪森大酒店）> <房型名称> ?y. ?y <热水供应时间> \"24小时热水\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万豪酒店附近两公里的景点有哪些？",
        "output": "select ?y where { <宁波万豪酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <宁波>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "合肥泓瑞金陵大酒店的退房时间是几点？",
        "output": "select ?time where { <合肥泓瑞金陵大酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆周围哪个酒店可以免费在室外游泳池游泳？",
        "output": "select ?y where { <广州失恋博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有游泳池> <室外泳池免费>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凤凰中心在哪个城市？",
        "output": "select ?x where { <凤凰中心> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京伯豪瑞廷酒店附近5公里的景点包括？",
        "output": "select ?y where { <北京伯豪瑞廷酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在城市郫县,且隶属于温德姆至尊豪廷都有哪些酒店？",
        "output": "select ?x where { ?x <城市> <郫县> . ?x <酒店品牌名称> <温德姆至尊豪廷> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从景山公园出发，要去故宫得往哪个方向走啊？",
        "output": "select ?x where { <故宫博物院（故宫）> <位于> ?cvt.  ?cvt <实体名称> <景山公园>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区在要多少钱呢？",
        "output": "select ?x where { <九寨沟风景区> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园在北京瑞吉酒店的哪个方向？",
        "output": "select ?x where { <北京瑞吉酒店> <位于> ?cvt.  ?cvt <实体名称> <天坛公园>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "山西丽华大酒店支持哪些支付方式？",
        "output": "select ?x where { <山西丽华大酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津梵高星空艺术馆（天河城旗舰店）有停车场吗？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南护城河里边有餐厅可以吃饭吗？",
        "output": "select ?x where { <济南护城河> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "住在天津滨海喜来登酒店大概花多少？",
        "output": "select ?y where {  <天津滨海喜来登酒店> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鞍山五环大酒店17岁可以入住吗？",
        "output": "select ?x where { <鞍山五环大酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店梦外滩影视主题公园的营业时间？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辽宁省博物馆是否免费？",
        "output": "select ?x where { <辽宁省博物馆> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆维景国际大酒店内有乒乓球室吗？",
        "output": "select ?x where { <重庆维景国际大酒店> <是否有乒乓球室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽晶酒店早餐要多少钱",
        "output": "select ?x where { <北京丽晶酒店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南昌力高皇冠假日酒店的早餐价格是多少钱？",
        "output": "select ?x where { <南昌力高皇冠假日酒店> <早餐价格> ?x. }"
    }
]