[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺栓塞涉及什么症状？",
        "output": "select ?x where { <肺栓塞> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎儿窘迫属于什么?",
        "output": "select ?x where { <胎儿窘迫> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎儿窘迫属于什么科？",
        "output": "select ?x where { <胎儿窘迫> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎儿窘迫涉及什么检查？",
        "output": "select ?x where { <胎儿窘迫> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎儿窘迫涉及什么症状？",
        "output": "select ?x where { <胎儿窘迫> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "网球肘属于什么?",
        "output": "select ?x where { <网球肘> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四环素牙属于什么?",
        "output": "select ?x where { <四环素牙> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布鲁氏菌病属于什么?",
        "output": "select ?x where { <布鲁氏菌病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布鲁氏菌病要在哪个科室就诊？",
        "output": "select ?x where { <布鲁氏菌病> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布鲁氏菌病的同义词是什么？",
        "output": "select ?x where { <布鲁氏菌病> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布鲁氏菌病涉及什么检查？",
        "output": "select ?x where { <布鲁氏菌病> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胆总管囊肿属于什么?",
        "output": "select ?x where { <胆总管囊肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿路感染属于什么?",
        "output": "select ?x where { <尿路感染> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿路感染要去哪个科室就诊？",
        "output": "select ?x where { <尿路感染> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿路感染的同义词是什么？",
        "output": "select ?x where { <尿路感染> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿路感染涉及哪些症状？",
        "output": "select ?x where { <尿路感染> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿毒症属于什么?",
        "output": "select ?x where { <尿毒症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "破伤风属于什么?",
        "output": "select ?x where { <破伤风> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌萎缩侧索硬化属于什么?",
        "output": "select ?x where { <肌萎缩侧索硬化> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌萎缩侧索硬化涉及什么检查？",
        "output": "select ?x where { <肌萎缩侧索硬化> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病属于什么?",
        "output": "select ?x where { <结核病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病常见的病因是什么？",
        "output": "select ?x where { <结核病> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑动脉硬化症属于什么?",
        "output": "select ?x where { <脑动脉硬化症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痈属于什么?",
        "output": "select ?x where { <痈> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "麻风病属于什么?",
        "output": "select ?x where { <麻风病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑积水属于什么?",
        "output": "select ?x where { <脑积水> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腰肌劳损属于什么?",
        "output": "select ?x where { <腰肌劳损> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胆结石属于什么?",
        "output": "select ?x where { <胆结石> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢粒属于什么?",
        "output": "select ?x where { <慢粒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "接触性皮炎属于什么?",
        "output": "select ?x where { <接触性皮炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "接触性皮炎患者应该去哪个科室就诊？",
        "output": "select ?x where { <接触性皮炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "接触性皮炎涉及哪些症状？",
        "output": "select ?x where { <接触性皮炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "猩红热属于什么?",
        "output": "select ?x where { <猩红热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "猩红热患者应该去哪个科室就诊？",
        "output": "select ?x where { <猩红热> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "猩红热的同义词是什么？",
        "output": "select ?x where { <猩红热> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "猩红热涉及哪些症状？",
        "output": "select ?x where { <猩红热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阴囊湿疹属于什么?",
        "output": "select ?x where { <阴囊湿疹> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结肠息肉属于什么?",
        "output": "select ?x where { <结肠息肉> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝炎属于什么?",
        "output": "select ?x where { <肝炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "引起肝炎的肇因是什么？",
        "output": "select ?x where { <肝炎> <肇因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝炎涉及什么检查？",
        "output": "select ?x where { <肝炎> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳聋属于什么?",
        "output": "select ?x where { <耳聋> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "附件炎属于什么?",
        "output": "select ?x where { <附件炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血脂异常属于什么?",
        "output": "select ?x where { <血脂异常> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痔疮属于什么?",
        "output": "select ?x where { <痔疮> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冻疮属于什么?",
        "output": "select ?x where { <冻疮> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中风属于什么?",
        "output": "select ?x where { <中风> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "性心理障碍属于什么?",
        "output": "select ?x where { <性心理障碍> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绒癌属于什么?",
        "output": "select ?x where { <绒癌> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "疣属于哪个科室的病症？",
        "output": "select ?x where { <疣> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风疹属于什么?",
        "output": "select ?x where { <风疹> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风疹患者应该去哪个科室就诊？",
        "output": "select ?x where { <风疹> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风疹的同义词是什么？",
        "output": "select ?x where { <风疹> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风疹涉及什么检查？",
        "output": "select ?x where { <风疹> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风疹涉及哪些症状？",
        "output": "select ?x where { <风疹> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "性早熟属于什么?",
        "output": "select ?x where { <性早熟> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绝经属于什么?",
        "output": "select ?x where { <绝经> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血小板减少性紫癜属于什么?",
        "output": "select ?x where { <血小板减少性紫癜> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "偏头痛属于什么?",
        "output": "select ?x where { <偏头痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "葡萄膜炎属于什么?",
        "output": "select ?x where { <葡萄膜炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性扁桃体炎属于什么?",
        "output": "select ?x where { <慢性扁桃体炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神经母细胞瘤属于什么?",
        "output": "select ?x where { <神经母细胞瘤> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "传染性非典型肺炎属于什么?",
        "output": "select ?x where { <传染性非典型肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "松皮癣属于什么?",
        "output": "select ?x where { <松皮癣> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "性冷淡属于什么?",
        "output": "select ?x where { <性冷淡> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "原醛症属于什么?",
        "output": "select ?x where { <原醛症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蛛网膜下腔出血属于什么?",
        "output": "select ?x where { <蛛网膜下腔出血> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "侏儒症属于什么?",
        "output": "select ?x where { <侏儒症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "功能失调性子宫出血属于什么?",
        "output": "select ?x where { <功能失调性子宫出血> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "功能失调性子宫出血要去哪个科室就诊？",
        "output": "select ?x where { <功能失调性子宫出血> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "功能失调性子宫出血的同义词是什么？",
        "output": "select ?x where { <功能失调性子宫出血> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "功能失调性子宫出血涉及什么症状？",
        "output": "select ?x where { <功能失调性子宫出血> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺心病属于什么?",
        "output": "select ?x where { <肺心病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腕管综合征属于什么?",
        "output": "select ?x where { <腕管综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "视神经萎缩属于什么?",
        "output": "select ?x where { <视神经萎缩> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "卵巢囊肿属于什么?",
        "output": "select ?x where { <卵巢囊肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "晕车属于什么?",
        "output": "select ?x where { <晕车> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汗管瘤属于什么?",
        "output": "select ?x where { <汗管瘤> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻中隔偏曲属于什么?",
        "output": "select ?x where { <鼻中隔偏曲> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻中隔偏曲患者应该去哪个科室就诊？",
        "output": "select ?x where { <鼻中隔偏曲> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻中隔偏曲涉及什么症状？",
        "output": "select ?x where { <鼻中隔偏曲> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股癣患者应该去哪个科室就诊？",
        "output": "select ?x where { <股癣> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高血压属于什么?",
        "output": "select ?x where { <高血压> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宫颈息肉属于什么?",
        "output": "select ?x where { <宫颈息肉> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "库欣综合征属于什么?",
        "output": "select ?x where { <库欣综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "消化不良属于什么?",
        "output": "select ?x where { <消化不良> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斜视属于什么?",
        "output": "select ?x where { <斜视> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "直肠肛管周围脓肿属于什么?",
        "output": "select ?x where { <直肠肛管周围脓肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体肺炎属于什么?",
        "output": "select ?x where { <肺炎支原体肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体肺炎属于什么科?",
        "output": "select ?x where { <肺炎支原体肺炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体肺炎涉及哪些症状？",
        "output": "select ?x where { <肺炎支原体肺炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性胃炎属于什么?",
        "output": "select ?x where { <慢性胃炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性胃炎属于什么科？",
        "output": "select ?x where { <慢性胃炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性胃炎的同义词是什么？",
        "output": "select ?x where { <慢性胃炎> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性胃炎涉及什么症状？",
        "output": "select ?x where { <慢性胃炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹股沟斜疝属于什么?",
        "output": "select ?x where { <腹股沟斜疝> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "牙龈萎缩属于什么?",
        "output": "select ?x where { <牙龈萎缩> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胃溃疡属于什么?",
        "output": "select ?x where { <胃溃疡> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性脑膜炎属于什么?",
        "output": "select ?x where { <病毒性脑膜炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "引起病毒性脑膜炎的病因是什么？",
        "output": "select ?x where { <病毒性脑膜炎> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺水肿属于什么?",
        "output": "select ?x where { <肺水肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管性水肿属于什么?",
        "output": "select ?x where { <血管性水肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鸡眼属于什么?",
        "output": "select ?x where { <鸡眼> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎盘早剥属于什么?",
        "output": "select ?x where { <胎盘早剥> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎盘早剥应该去哪个科室就诊？",
        "output": "select ?x where { <胎盘早剥> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎盘早剥的同义词是什么？",
        "output": "select ?x where { <胎盘早剥> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胎盘早剥涉及哪些症状？",
        "output": "select ?x where { <胎盘早剥> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肾功能不全属于什么?",
        "output": "select ?x where { <肾功能不全> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与登革热的相似疾病或共病有什么？",
        "output": "select ?x where { <登革热> <相似疾病或共病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿肺炎属于什么?",
        "output": "select ?x where { <小儿肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿肺炎涉及什么检查项目？",
        "output": "select ?x where { <小儿肺炎> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乳腺病属于什么?",
        "output": "select ?x where { <乳腺病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "碱性反流性胃炎属于什么?",
        "output": "select ?x where { <碱性反流性胃炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红眼病属于什么?",
        "output": "select ?x where { <红眼病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "疥疮属于什么?",
        "output": "select ?x where { <疥疮> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "疥疮的就诊科室在哪？",
        "output": "select ?x where { <疥疮> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈椎间盘突出属于什么?",
        "output": "select ?x where { <颈椎间盘突出> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓毒症属于什么?",
        "output": "select ?x where { <脓毒症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓毒症就诊科室是什么科？",
        "output": "select ?x where { <脓毒症> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓毒症的同义词是什么？",
        "output": "select ?x where { <脓毒症> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓毒症涉及什么症状？",
        "output": "select ?x where { <脓毒症> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "变应性鼻炎属于什么?",
        "output": "select ?x where { <变应性鼻炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "变应性鼻炎在什么科室就诊？",
        "output": "select ?x where { <变应性鼻炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与变应性鼻炎相近的的词是什么？",
        "output": "select ?x where { <变应性鼻炎> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "变应性鼻炎涉及什么症状？",
        "output": "select ?x where { <变应性鼻炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿道结石属于什么?",
        "output": "select ?x where { <尿道结石> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性白血病属于什么?",
        "output": "select ?x where { <急性白血病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性白血病在什么科室就诊？",
        "output": "select ?x where { <急性白血病> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性白血病涉及哪些症状？",
        "output": "select ?x where { <急性白血病> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓疱疮属于什么?",
        "output": "select ?x where { <脓疱疮> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓疱疮常见病因是什么？",
        "output": "select ?x where { <脓疱疮> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓疱疮是怎么传播的？",
        "output": "select ?x where { <脓疱疮> <传播途径> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓疱疮在什么科室就诊？",
        "output": "select ?x where { <脓疱疮> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓疱疮属于什么科？",
        "output": "select ?x where { <脓疱疮> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓疱疮的同义词是什么？",
        "output": "select ?x where { <脓疱疮> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脓疱疮涉及什么症状？",
        "output": "select ?x where { <脓疱疮> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐骨神经痛属于什么?",
        "output": "select ?x where { <坐骨神经痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "睾丸癌属于什么?",
        "output": "select ?x where { <睾丸癌> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心房颤动属于什么?",
        "output": "select ?x where { <心房颤动> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得性免疫缺陷综合征属于什么?",
        "output": "select ?x where { <获得性免疫缺陷综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得性免疫缺陷综合征的同义词是什么？",
        "output": "select ?x where { <获得性免疫缺陷综合征> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得性免疫缺陷综合征涉及什么检查？",
        "output": "select ?x where { <获得性免疫缺陷综合征> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得性免疫缺陷综合征涉及哪些症状？",
        "output": "select ?x where { <获得性免疫缺陷综合征> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高催乳素血症属于什么?",
        "output": "select ?x where { <高催乳素血症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "室性期前收缩属于什么?",
        "output": "select ?x where { <室性期前收缩> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性前列腺炎属于什么?",
        "output": "select ?x where { <慢性前列腺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性前列腺炎患者在什么科室就诊？",
        "output": "select ?x where { <慢性前列腺炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性前列腺炎涉及哪些症状？",
        "output": "select ?x where { <慢性前列腺炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外阴溃疡属于什么?",
        "output": "select ?x where { <外阴溃疡> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑性瘫痪属于什么?",
        "output": "select ?x where { <脑性瘫痪> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性冠状动脉综合征属于什么?",
        "output": "select ?x where { <急性冠状动脉综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不安腿综合征属于什么?",
        "output": "select ?x where { <不安腿综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿道下裂属于什么?",
        "output": "select ?x where { <尿道下裂> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性乙型肝炎属于什么?",
        "output": "select ?x where { <慢性乙型肝炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血小板增多症属于什么?",
        "output": "select ?x where { <血小板增多症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈椎病属于什么?",
        "output": "select ?x where { <颈椎病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿肺炎属于什么?",
        "output": "select ?x where { <新生儿肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿肺炎涉及什么检查？",
        "output": "select ?x where { <新生儿肺炎> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "引起滴虫性阴道炎的原因是什么？",
        "output": "select ?x where { <滴虫性阴道炎> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "过敏性鼻炎有什么症状？",
        "output": "select ?x where { <过敏性鼻炎> <症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "过敏性鼻炎有怎样的风险因子（英语：Riskfactor）?",
        "output": "select ?x where { <过敏性鼻炎> <风险因子（英语：Riskfactor）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与过敏性鼻炎相似的疾病或者共病是什么？",
        "output": "select ?x where { <过敏性鼻炎> <相似疾病或共病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "房室传导阻滞属于什么?",
        "output": "select ?x where { <房室传导阻滞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "房室传导阻滞应在哪个科室就诊？",
        "output": "select ?x where { <房室传导阻滞> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "房室传导阻滞的同义词是什么？",
        "output": "select ?x where { <房室传导阻滞> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "房室传导阻滞涉及什么症状？",
        "output": "select ?x where { <房室传导阻滞> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黏液囊肿属于什么?",
        "output": "select ?x where { <黏液囊肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "直肠脱垂属于什么?",
        "output": "select ?x where { <直肠脱垂> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性咽炎属于什么?",
        "output": "select ?x where { <急性咽炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性咽炎应该去哪个科室就诊？",
        "output": "select ?x where { <急性咽炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性咽炎涉及哪些症状？",
        "output": "select ?x where { <急性咽炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中暑属于什么?",
        "output": "select ?x where { <中暑> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中暑适合去什么科室就诊？",
        "output": "select ?x where { <中暑> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中暑涉及什么检查？",
        "output": "select ?x where { <中暑> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耵聍栓塞属于什么?",
        "output": "select ?x where { <耵聍栓塞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肠易激综合征属于什么?",
        "output": "select ?x where { <肠易激综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "羊水栓塞属于什么?",
        "output": "select ?x where { <羊水栓塞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺气肿属于什么?",
        "output": "select ?x where { <肺气肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺气肿适合去什么科室就诊？",
        "output": "select ?x where { <肺气肿> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与肺气肿相近词是什么？",
        "output": "select ?x where { <肺气肿> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺气肿涉及什么检查？",
        "output": "select ?x where { <肺气肿> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺气肿涉及哪些症状？",
        "output": "select ?x where { <肺气肿> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脂肪瘤属于什么?",
        "output": "select ?x where { <脂肪瘤> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脂肪瘤适合去什么科室就诊？",
        "output": "select ?x where { <脂肪瘤> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脂肪瘤涉及哪些症状？",
        "output": "select ?x where { <脂肪瘤> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "扁平苔藓属于什么?",
        "output": "select ?x where { <扁平苔藓> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻窦炎的风险因子（英语：Riskfactor）有哪些？",
        "output": "select ?x where { <鼻窦炎> <风险因子（英语：Riskfactor）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎有怎样的风险因子（英语：R亚临床甲减iskfactor）？",
        "output": "select ?x where { <肺炎> <风险因子（英语：Riskfactor）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有严重急性呼吸综合征和重症急性呼吸综合征要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <严重急性呼吸综合征> . ?x <涉及疾病> <重症急性呼吸综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查可以检测出乙肝小三阳？",
        "output": "select ?x where { ?x <类型> <检查项目> . ?x <涉及症状> <乙肝小三阳> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现乙肝小三阳和色素沉着的症状需要检查什么？",
        "output": "select ?x where { ?x <涉及症状> <乙肝小三阳> . ?x <涉及症状> <色素沉着> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有肝炎和巴多林氏腺癌疾病，应该做哪项医学检查？",
        "output": "select ?x where { ?x <涉及疾病> <肝炎> . ?x <涉及疾病> <巴多林氏腺癌> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对检测巴多林氏腺癌和肝脏炎症性疾病有效？",
        "output": "select ?x where { ?x <涉及疾病> <巴多林氏腺癌> . ?x <涉及疾病> <肝脏炎症性疾病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个检查项目对检测肝脏炎症性疾病和急性海绵窦栓塞性静脉炎有用？",
        "output": "select ?x where { ?x <涉及疾病> <肝脏炎症性疾病> . ?x <涉及疾病> <急性海绵窦栓塞性静脉炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有急性海绵窦栓塞性静脉炎和眶骨膜下脓肿要做那哪个检查？",
        "output": "select ?x where { ?x <涉及疾病> <急性海绵窦栓塞性静脉炎> . ?x <涉及疾病> <眶骨膜下脓肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查对检测毛细胞白血病以及外阴前庭大腺癌有用？",
        "output": "select ?x where { ?x <涉及疾病> <毛细胞白血病> . ?x <涉及疾病> <外阴前庭大腺癌> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查属于白细胞检查，且对淋巴结肿大症状检测有效？",
        "output": "select ?x where { ?x <类型> <白细胞检查> . ?x <涉及症状> <淋巴结肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现淋巴结肿大以及咳嗽的这些症状反应要做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <淋巴结肿大> . ?x <涉及症状> <咳嗽> . }"
    }
]