[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冯小刚的女儿在哪儿上的大学？",
        "output": "select ?y where { <冯小刚> <女儿> ?x. ?x <毕业院校> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舒伯特出生城市有什么著名景点？",
        "output": "select ?y where { <舒伯特> <出生地> ?x. ?x <著名景点> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "加拿大首都使用的语言？",
        "output": "select ?x where { <加拿大_（北美洲国家）> <首都> ?y . ?y <方言> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "# 邓稼先的母校的校训是？",
        "output": "select ?y where { <邓稼先_（中国科学院院士）> <毕业院校> ?x. ?x <校训> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿根廷首都面积有多大？",
        "output": "select ?x where { <阿根廷_（阿根廷共和国）> <首都> ?y. ?y <面积> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁成功预言了哈雷彗星的回归？",
        "output": "select ?x where { ?x <主要成就> \"成功预言了\". ?x <主要成就> \"哈雷彗星的回归\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广受国内外群众喜爱发源于泸州的美食是什么？",
        "output": "select ?x where { ?x <影响> \"广受国内外群众喜爱\". ?x <起源地> <泸州>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《半生缘》的作者的毕业院校是？",
        "output": "select ?x where { <半生缘_（张爱玲作品）> <作者> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发行电影《谍影重重3》的公司的组织形式是怎样的？",
        "output": "select ?x where { <谍影重重3> <发行公司> ?y. ?y <组织形式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果公司的创始人什么时候去世的？",
        "output": "select ?x where { <苹果_（苹果产品公司）> <创始人> ?y. ?y <逝世日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "算盘的发明者是什么时代的人？",
        "output": "select ?y where { <算盘> <发明者> ?x. ?x <所处时代> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杜邦传的作者身高多少？",
        "output": "select ?x where { <杜邦传> <作者> ?y. ?y <身高> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大的学位是什么？",
        "output": "select ?y where { ?x <别名> \"习大大\". ?x <学位> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周恩来的妻子曾当过什么主席？",
        "output": "select ?y where { <周恩来> <配偶> ?x. ?y <主席> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿根廷国鸟属于哪个目？",
        "output": "select ?x where { <阿根廷_（阿根廷共和国）> <国鸟> ?y. ?y <目> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影不能说的秘密片长是多少？",
        "output": "select ?y where { ?x <中文名> \"不能说的秘密\" . ?x <片长> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘翔的父亲多高？",
        "output": "select ?z where { ?x <中文名> \"刘翔\" . ?x <父亲> ?y . ?y <身高> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哈利·波特是谁写的？",
        "output": "select ?y where { ?x <作品名称> \"哈利·波特\" . ?x <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "文艺复兴的指导思想有怎样的世界观?？",
        "output": "select ?y where { <文艺复兴> <指导思想> ?x . ?x <世界观> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影消失的爱人中哪位主演毕业于牛津大学？",
        "output": "select ?x where { <消失的爱人_（美国2014年大卫·芬奇执导电影）> <主演> ?x. ?x <毕业院校> <牛津大学>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雕版印刷术和火药发明于中国哪个朝代？",
        "output": "select ?x where { ?x <科技成就> \"火药\". ?x <科技成就> \"雕版印刷术\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北大校长的生日是什么时候？",
        "output": "select ?x where { <北京大学> <现任校长> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿根廷的官方语言全球有多少人在用？",
        "output": "select ?x where { <阿根廷_（阿根廷共和国）> <官方语言> ?y. ?y <使用人数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚马孙河所在的大洲主要使用哪些语言？",
        "output": "select ?y where { <亚马孙河> <所属地区> ?x. ?x <语言> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获\"第6届本格推理小说大奖\"的作家有哪些代表作品？",
        "output": "select ?y where { ?x <主要成就> \"第6届本格推理小说大奖\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "占地1199平方公里，人口209899的是哪个县？",
        "output": "select ?x where { ?x <面积> \"1199平方公里\". ?x <人口> \"209899\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阜田镇的方言属于哪个语系？",
        "output": "select ?x where { <阜田镇> <方言> ?y. ?y <所属语系> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欧盟成员国主要有哪些宗教？",
        "output": "select distinct ?x where { <欧盟_（欧洲经济、政治共同体）> <成员国> ?y. ?y <主要宗教> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梁启超，康有为等人发动的救亡图存的运动是什么？",
        "output": "select ?x where { ?x <主要人物> <梁启超_（中国近代思想家、政治家、教育家）>. ?x <主要人物> <康有为>. ?x <目的> \"救亡图存\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "太平天国所信仰的宗教是什么时间建立的？",
        "output": "select ?y where { <太平天国_（中国历史政权）> <主要宗教> ?x. ?x <创建时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《最后的晚餐》的作者出生地是哪里？",
        "output": "select ?y where { <最后的晚餐_（达·芬奇画作）> <作者> ?x. ?x <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《三体》的作者什么时候出生？",
        "output": "select ?z where { ?x <作品名称> \"三体\" . ?x <作者> ?y . ?y <出生日期> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和黄瓜同科的植物有哪些？",
        "output": "select ?x where { <黄瓜> <界> ?y5. <黄瓜> <门> ?y4. <黄瓜> <纲> ?y3. <黄瓜> <亚纲> ?y2. <黄瓜> <科> ?y1. ?x <界> ?y5. ?x <门> ?y4. ?x <纲> ?y3. ?x <亚纲> ?y2. ?x <科> ?y1. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古希腊悲剧《俄狄浦斯王》的作者的出生日期？",
        "output": "select ?x where { <俄狄浦斯王_（古希腊悲剧）> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神话中赫拉的配偶的外文名？",
        "output": "select ?x where { <赫拉_（古希腊神话中的第三代天后）> <配偶> ?y . ?y <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张全蛋的外文名是什么?？",
        "output": "select ?y where { ?x <中文名> \"张全蛋\" . ?x <外文名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "邓小平的毕业院校属于什么类别的大学？",
        "output": "select ?z where { ?x <中文名> \"邓小平\" . ?x <毕业院校> ?y . ?y <类别> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵本山的大儿子什么时候出生的？",
        "output": "select ?z where { ?x <中文名> \"赵本山\" . ?x <大儿子> ?y . ?y <出生日期> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《食神》的导演,6次打破香港电影票房纪录,他的出生日期？",
        "output": "select ?x where { ?y <主要成就> \"6次打破香港电影票房纪录\". ?y <代表作品> <食神_（1996年周星驰自编自导自主演喜剧片）>. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《聊斋志异》的作者被人们称为什么？",
        "output": "select ?y where { <聊斋志异_（蒲松龄著文言短篇小说集《聊斋志异》）> <作者> ?x. ?x <别称> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些人又是歌手又能演戏又能编剧，还能当大导演？",
        "output": "select ?x where { ?x <职业> <歌手_（职业名称）>. ?x <职业> <演员_（职业）>. ?x <职业> <编剧>. ?x <职业> <导演>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国地图出版社出版的371页的地图集是哪本？",
        "output": "select ?x where { ?x <出版社> <中国地图出版社>. ?x <页数> \"371\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发明了飞机的美国人信仰什么宗教？",
        "output": "select ?y where { ?x <国籍> <美国_（美利坚合众国）>. ?x <主要成就> \"发明了飞机\". ?x <信仰> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "指环王是在哪个洲拍摄的？",
        "output": "select ?x where { <指环王_（英美2001-2003年彼得·杰克逊执导系列电影）> <拍摄地点> ?y.?y <所属洲> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "J联赛球队大阪樱花的主场最多能够容纳多少人？",
        "output": "select ?x where { <大阪樱花足球俱乐部> <主场馆> ?y. ?y <容量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习近平的母校的现在的校长是谁？",
        "output": "select ?z where { <习近平> <毕业院校> ?y. ?y <现任校长> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《丰乳肥臀》的作者其民族是？",
        "output": "select ?x where { <丰乳肥臀> <作者> ?y. ?y <民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴黎的市长是在哪出生的？",
        "output": "select ?x where { <巴黎_（法国首都）> <市长> ?y. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影阿凡达的出品公司的成立时间？",
        "output": "select ?y where { <Avatar_（2009年上映詹姆斯·卡梅隆执导美国电影）> <出品公司> ?x. ?x <成立时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冥王星的发现者的外文名是什么？",
        "output": "select ?y where { <冥王星_（太阳系中的一个天体）> <发现者> ?x. ?x <外文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长城所在国家的首都是？",
        "output": "select ?x where { <万里长城_（中国古代军事工程）> <所属国家> ?y. ?y <首都> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天蝎座的守护神的居所在哪里？",
        "output": "select ?y where { <天蝎座_（占星学）> <守护神> ?x. ?x <居所> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄贯中的老婆参演了哪些影视作品？",
        "output": "select ?x where { <黄贯中> <配偶> ?y. ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "NIKE创始人的毕业院校是什么？",
        "output": "select ?x where { <NIKE> <创始人> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "克苏鲁属于哪个群体都有哪些成员？",
        "output": "select ?x where { <克苏鲁_（克苏鲁的呼唤神话小说里面的邪灵角色）> <所属> ?y. ?x <所属> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘禅在位多少年？",
        "output": "select ?y where { ?x <本名> \"刘禅\". ?x <在位> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出自叶圣陶，指挺着大肚子的大商人的是哪个词？",
        "output": "select ?x where { ?x <语出> <叶圣陶>. ?x <释义> \"指挺着大肚子的大商人\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学现任校长的学历？",
        "output": "select ?x where { <北京大学> <现任校长> ?y . ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"骐骥一跃不能十步\"的作者的知名弟子有哪些？",
        "output": "select ?y where { <骐骥一跃不能十步> <作者> ?x. ?x <著名弟子> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万达集团董事长的儿子有什么外号吗?？",
        "output": "select ?q where { ?x <公司名称> ?y . filter regex(?y, \"万达集团\") . ?x <董事长> ?z . ?z <儿子> ?p . ?p <别名> ?q . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐僧的哪个徒弟居住在云栈洞？",
        "output": "select ?y where { <唐僧_（《西游记》中的人物）> <徒弟> ?y. ?y <居所> <云栈洞>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《街头霸王》系列游戏的发行公司成立于哪一年？",
        "output": "select ?y where { <街头霸王_（日本CAPCOM公司推出电子游戏系列）> <发行商> ?x. ?x <成立时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《野草》的作者其民族是？",
        "output": "select ?x where { <野草_（鲁迅创作散文诗集）> <作者> ?y. ?y <民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《半生缘》的作者的主要成就有哪些？",
        "output": "select ?x where { <半生缘_（张爱玲作品）> <作者> ?y. ?y <血型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《罗密欧与朱丽叶》的作者是信什么教的？",
        "output": "select ?x where { ?y <代表作品> <罗密欧与朱丽叶_（莎士比亚著名戏剧）>. ?y <信仰> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《水浒传》所属文学体裁的三要素是什么？",
        "output": "select ?y where { <水浒传（竖版）> <类型> ?x. ?x <三要素> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光合作用发生的部位长度是多少？",
        "output": "select ?y where { <光合作用> <作用部位> ?x. ?x <长径> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "提出相对论的是哪个国家的人？",
        "output": "select ?y where { <相对论_（关于时空和引力的基本理论）> <提出者> ?x. ?x <国籍> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "垓下歌的作者什么时候死的？",
        "output": "select ?x where { ?y <主要作品> <垓下歌_（项羽诗歌）>. ?y <去世时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《色戒》里的美籍主演有谁？",
        "output": "select ?x where { <色戒_（李安执导电影）> <主演> ?x. ?x <国籍> <美国_（美利坚合众国）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得首届孔子国籍文学奖的诗人是谁？",
        "output": "select ?x where { ?x <职业> <诗人_（汉语词语）>. ?x <主要成就> \"获得首届孔子国际文学奖\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梁启超的儿媳妇是谁？",
        "output": "select ?y where { ?x <父亲> <梁启超_（中国近代思想家、政治家、教育家）>. ?x <配偶> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "数据库是什么时候开始有的？",
        "output": "select ?y where { ?x <中文名> \"数据库\" . ?x <产生时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《丰乳肥臀》的作者的别名有？",
        "output": "select ?x where { <丰乳肥臀> <作者> ?y. ?y <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "明朝永乐大帝是谁？",
        "output": "select ?y where { ?x <中文名> ?y. ?x <年号> <永乐_（明成祖朱棣年号）>. ?x <国籍> <明朝_（中国历史朝代）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"中国导弹之父\"指的是谁？",
        "output": "select ?x where { ?x <主要成就> \"中国导弹之父\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冥王星的发现者是哪国人？",
        "output": "select ?y where { <冥王星_（太阳系中的一个天体）> <发现者> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉丁学名为\"Gerbera kunzeana A. Br. et Aschers.\"的植物属于哪一个纲？",
        "output": "select ?x where { ?y <拉丁学名> \"Dicotyledons\". ?y <纲> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小说《伊豆的舞女》的作者出生日期是哪年?",
        "output": "select ?y where { <雪国_（日本川端康成著小说）> <作者> ?x. ?x <出生日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "叔本华信仰的宗教主要分布在哪些区域？",
        "output": "select ?x where { <亚瑟·叔本华> <信仰> ?y. ?y <主要分布区域> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冰与火之歌拍摄地国土面积有多大？",
        "output": "select ?x where { <冰与火之歌_（美国HBO电视台制作的电视剧）> <拍摄地点> ?y.?y <国土面积> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李世民推崇的思想流派的代表人物有谁？",
        "output": "select ?y where { <李世民_（唐太宗）> <信仰> ?x. ?x <代表人物> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "建宁公主是哪位作家笔下的人物？",
        "output": "select ?x where { <建宁公主_（金庸小说《鹿鼎记》人物）> <登场作品> ?y. ?y <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"弱者道之用\"是哪位哲学家的主张？",
        "output": "select ?x where { <弱者道之用> <作者> ?x. ?x <职业> <哲学家_（基础含义）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"2009年第一轮第3位被雷霆队选中\"的球员球衣号码是？",
        "output": "select ?y where { ?x <nba选秀> \"2009年第一轮第3位被雷霆队选中\" . ?x <球衣号码> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海总商会的首任总理是何时去世的？",
        "output": "select ?x where { <上海总商会> <首任总理> ?y. ?y <去世时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"2009年第一轮第3位被雷霆队选中\"的球员的场上位置是？",
        "output": "select ?y where { ?x <nba选秀> \"2009年第一轮第3位被雷霆队选中\" . ?x <场上位置> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《丰乳肥臀》的作者出生日期是？",
        "output": "select ?x where { <丰乳肥臀> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴洛克的流行时间是什么时候?？",
        "output": "select ?y where { ?x <中文名> \"巴洛克\" . ?x <流行时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《半生缘》的作者其民族是？",
        "output": "select ?x where { <半生缘_（张爱玲作品）> <作者> ?y. ?y <民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金庸小说《天龙八部》中，大理的哪个和尚练成少泽剑？",
        "output": "select ?x where { ?x <国籍> <大理_（古代国家）>. ?x <别名> \"枯荣和尚\". ?x <武功> <少泽剑>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "爱伦·坡出生的城市有哪些著名景点？",
        "output": "select ?x where { <埃德加·爱伦·坡> <出生地> ?y. ?y <著名景点> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "莫扎特所在的民族是什么人种?？",
        "output": "select ?p where { ?x <中文名> ?z . filter regex(?z, \"莫扎特\") . ?x <民族> ?y . ?y <人种> ?p . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与郭德纲同乡且当过主持人的歌手都有谁？",
        "output": "select ?y where { <郭德纲> <出生地> ?x . ?y <职业> <歌手_（职业名称）> . ?y <职业> <主持人> . ?y <出生地> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张柏芝、谢霆锋合作的动作电影是哪一部？",
        "output": "select ?x where { ?x ?a <张柏芝>. ?x ?b <谢霆锋>. ?x <类型> <动作_（词语解释）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国有哪些城市与布里斯班气候类似？",
        "output": "select ?y where { <布里斯班_（澳大利亚昆士兰州首府）> <气候条件> ?x.?y <气候条件> ?x.?y <所属地区> <中华人民共和国>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "未来这个词怎么拼呀？",
        "output": "select ?y where { ?x <中文名> \"未来\" . ?x <拼音> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由环球影片公司发行的111分钟并由马特达蒙主演的电影是哪部？",
        "output": "select ?x where { ?x <发行公司> <环球影片公司>. ?x <片长> \"111分钟\". ?x <主演> <马特·达蒙>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐玄宗的出生地是哪里？",
        "output": "select ?y where { ?x <出生地> ?y. ?x <庙号> <玄宗_（帝王庙号）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小说《萌幻西游》中又被称为小四，四儿的人物是哪位？",
        "output": "select ?x where { ?x <登场作品> <萌幻西游>. ?x <其他名称> \"小四，四儿\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"ピカチュウ（日文）\"是谁配音的？",
        "output": "select ?y where { ?x <外文名> \"ピカチュウ（日文）\". ?x <配音> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信教的北洋军阀有谁？",
        "output": "select ?x where { <北洋军阀_（民国军阀势力之一）> <主要人物> ?x. ?x <信仰> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"诸葛连弩\"的创造者葬在哪里？",
        "output": "select ?y where { ?x <主要成就> \"改造连弩\". ?x <墓葬> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我的GAKKI老婆多高呀？",
        "output": "select ?z where { ?x <别名> ?y . ?x <身高> ?z . filter regex(?y, \"GAKKI\") . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学现任校长有哪些主要成就？",
        "output": "select ?x where { <北京大学> <现任校长> ?y. ?y <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"Peking University\"是哪个大学？",
        "output": "select ?x where { ?x <类别> <公立大学>. ?x <英文名> \"Peking University\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "查良镛的代表作品有哪些？",
        "output": "select ?y where { ?x <中文名> \"查良镛\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "原产自苏联、输入射速为600发/分的步枪有效射程是多远？",
        "output": "select ?y where { ?x <有效射程> \"300\". ?x <原产国> <苏联>. ?x <售价> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《额尔古纳河右岸》的作者出生在哪里？",
        "output": "select ?y where { <额尔古纳河右岸> <作者> ?x. ?x <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小马哥有多少钱？",
        "output": "select ?y where { ?x <别名> \"小马哥\". ?x <事业财富> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈从文的同族人他们一般聚居在哪？",
        "output": "select ?x where { <沈从文> <民族> ?y. ?y <主要分布区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "夏至线在地理上有什么意义？",
        "output": "select ?y where { ?x <别名> \"夏至线\". ?x <地理意义> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Beijing Opera的发源地是哪里？",
        "output": "select ?x where { ?y <外文名> \"Beijing Opera；Peking Opera\". ?y <发源地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宝安国际机场所在的省的省会是？",
        "output": "select ?x where { ?y <机场> <深圳宝安国际机场>. ?y <政府驻地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金庸小说《天龙八部》中，无崖子的师妹的外孙女是谁？",
        "output": "select ?y where { <无崖子> <师妹> ?x. ?x <外孙女> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "都有哪几种日历？",
        "output": "select ?y where { ?x <中文名> \"日历\" . ?x <种类> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毛泽东家乡的气候条件如何？",
        "output": "select ?x where { <毛泽东_（无产阶级革命家）> <出生地> ?y. ?y <气候条件> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舒伯特出生城市的车牌代码是什么？",
        "output": "select ?y where { <舒伯特> <出生地> ?x. ?x <车牌代码> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纳兰性德的父亲担任过什么官职？",
        "output": "select ?y where { <纳兰性德> <父亲> ?x. ?x <主要职位> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汽车制造行业创立于\"1953-07-15\"的公司的外文名是?？",
        "output": "select ?y where { ?x <所属行业> <汽车制造>. ?x <创立时间> \"1953-07-15\". ?x <英文名称> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "房仕龙的代表作品？",
        "output": "select ?x where { ?y <别名> \"陈港生（原名）、房仕龙、元楼、陈元龙\". ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿塞拜疆所属洲主要有哪些国家？",
        "output": "select ?x where { <阿塞拜疆> <所属洲> ?y. ?y <主要国家> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果公司的现任首席设计师是哪个国家的？",
        "output": "select ?y where { <苹果_（苹果产品公司）> <首席设计师> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《孙子兵法》的作者本名是什么？",
        "output": "select ?y where { <孙子兵法_（中国古典军事文化著作）> <作者> ?x. ?x <本名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "指环王导演获得过那些奖项？",
        "output": "select ?y where { <指环王_（英美2001-2003年彼得·杰克逊执导系列电影）> <导演> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舒伯特的同行里有哪些人和他拥有共同的信仰？",
        "output": "select ?x where { <舒伯特> <信仰> ?a. <舒伯特> <职业> ?b. ?x <信仰> ?a. ?x <职业> ?b. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《指环王》系列电影的导演是哪个国家的？",
        "output": "select ?y where { <指环王_（英美2001-2003年彼得·杰克逊执导系列电影）> <导演> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《丰乳肥臀》的作者的主要成就是？",
        "output": "select ?x where { <丰乳肥臀> <作者> ?y. ?y <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《全唐诗》编于哪个朝代？",
        "output": "select ?y where { <全唐诗> <作者> ?x. ?x <所处时代> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"思想自由兼容并包\"是哪个学校的学术传统？",
        "output": "select ?x where { ?x <学术传统> \"思想自由\". ?x <学术传统> \"兼容并包\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张学友和王菲合唱的歌曲有哪些？",
        "output": "select ?x where { ?x <歌曲原唱> <张学友>. ?x <歌曲原唱> <王菲_（华语女歌手、演员）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪里能看暴走大事件呀？",
        "output": "select ?y where { ?x <中文名> \"暴走大事件\" . ?x <在线播放平台> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华校长是哪里人？",
        "output": "select ?y where { <清华大学> <现任校长> ?x. ?x <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "首创科举制的朝代所用的官方语言是什么？",
        "output": "select ?y where { ?x <主要贡献> \"开科取士\". ?x <官方语言> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成龙的儿子有哪些代表作？",
        "output": "select ?y where { <成龙_（中国香港演员、导演）> <儿子> ?x. ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "<江陵愁望寄子安>的作者信仰什么教？",
        "output": "select ?x where { ?y <代表作品> <江陵愁望寄子安>. ?y <信仰> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俗称\"猪仔笼\"的植物的拉丁学名是什么？",
        "output": "select ?x where { ?y <别称> <猪仔笼>. ?y <拉丁学名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "消失的爱人的导演还导演过哪部Netflix的美剧？",
        "output": "select ?x where { <消失的爱人_（美国2014年大卫·芬奇执导电影）> <导演> ?y. ?x <导演> ?y. ?x <制片地区> <美国_（美利坚合众国）>. ?x <发行公司> <Netflix>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海期货交易所所在地区的气候怎么样？",
        "output": "select ?x where { <上海期货交易所> <地区> ?y. ?y <气候条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员刘烨的儿女是哪国人？",
        "output": "select ?y where { <刘烨_（中国内地男演员）> <子女> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老友记的主演们都有哪些代表作品？",
        "output": "select ?z where { ?x <中文名> \"老友记\" . ?x <主演> ?y . ?y <代表作品> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"声东击西\"出自古代的一本兵书，你知道是谁写的吗？",
        "output": "select ?y where { <声东击西> <出处> ?x. ?x <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一个条约的签署标志着中国完全沦为半殖民地半封建社会？",
        "output": "select ?x where { ?x <历史影响> \"中国彻底沦为半殖民地半封建社会\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古典小说中武大郎的弟弟的原型是谁？",
        "output": "select ?x where { <武大郎_（古典小说人物）> <弟弟> ?y. ?x <原型> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鸦片的有效成分中文别名是什么？",
        "output": "select ?z where { <鸦片> <有效成分> ?y . ?y <中文别名> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天龙八部的作者原名是什么？",
        "output": "select ?y where { <天龙八部_（金庸创作小说）> <作者> ?x. ?x <中文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第二次世界大战中苏联的指挥官是谁？",
        "output": "select ?x where { <第二次世界大战_（20世纪世界反法西斯战争）> <主要指挥官> ?x. ?x <国籍> <苏联>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"上帝已死\"是由哪位哲学家提出的著名观点？",
        "output": "select ?x where { <上帝已死> <提出者> ?x. ?x <职业> <哲学家_（基础含义）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宋代词人李清照的丈夫是什么职业？",
        "output": "select ?y where { <李清照_（宋代女词人）> <配偶> ?x. ?x <职业> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚洲哪个国家的宗教圣地是麦加？",
        "output": "select ?x where { ?x <所属洲> <亚洲>. ?x <宗教圣地> \"麦加\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于-413年，逝世于-354年的那位琴师有什么代表作品？",
        "output": "select ?y where { ?x <出生日期> \"-413\". ?x <逝世日期> \"-354\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国都有哪些网球基地？",
        "output": "select ?y where { ?x <中文名> \"网球\" . ?x <中国网球基地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐人公司出品的射雕英雄传是哪一年的版本？",
        "output": "select ?y where { ?x <出品公司> <唐人_（唐人电影）>. ?x <中文名> \"射雕英雄传\". ?x <出品时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "命运交响曲的作曲是谁？",
        "output": "select ?x where { ?y <又名> \"命运交响曲\". ?y <谱曲> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大的信仰是什么？",
        "output": "select ?y where { ?x <别名> \"习大大\". ?x <信仰> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《EVA》片头曲的原唱是谁？",
        "output": "select ?y where { <eva_（福音战士ACGN系列）> <片头曲> ?x. ?x <歌曲原唱> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫的建造者还有哪些其他的成就？",
        "output": "select ?y where { <故宫_（北京故宫）> <建造者> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《根鸟》的作者是哪个民族的人",
        "output": "select ?x where { <根鸟> <作者> ?y . ?y <民族> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《巴黎圣母院》的作者有什么成就？",
        "output": "select ?y where { <巴黎圣母院_（维克多·雨果长篇小说）> <作者> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影阿凡达的导演来自哪个国家？",
        "output": "select ?x where { <Avatar_（2009年上映詹姆斯·卡梅隆执导美国电影）> <导演> ?y. ?y <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "莫扎特的家乡有多少人口？",
        "output": "select ?x where { <莫扎特_（欧洲著名古典主义音乐作曲家）> <出生地> ?a. ?a <人口> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国职业篮球联赛每年的举办时间是什么时候？",
        "output": "select ?y where { ?x <中文名称> \"美国职业篮球联赛\" . ?x <举办时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汶川县多大呀？",
        "output": "select ?y where { ?x <中文名称> \"汶川县\" . ?x <面积> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舒伯特出生城市有什么国籍组织？",
        "output": "select ?y where { <舒伯特> <出生地> ?x. ?x <国际组织> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和爱伦·坡来自同一国家的同行都有谁？",
        "output": "select ?x where { <埃德加·爱伦·坡> <国籍> ?y. <埃德加·爱伦·坡> <职业> ?z.?x <国籍> ?y.?x <职业> ?z.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "澳大利亚的首都有多少人口？",
        "output": "select ?y where { <澳大利亚> <首都> ?x. ?x <人口> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美元的使用地区属于哪个洲?？",
        "output": "select ?y where { <美元> <使用地区> ?x . ?x <所属洲> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海贼王里发明了天候棒的人价值多少赏金？",
        "output": "select ?y where { ?x <登场作品> <海贼王_（尾田荣一郎创作的漫画作品）>. <天候棒> <发明者> ?x. ?x <悬赏金> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大属于哪个民族？",
        "output": "select ?x where { ?x <别名> \"习大大\". ?x <民族> ?y . }"
    }
]