[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横纹肌肉瘤的发病部位在哪？",
        "output": "select ?x where { <横纹肌肉瘤> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横纹肌肉瘤患者会有哪些临床表现？",
        "output": "select ?x where { <横纹肌肉瘤> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口唇发绀且伴随低氧血症症状出现，属于什么病？",
        "output": "select ?x where { ?x <涉及症状> <口唇发绀> . ?x <伴随症状> <低氧血症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病属于急诊科且涉及动脉血气分析的检查？",
        "output": "select ?x where { ?x <科室> <急诊科> . ?x <涉及检查> <动脉血气分析> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发病表现为创伤且需要做动脉血气分析检查的是什么疾病？",
        "output": "select ?x where { ?x <涉及检查> <动脉血气分析> . ?x <涉及症状> <创伤> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "隶属于胸部外科而且与胸水,胸液意义相同的疾病是什么？",
        "output": "select ?x where { ?x <科室> <胸部外科> . ?x <同义词> <胸水,胸液> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现心悸和白细胞增多是什么病？",
        "output": "select ?x where { ?x <涉及症状> <心悸> . ?x <涉及症状> <白细胞增多> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者喜欢暴饮暴食且经常处于紧张状态是什么疾病？",
        "output": "select ?x where { ?x <涉及症状> <暴饮暴食> . ?x <涉及症状> <紧张> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与紧张、胸痛有关的疾病有什么？",
        "output": "select ?x where { ?x <涉及症状> <紧张> . ?x <涉及症状> <胸痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些疾病的涉及症状包括胸痛和利尿？",
        "output": "select ?x where { ?x <涉及症状> <胸痛> . ?x <涉及症状> <利尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与利尿和胸水症状相关的疾病有哪些？",
        "output": "select ?x where { ?x <涉及症状> <利尿> . ?x <涉及症状> <胸水> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么疾病会伴随胸水和气管移位的症状？",
        "output": "select ?x where { ?x <涉及症状> <胸水> . ?x <涉及症状> <气管移位> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么疾病与气管移位和液气胸症状有关？",
        "output": "select ?x where { ?x <涉及症状> <气管移位> . ?x <涉及症状> <液气胸> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病涉及液气胸和低蛋白血症这些症状？",
        "output": "select ?x where { ?x <涉及症状> <液气胸> . ?x <涉及症状> <低蛋白血症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "涉及低蛋白血症和肝硬化的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <低蛋白血症> . ?x <涉及疾病> <肝硬化> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与肝硬化和链球菌感染有关的疾病有什么？",
        "output": "select ?x where { ?x <涉及疾病> <肝硬化> . ?x <涉及疾病> <链球菌感染> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个疾病的涉及症状有肺实变和发热？",
        "output": "select ?x where { ?x <涉及症状> <肺实变> . ?x <涉及症状> <发热> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与发热、紫绀症状有关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <发热> . ?x <涉及症状> <紫绀> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现紫绀和急性病容症状时可能是什么疾病？",
        "output": "select ?x where { ?x <涉及症状> <紫绀> . ?x <涉及症状> <急性病容> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及急性病容和高热的症状？",
        "output": "select ?x where { ?x <涉及症状> <急性病容> . ?x <涉及症状> <高热> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与高热和脓性分泌物症状有关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <高热> . ?x <涉及症状> <脓性分泌物> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会与脓性分泌物和血压下降有关？",
        "output": "select ?x where { ?x <涉及症状> <脓性分泌物> . ?x <涉及症状> <血压下降> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的病会伴随血压下降和尿急的症状？",
        "output": "select ?x where { ?x <涉及症状> <血压下降> . ?x <涉及症状> <尿急> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发生尿急以及寒战的症状可能属于什么病？",
        "output": "select ?x where { ?x <涉及症状> <尿急> . ?x <涉及症状> <寒战> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与寒战、肝脾肿大相关的疾病有什么？",
        "output": "select ?x where { ?x <涉及症状> <寒战> . ?x <涉及症状> <肝脾肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝脾肿大和慢性前列腺炎的症状可能与什么病相关？",
        "output": "select ?x where { ?x <涉及症状> <肝脾肿大> . ?x <涉及疾病> <慢性前列腺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与慢性前列腺炎以及肝脓肿有关的疾病有什么？",
        "output": "select ?x where { ?x <涉及疾病> <慢性前列腺炎> . ?x <涉及疾病> <肝脓肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么病会涉及到肝脓肿和急性喉气管支气管炎？",
        "output": "select ?x where { ?x <涉及疾病> <肝脓肿> . ?x <涉及疾病> <急性喉气管支气管炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺淤血和端坐呼吸的症状表现也许和哪种病有关？",
        "output": "select ?x where { ?x <涉及症状> <肺淤血> . ?x <涉及症状> <端坐呼吸> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与端坐呼吸以及哮鸣音有关的疾病是哪个？",
        "output": "select ?x where { ?x <涉及症状> <端坐呼吸> . ?x <涉及症状> <哮鸣音> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病会出现低热的症状且需要做耳、鼻、咽拭子细菌培养检查？",
        "output": "select ?x where { ?x <涉及检查> <耳、鼻、咽拭子细菌培养> . ?x <涉及症状> <低热> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与低热以及流鼻涕症状相关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <低热> . ?x <涉及症状> <流鼻涕> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与石上疽相近且隶属于肿瘤科的疾病是什么？",
        "output": "select ?x where { ?x <科室> <肿瘤科> . ?x <同义词> <石上疽> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伴随单侧鼻腔阻塞而且词义与石上疽相近的疾病是什么？",
        "output": "select ?x where { ?x <同义词> <石上疽> . ?x <涉及症状> <单侧鼻腔阻塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与食管癌,膈症,噎膈类似，伴随精神萎靡症状的疾病是什么？",
        "output": "select ?x where { ?x <同义词> <食管癌,膈症,噎膈> . ?x <涉及症状> <精神萎靡> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与口炎以及疱疹相关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <口炎> . ?x <涉及症状> <疱疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会伴随疱疹和肌肉萎缩病症的发生？",
        "output": "select ?x where { ?x <涉及症状> <疱疹> . ?x <涉及症状> <肌肉萎缩> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现肌肉萎缩和水肿伴呼吸困难、紫绀可能与什么疾病相关？",
        "output": "select ?x where { ?x <涉及症状> <肌肉萎缩> . ?x <涉及症状> <水肿伴呼吸困难、紫绀> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些疾病会涉及水肿伴呼吸困难、紫绀和腿脚浮肿的症状？",
        "output": "select ?x where { ?x <涉及症状> <水肿伴呼吸困难、紫绀> . ?x <涉及症状> <腿脚浮肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与腿脚浮肿和端坐呼吸症状相关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <腿脚浮肿> . ?x <涉及症状> <端坐呼吸> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及端坐呼吸和下肢水肿的症状？",
        "output": "select ?x where { ?x <涉及症状> <端坐呼吸> . ?x <涉及症状> <下肢水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会与浑身忽冷忽热、少尿症状有关？",
        "output": "select ?x where { ?x <涉及症状> <浑身忽冷忽热> . ?x <涉及症状> <少尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现少尿和日渐消瘦症状可能与什么疾病有关？",
        "output": "select ?x where { ?x <涉及症状> <少尿> . ?x <涉及症状> <消瘦> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "涉及到声门水肿症状，而且有蠕动感是什么病？",
        "output": "select ?x where { ?x <涉及症状> <声门水肿> . ?x <涉及症状> <蠕动感> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些疾病的涉及症状包括蠕动感和肝肿大？",
        "output": "select ?x where { ?x <涉及症状> <蠕动感> . ?x <涉及症状> <肝肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与肝肿大和低蛋白血症相关的疾病有什么？",
        "output": "select ?x where { ?x <涉及症状> <肝肿大> . ?x <涉及症状> <低蛋白血症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者有低蛋白血症以及溃疡的症状，是属于什么病？",
        "output": "select ?x where { ?x <涉及症状> <低蛋白血症> . ?x <涉及症状> <溃疡> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及到溃疡和耳内流脓的症状？",
        "output": "select ?x where { ?x <涉及症状> <溃疡> . ?x <涉及症状> <耳内流脓> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现听力减退以及伴有氮质血症是什么病？",
        "output": "select ?x where { ?x <涉及症状> <听力减退> . ?x <涉及症状> <氮质血症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当出现氮质血症和下肢肿胀和乏力病症与什么病有关？",
        "output": "select ?x where { ?x <涉及症状> <氮质血症> . ?x <涉及症状> <下肢肿胀和乏力> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些疾病的涉及症状包括下肢弥漫性水肿和呼吸道阻塞？",
        "output": "select ?x where { ?x <涉及症状> <下肢弥漫性水肿> . ?x <涉及症状> <呼吸道阻塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现呼吸道阻塞以及呼吸道狭窄的病症是与哪种疾病有关？",
        "output": "select ?x where { ?x <涉及症状> <呼吸道阻塞> . ?x <涉及症状> <呼吸道狭窄> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的病会与呼吸道狭窄、口腔痛有关？",
        "output": "select ?x where { ?x <涉及症状> <呼吸道狭窄> . ?x <涉及症状> <口腔痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感到口腔痛且腹痛伴恶心、呕吐是与哪种疾病相关？",
        "output": "select ?x where { ?x <涉及症状> <口腔痛> . ?x <涉及症状> <腹痛伴恶心、呕吐> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与肺血栓栓塞症词义相近，而且涉及到动脉血氧分压检查的疾病是什么？",
        "output": "select ?x where { ?x <同义词> <肺血栓栓塞症> . ?x <涉及检查> <动脉血氧分压> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "隶属于泌尿外科又与泌尿系感染词义相当的疾病是什么？",
        "output": "select ?x where { ?x <科室> <泌尿外科> . ?x <同义词> <泌尿系感染> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与烂喉丹痧同义且涉及到发热伴有皮疹的症状的疾病是什么？",
        "output": "select ?x where { ?x <同义词> <烂喉丹痧> . ?x <涉及症状> <发热伴有皮疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "涉及到发热伴有皮疹和声音嘶哑病症的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <发热伴有皮疹> . ?x <涉及症状> <声音嘶哑> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与德国麻疹同义，隶属于感染科的疾病是什么？",
        "output": "select ?x where { ?x <科室> <感染科> . ?x <同义词> <德国麻疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现面色青紫而且指甲中央部分隆起与怎样的疾病有关？",
        "output": "select ?x where { ?x <涉及症状> <面色青紫> . ?x <涉及症状> <指甲中央部分隆起> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了什么病会出现指甲中央部分隆起以及CO2潴留？",
        "output": "select ?x where { ?x <涉及症状> <指甲中央部分隆起> . ?x <涉及症状> <CO2潴留> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的疾病会涉及CO2潴留以及持续性弛张热症状？",
        "output": "select ?x where { ?x <涉及症状> <CO2潴留> . ?x <涉及症状> <持续性弛张热> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过接触传播，就诊于皮肤科的相关疾病有什么？",
        "output": "select ?x where { ?x <传播途径> <接触传播> . ?x <就诊科室> <皮肤科> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病会出现淋巴结肿大症状，还需要涉及淋巴细胞计数检查？",
        "output": "select ?x where { ?x <涉及检查> <淋巴细胞计数> . ?x <涉及症状> <淋巴结肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与淋巴结肿大和HIV感染病症相关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <淋巴结肿大> . ?x <涉及症状> <HIV感染> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么样的疾病会涉及到HIV感染和脾肿大的症状？",
        "output": "select ?x where { ?x <涉及症状> <HIV感染> . ?x <涉及症状> <脾肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病会与心力衰竭和肾源性水肿相关？",
        "output": "select ?x where { ?x <涉及症状> <心力衰竭> . ?x <涉及症状> <肾源性水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "涉及到肾源性水肿而且抑郁的症状的疾病叫什么？",
        "output": "select ?x where { ?x <涉及症状> <肾源性水肿> . ?x <涉及症状> <抑郁> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病会与心源性呼吸困难以及低蛋白血症有关？",
        "output": "select ?x where { ?x <涉及症状> <心源性呼吸困难> . ?x <涉及症状> <低蛋白血症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现低蛋白血症和不明原因发热现象，是什么疾病所致？",
        "output": "select ?x where { ?x <涉及症状> <低蛋白血症> . ?x <涉及症状> <不明原因发热> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可能与不明原因发热、免疫缺陷相关的病是什么？",
        "output": "select ?x where { ?x <涉及症状> <不明原因发热> . ?x <涉及症状> <免疫缺陷> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现支气管痉挛以及吞咽痛症状时是什么疾病？",
        "output": "select ?x where { ?x <涉及症状> <支气管痉挛> . ?x <涉及症状> <吞咽痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及到吞咽痛和无力的症状？",
        "output": "select ?x where { ?x <涉及症状> <吞咽痛> . ?x <涉及症状> <无力> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当出现无力和畏寒可能是什么疾病？",
        "output": "select ?x where { ?x <涉及症状> <无力> . ?x <涉及症状> <畏寒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与畏寒、鼻粘膜肿胀症状有关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <畏寒> . ?x <涉及症状> <鼻粘膜肿胀> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病会涉及到鼻粘膜肿胀和流鼻涕的症状？",
        "output": "select ?x where { ?x <涉及症状> <鼻粘膜肿胀> . ?x <涉及症状> <流鼻涕> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可能与单侧鼻腔阻塞和鼻塞及反射性头痛症状有关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <单侧鼻腔阻塞> . ?x <涉及症状> <鼻塞及反射性头痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病患出现鼻塞及反射性头痛和阵发性鼻塞会与哪种疾病有关？",
        "output": "select ?x where { ?x <涉及症状> <鼻塞及反射性头痛> . ?x <涉及症状> <阵发性鼻塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阵发性鼻塞和耳闷症状与怎样的疾病相关？",
        "output": "select ?x where { ?x <涉及症状> <阵发性鼻塞> . ?x <涉及症状> <耳闷> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病可能与耳闷、乏力等症状有关？",
        "output": "select ?x where { ?x <涉及症状> <耳闷> . ?x <涉及症状> <乏力> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与乏力、侧卧时位于下侧鼻腔出现鼻塞相关的疾病叫什么？",
        "output": "select ?x where { ?x <涉及症状> <乏力> . ?x <涉及症状> <侧卧时位于下侧鼻腔出现鼻塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者侧卧时位于下侧鼻腔出现鼻塞以及咽部充血可能与哪种疾病有关？",
        "output": "select ?x where { ?x <涉及症状> <侧卧时位于下侧鼻腔出现鼻塞> . ?x <涉及症状> <咽部充血> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么疾病会涉及到咽部充血和鼻痒症状？",
        "output": "select ?x where { ?x <涉及症状> <咽部充血> . ?x <涉及症状> <鼻痒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现鼻痒、打喷嚏等症状是与哪个疾病有关系？",
        "output": "select ?x where { ?x <涉及症状> <鼻痒> . ?x <涉及症状> <打喷嚏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "涉及到一过性肉眼血尿和张口呼吸病症反应与什么疾病相关？",
        "output": "select ?x where { ?x <涉及症状> <一过性肉眼血尿> . ?x <涉及症状> <张口呼吸> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病会涉及到张口呼吸和恶寒的症状？",
        "output": "select ?x where { ?x <涉及症状> <张口呼吸> . ?x <涉及症状> <恶寒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与恶寒、舌苔薄白症状相关的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <恶寒> . ?x <涉及症状> <舌苔薄白> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现舌苔薄白以及咽部溃疡症状时，这是什么疾病？",
        "output": "select ?x where { ?x <涉及症状> <舌苔薄白> . ?x <涉及症状> <咽部溃疡> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会与咽部溃疡以及鼻衄症状有关？",
        "output": "select ?x where { ?x <涉及症状> <咽部溃疡> . ?x <涉及症状> <鼻衄> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些疾病会涉及到鼻衄和血糖升高的症状？",
        "output": "select ?x where { ?x <涉及症状> <鼻衄> . ?x <涉及症状> <血糖升高> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现气喘以及反复感冒可能与什么疾病有关？",
        "output": "select ?x where { ?x <涉及症状> <反复感冒> . ?x <涉及症状> <气喘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与过敏性炎症性皮肤病、湿疮同义，且会伴随皮肤发红症状的疾病是什么？",
        "output": "select ?x where { ?x <同义词> <过敏性炎症性皮肤病,湿疮> . ?x <涉及症状> <皮肤发红> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "隶属于皮肤性病科，而且与过敏性炎症性皮肤病,湿疮同义的疾病叫什么？",
        "output": "select ?x where { ?x <科室> <皮肤性病科> . ?x <同义词> <过敏性炎症性皮肤病,湿疮> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病与阻塞性肺气肿同义，而且涉及到检查PaO2？",
        "output": "select ?x where { ?x <同义词> <阻塞性肺气肿> . ?x <涉及检查> <PaO2> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病会涉及到皮肤发红和发热伴有皮疹的症状？",
        "output": "select ?x where { ?x <涉及症状> <皮肤发红> . ?x <涉及症状> <发热伴有皮疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现耳廓癣以及鼻痒可能是什么疾病？",
        "output": "select ?x where { ?x <涉及症状> <耳廓癣> . ?x <涉及症状> <鼻痒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的疾病会与鼻痒以及口唇发绀症状相关？",
        "output": "select ?x where { ?x <涉及症状> <鼻痒> . ?x <涉及症状> <口唇发绀> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "是什么样的病会出现口唇发绀和玫瑰疹的症状表现？",
        "output": "select ?x where { ?x <涉及症状> <口唇发绀> . ?x <涉及症状> <玫瑰疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种疾病是属于感染科而且是通过飞沫传播的？",
        "output": "select ?x where { ?x <传播途径> <飞沫传播> . ?x <科室> <感染科> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "涉及到发炎和发热伴有皮疹等症状的疾病是什么？",
        "output": "select ?x where { ?x <涉及症状> <发炎> . ?x <涉及症状> <发热伴有皮疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会与声音嘶哑和发热伴眼睛充血有关？",
        "output": "select ?x where { ?x <涉及症状> <声音嘶哑> . ?x <涉及症状> <发热伴眼睛充血> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现水泡和声门水肿的症状表现可能是什么病？",
        "output": "select ?x where { ?x <涉及症状> <水泡> . ?x <涉及症状> <声门水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在出现局部压痛以及耳廓红肿的情况下，会是怎样的病？",
        "output": "select ?x where { ?x <涉及症状> <局部压痛> . ?x <涉及症状> <耳廓红肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种类型的疾病会与氮质血症以及局部压痛有关联？",
        "output": "select ?x where { ?x <涉及症状> <氮质血症> . ?x <涉及症状> <局部压痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及到局部压痛和耳廓红肿这些病症？",
        "output": "select ?x where { ?x <涉及症状> <局部压痛> . ?x <涉及症状> <耳廓红肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有慢性非特异性溃疡性结肠炎,结肠炎以及衰弱这些症状是得了什么病？",
        "output": "select ?x where { ?x <同义词> <慢性非特异性溃疡性结肠炎,结肠炎> . ?x <涉及症状> <衰弱> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现衰弱以及里急后重症状表现会涉及到哪种疾病？",
        "output": "select ?x where { ?x <涉及症状> <衰弱> . ?x <涉及症状> <里急后重> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者呈现里急后重以及右下腹痛伴呕吐等表现会触及到哪种疾病？",
        "output": "select ?x where { ?x <涉及症状> <里急后重> . ?x <涉及症状> <右下腹痛伴呕吐> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种类型的疾病会与右下腹痛伴呕吐以及腹痛伴腹泻有关联？",
        "output": "select ?x where { ?x <涉及症状> <右下腹痛伴呕吐> . ?x <涉及症状> <腹痛伴腹泻> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会涉及到咳嗽伴呼吸困难以及哮鸣音的症状？",
        "output": "select ?x where { ?x <涉及症状> <咳嗽伴呼吸困难> . ?x <涉及症状> <哮鸣音> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么类型的疾病会与浑身忽冷忽热和失音的症状有关系？",
        "output": "select ?x where { ?x <涉及症状> <浑身忽冷忽热> . ?x <涉及症状> <失音> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种病会触及到失音以及干性咳嗽的病症？",
        "output": "select ?x where { ?x <涉及症状> <失音> . ?x <涉及症状> <干性咳嗽> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个病有可能涉及到口炎和发热的症状？",
        "output": "select ?x where { ?x <涉及症状> <口炎> . ?x <涉及症状> <发热> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "先天性肺动静脉瘘、老年人急性呼吸窘迫综合征以及肝肺综合征患者应该做哪项检查比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <先天性肺动静脉瘘> . ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . ?x <涉及疾病> <肝肺综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查能检测出老年人急性呼吸窘迫综合征、肝肺综合征和急性呼吸衰竭？",
        "output": "select ?x where { ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . ?x <涉及疾病> <肝肺综合征> . ?x <涉及疾病> <急性呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对检测肝肺综合征、急性呼吸衰竭和支气管扩张症比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <肝肺综合征> . ?x <涉及疾病> <急性呼吸衰竭> . ?x <涉及疾病> <支气管扩张症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一种能检测急性呼吸衰竭、支气管扩张症和急性高原病？",
        "output": "select ?x where { ?x <涉及疾病> <急性呼吸衰竭> . ?x <涉及疾病> <支气管扩张症> . ?x <涉及疾病> <急性高原病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在检查项目中，哪一项能检测急性高原病、新生儿硬皮症和迁延性肺嗜酸粒细胞浸润症？",
        "output": "select ?x where { ?x <涉及疾病> <急性高原病> . ?x <涉及疾病> <新生儿硬皮症> . ?x <涉及疾病> <迁延性肺嗜酸粒细胞浸润症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以检测出新生儿硬皮症、迁延性肺嗜酸粒细胞浸润症和动脉粥样硬化这些疾病的检查是什么？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿硬皮症> . ?x <涉及疾病> <迁延性肺嗜酸粒细胞浸润症> . ?x <涉及疾病> <动脉粥样硬化> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项医学检查能检测动脉粥样硬化、急性高山病和原发性纤毛运动障碍？",
        "output": "select ?x where { ?x <涉及疾病> <动脉粥样硬化> . ?x <涉及疾病> <急性高山病> . ?x <涉及疾病> <原发性纤毛运动障碍> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有急性高山病、原发性纤毛运动障碍和新生儿肺气漏，可以去做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <急性高山病> . ?x <涉及疾病> <原发性纤毛运动障碍> . ?x <涉及疾病> <新生儿肺气漏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "能检测出原发性纤毛运动障碍、新生儿肺气漏和肺栓塞疾病的检查项目是什么？",
        "output": "select ?x where { ?x <涉及疾病> <原发性纤毛运动障碍> . ?x <涉及疾病> <新生儿肺气漏> . ?x <涉及疾病> <肺栓塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查能有效检测新生儿肺气漏、肺栓塞和肺血栓栓塞症？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿肺气漏> . ?x <涉及疾病> <肺栓塞> . ?x <涉及疾病> <肺血栓栓塞症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查能对肺栓塞、肺血栓栓塞症和慢性呼衰做出有效检测？",
        "output": "select ?x where { ?x <涉及疾病> <肺栓塞> . ?x <涉及疾病> <肺血栓栓塞症> . ?x <涉及疾病> <慢性呼衰> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项医学检查能检测出慢性呼衰、脐带打结和小儿肺水肿？",
        "output": "select ?x where { ?x <涉及疾病> <慢性呼衰> . ?x <涉及疾病> <脐带打结> . ?x <涉及疾病> <小儿肺水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以检测脐带打结、小儿肺水肿和急性肾功能不全的检查项目有什么？",
        "output": "select ?x where { ?x <涉及疾病> <脐带打结> . ?x <涉及疾病> <小儿肺水肿> . ?x <涉及疾病> <急性肾功能不全> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪样的医学检查能检测小儿肺水肿、急性肾功能不全和放射性肺炎？",
        "output": "select ?x where { ?x <涉及疾病> <小儿肺水肿> . ?x <涉及疾病> <急性肾功能不全> . ?x <涉及疾病> <放射性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了急性肾功能不全、放射性肺炎和肺泡蛋白沉积症，应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <急性肾功能不全> . ?x <涉及疾病> <放射性肺炎> . ?x <涉及疾病> <肺泡蛋白沉积症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对放射性肺炎、肺泡蛋白沉积症和HIV相关呼吸道感染疾病有比较有效的检测？",
        "output": "select ?x where { ?x <涉及疾病> <放射性肺炎> . ?x <涉及疾病> <肺泡蛋白沉积症> . ?x <涉及疾病> <HIV相关呼吸道感染> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查可以对肺泡蛋白沉积症、HIV相关呼吸道感染和动静脉瘘做出检测？",
        "output": "select ?x where { ?x <涉及疾病> <肺泡蛋白沉积症> . ?x <涉及疾病> <HIV相关呼吸道感染> . ?x <涉及疾病> <动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "能检测HIV相关呼吸道感染和动静脉瘘、新生儿中枢性呼吸暂停综合征的检查项目有什么？",
        "output": "select ?x where { ?x <涉及疾病> <HIV相关呼吸道感染> . ?x <涉及疾病> <动静脉瘘> . ?x <涉及疾病> <新生儿中枢性呼吸暂停综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查能检测出动静脉瘘、新生儿中枢性呼吸暂停综合征和小儿肥胖通气不良综合征？",
        "output": "select ?x where { ?x <涉及疾病> <动静脉瘘> . ?x <涉及疾病> <新生儿中枢性呼吸暂停综合征> . ?x <涉及疾病> <小儿肥胖通气不良综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有新生儿中枢性呼吸暂停综合、小儿肥胖通气不良综合征和五氯酚钠中毒，应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿中枢性呼吸暂停综合征> . ?x <涉及疾病> <小儿肥胖通气不良综合征> . ?x <涉及疾病> <五氯酚钠中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目可以检测到小儿肥胖通气不良综合征、五氯酚钠中毒和新生儿体温过低？",
        "output": "select ?x where { ?x <涉及疾病> <小儿肥胖通气不良综合征> . ?x <涉及疾病> <五氯酚钠中毒> . ?x <涉及疾病> <新生儿体温过低> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查可以对五氯酚钠中毒、新生儿体温过低以及先天性胸腹裂孔疝做出有效检查？",
        "output": "select ?x where { ?x <涉及疾病> <五氯酚钠中毒> . ?x <涉及疾病> <新生儿体温过低> . ?x <涉及疾病> <先天性胸腹裂孔疝> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "做哪一项检查项目能有效检测休克型肺炎、光气中毒和慢性呼吸衰竭？",
        "output": "select ?x where { ?x <涉及疾病> <休克型肺炎> . ?x <涉及疾病> <光气中毒> . ?x <涉及疾病> <慢性呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有光气中毒、慢性呼吸衰竭以及肺气肿时，需要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <光气中毒> . ?x <涉及疾病> <慢性呼吸衰竭> . ?x <涉及疾病> <肺气肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目能对慢性呼吸衰竭、肺气肿和妊娠合并肺栓塞做出有效检测？",
        "output": "select ?x where { ?x <涉及疾病> <慢性呼吸衰竭> . ?x <涉及疾病> <肺气肿> . ?x <涉及疾病> <妊娠合并肺栓塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对于检测肺气肿、妊娠合并肺栓塞和老年人急性呼吸窘迫综合征比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <肺气肿> . ?x <涉及疾病> <妊娠合并肺栓塞> . ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了妊娠合并肺栓塞、老年人急性呼吸窘迫综合征和急性呼吸衰竭这些疾病时要通过哪项检查检测病情？",
        "output": "select ?x where { ?x <涉及疾病> <妊娠合并肺栓塞> . ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . ?x <涉及疾病> <急性呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项医学检查对检测老年人急性呼吸窘迫综合征、急性呼吸衰竭和急性高原病有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . ?x <涉及疾病> <急性呼吸衰竭> . ?x <涉及疾病> <急性高原病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查项目中，哪一种可以检测疾病包括迁延性肺嗜酸粒细胞浸润症、新生儿肺气漏和肺栓塞？",
        "output": "select ?x where { ?x <涉及疾病> <迁延性肺嗜酸粒细胞浸润症> . ?x <涉及疾病> <新生儿肺气漏> . ?x <涉及疾病> <肺栓塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于肺栓塞、脐带打结和小儿肺水肿患者，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <肺栓塞> . ?x <涉及疾病> <脐带打结> . ?x <涉及疾病> <小儿肺水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "要检查出脐带打结、小儿肺水肿和放射性肺炎这些病情，可以做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <脐带打结> . ?x <涉及疾病> <小儿肺水肿> . ?x <涉及疾病> <放射性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过怎样的检查可以检测小儿肺水肿、放射性肺炎和动静脉瘘？",
        "output": "select ?x where { ?x <涉及疾病> <小儿肺水肿> . ?x <涉及疾病> <放射性肺炎> . ?x <涉及疾病> <动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在涉及到放射性肺炎、动静脉瘘和小儿肥胖通气不良综合征这些病时应该做哪种检查？",
        "output": "select ?x where { ?x <涉及疾病> <放射性肺炎> . ?x <涉及疾病> <动静脉瘘> . ?x <涉及疾病> <小儿肥胖通气不良综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有动静脉瘘、小儿肥胖通气不良综合征和五氯酚钠中毒要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <动静脉瘘> . ?x <涉及疾病> <小儿肥胖通气不良综合征> . ?x <涉及疾病> <五氯酚钠中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查对检测小儿肥胖通气不良综合征、五氯酚钠中毒和新生儿晚期代谢性酸中毒有效？",
        "output": "select ?x where { ?x <涉及疾病> <小儿肥胖通气不良综合征> . ?x <涉及疾病> <五氯酚钠中毒> . ?x <涉及疾病> <新生儿晚期代谢性酸中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了五氯酚钠中毒、新生儿晚期代谢性酸中毒和新生儿低体温，通过怎样的检查能得到检测？",
        "output": "select ?x where { ?x <涉及疾病> <五氯酚钠中毒> . ?x <涉及疾病> <新生儿晚期代谢性酸中毒> . ?x <涉及疾病> <新生儿低体温> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查能检测出新生儿晚期代谢性酸中毒、新生儿低体温和百草枯中毒？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿晚期代谢性酸中毒> . ?x <涉及疾病> <新生儿低体温> . ?x <涉及疾病> <百草枯中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在肺功能检查中，哪项检查能对氧分压低症状以及严重急性呼吸综合征做出检测？",
        "output": "select ?x where { ?x <类型> <肺功能检查> . ?x <涉及症状> <氧分压低> . ?x <涉及疾病> <严重急性呼吸综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在伴随氧分压低症状且患有严重急性呼吸综合征和汉坦病毒肺综合征时，是哪一项检查能检测病情？",
        "output": "select ?x where { ?x <涉及症状> <氧分压低> . ?x <涉及疾病> <严重急性呼吸综合征> . ?x <涉及疾病> <汉坦病毒肺综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了严重急性呼吸综合征、汉坦病毒肺综合征和沙雷菌肺炎这些疾病时，通过什么检查对病情有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <严重急性呼吸综合征> . ?x <涉及疾病> <汉坦病毒肺综合征> . ?x <涉及疾病> <沙雷菌肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查能有效检测汉坦病毒肺综合征、沙雷菌肺炎和肺组织细胞增生症？",
        "output": "select ?x where { ?x <涉及疾病> <汉坦病毒肺综合征> . ?x <涉及疾病> <沙雷菌肺炎> . ?x <涉及疾病> <肺组织细胞增生症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有沙雷菌肺炎、肺组织细胞增生症和急性呼吸窘迫综合症，应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <沙雷菌肺炎> . ?x <涉及疾病> <肺组织细胞增生症> . ?x <涉及疾病> <急性呼吸窘迫综合症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于肺组织细胞增生症、急性呼吸窘迫综合症和新生儿呼吸窘迫综合征患者，需要做哪项检查对病情有用？",
        "output": "select ?x where { ?x <涉及疾病> <肺组织细胞增生症> . ?x <涉及疾病> <急性呼吸窘迫综合症> . ?x <涉及疾病> <新生儿呼吸窘迫综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查可以检测急性呼吸窘迫综合症、新生儿呼吸窘迫综合征和新生儿窒息？",
        "output": "select ?x where { ?x <涉及疾病> <急性呼吸窘迫综合症> . ?x <涉及疾病> <新生儿呼吸窘迫综合征> . ?x <涉及疾病> <新生儿窒息> . }"
    }
]