[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽晶酒店内有鲜花店吗？",
        "output": "select ?x where { <北京丽晶酒店> <是否有鲜花店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "镇江富力喜来登酒店提供擦鞋服务么？",
        "output": "select ?x where { <镇江富力喜来登酒店> <是否有擦鞋服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆附近5公里的景点有哪些？",
        "output": "select ?y where { <广州失恋博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5) ?y <城市> <广州>. ?y <类型> <景点>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "4A的湖南省博物馆参观几个小时合适？",
        "output": "select ?x where { <湖南省博物馆> <景点的等级A> \"4A\" . <湖南省博物馆> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南护城河的详细地址是哪？",
        "output": "select ?x where { <济南护城河> <城市> <济南> . <济南护城河> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在北京，并且距离中奥马哥孛罗大酒店5公里以内的景点有哪些？",
        "output": "select ?y where { <北京中奥马哥孛罗大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛台东幻光之城星空艺术馆旗舰店的建议游玩时长？",
        "output": "select ?x where { <青岛幻光之城星空艺术馆（台东旗舰店）> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚有哪些品牌为阳光酒店的酒店？",
        "output": "select ?x where { ?x <城市> <三亚> . ?x <酒店品牌名称> <阳光酒店> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的凤凰中心有什么优惠信息？",
        "output": "select ?x where { <凤凰中心> <城市> <北京> . <凤凰中心> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园附近5公里的酒店的平均价格是多少",
        "output": "select (avg(?x) as ?avg_x) where { <景山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance < 5.0) ?y <平均价格> ?x. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅溪湖国际文化艺术中心的流动的永恒展多少钱？",
        "output": "select ?x where { <梅溪湖国际文化艺术中心艺术馆《流动的永恒》展> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀纳斯景区在哪？",
        "output": "select ?x where { <喀纳斯景区> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五缘湾万嘀帆船出海俱乐部在哪所城市？",
        "output": "select ?x where { <五缘湾万嘀帆船出海俱乐部> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛海尔洲际酒店附近2公里的酒店都有哪些？",
        "output": "select ?y where { <青岛海尔洲际酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <青岛>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么时候去5A级的天坛公园游玩最合适？",
        "output": "select ?x where { <天坛公园> <景点的等级A> \"5A\" . <天坛公园> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "观看喀纳斯景区中的喀纳斯湖有什么限制条件吗？",
        "output": "select ?x where { <喀纳斯景区> <娱乐项目名称> <喀纳斯湖>. <喀纳斯湖> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从北京华侨大厦忙完，然后到国宾酒店办理住宿，请问这两地距离多远？",
        "output": "select ?t where { <北京华侨大厦> <附近> ?cvt. ?cvt <实体名称> <北京国宾酒店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舟山都有哪些喜来登的酒店？",
        "output": "select ?x where { ?x <城市> <舟山> . ?x <酒店品牌名称> <喜来登> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "桂林有哪些喜来登的酒店？",
        "output": "select ?x where { ?x <城市> <桂林> . ?x <酒店品牌名称> <喜来登> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金茂北京威斯汀大饭店和北京长城饭店相隔几千米？",
        "output": "select ?t where { <金茂北京威斯汀大饭店> <附近> ?cvt. ?cvt <实体名称> <北京长城饭店（原北京喜来登长城饭店）>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "烟台金海湾酒店内有游戏室吗？",
        "output": "select ?x where { <烟台金海湾酒店> <是否有游戏室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什市有哪些5A级景点？",
        "output": "select ?x where { ?x <城市> <喀什市> . ?x <景点的等级A> \"5A\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州吴宫泛太平洋酒店的联系方式是多少？",
        "output": "select ?x where { <苏州吴宫泛太平洋酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连凯宾斯基饭店能打台球吗？",
        "output": "select ?x where { <大连凯宾斯基饭店> <是否有桌球室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在南京,品牌为维景国际的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <南京> . ?x <酒店品牌名称> <维景国际> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院玩多久合适？",
        "output": "select ?x where { <国家大剧院> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么节气适合游玩北京的景山公园？",
        "output": "select ?x where { <景山公园> <城市> <北京> . <景山公园> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无锡太湖饭店内有温泉吗？",
        "output": "select ?x where { <无锡太湖饭店> <是否有温泉> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长春开元名都酒店有哪些？",
        "output": "select ?x where { ?x <城市> <长春> . ?x <酒店品牌名称> <开元名都> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园附近哪个酒店可以办婚宴？",
        "output": "select ?y where { <景山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有婚宴服务> <提供婚宴服务,可能收费>. ?y <类型> <酒店> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波南苑饭店附近5公里的景点包括哪些？",
        "output": "select ?y where { <宁波南苑饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> \"5\"^^<http://www.w3.org/2001/XMLSchema#float>. ?y <城市> <宁波>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "森泊幻想岛的详细地址？",
        "output": "select ?x where { <森泊幻想岛> <是否免费> \"全年收费\" . <森泊幻想岛> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连泰达柏爵酒店附近五公里的酒店还有哪些？",
        "output": "select ?y where { <大连泰达柏爵酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <大连>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在城市慈溪酒店品牌为达蓬山大酒店的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <慈溪> . ?x <酒店品牌名称> <达蓬山大酒店> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园人均平均多少钱？",
        "output": "select ?x where {  <北海公园> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩有导游服务吗？",
        "output": "select ?x where { <外滩> <是否有导游服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在重庆，且在喜来登大酒店附近5km都有什么景点？",
        "output": "select ?y where { <重庆喜来登大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <重庆>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园附近的交通路线信息是什么？可以推荐一下吗？",
        "output": "select ?x where { <景山公园> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海办婚宴可以去哪些酒店",
        "output": "select ?x where { ?x <城市> <上海>. ?x <是否有婚宴服务> <提供婚宴服务,可能收费>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "简短描述一下西湖风景名胜区（西湖）中的范公亭？",
        "output": "select ?x where { <西湖风景名胜区（西湖）> <娱乐项目名称> <范公亭>. <范公亭> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳恒丰海悦国际酒店的就餐时间是几点？",
        "output": "select ?x where { <深圳恒丰海悦国际酒店> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在北海公园游玩之后，准备入住日坛宾馆，得骑行多远呀？",
        "output": "select ?t where { <北海公园> <附近> ?cvt. ?cvt <实体名称> <日坛宾馆>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院附近有哪些带健身房的酒店",
        "output": "select ?x where { <国家大剧院> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <是否有健身房> <有健身房>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津海河附近5公里的景点包括哪些？",
        "output": "select ?y where { <海河> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <天津>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园的详细地址在哪？",
        "output": "select ?x where { <景山公园> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州有几家君澜旗下的酒店？",
        "output": "select ?x where { ?x <城市> <杭州> . ?x <酒店品牌名称> <君澜> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "5D流星雨古装星空馆（东城店）的营业时间是什么时候？",
        "output": "select ?x where { <5D流星雨古装星空馆（东城店）> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京爱情博物展（新街口总店）是免费的吗？",
        "output": "select ?x where { <南京爱情博物展（新街口总店）> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天河城的天津梵高星空艺术馆平均价格是多少？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "去宝石山的交通路线有什么推荐的吗？",
        "output": "select ?x where { <宝石山> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中奥马哥孛罗大酒店附近五公里有什么景点？",
        "output": "select ?y where { <北京中奥马哥孛罗大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉的梵高星空美术馆要多少钱？",
        "output": "select ?x where { <梵高星空美术馆（江汉路旗舰店）> <城市> <武汉> . <梵高星空美术馆（江汉路旗舰店）> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连哪些酒店有特级双床房",
        "output": "select ?x where { ?x <房型名称> <特级双床房>. ?x <城市> <大连>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学艺术博物馆距离神玉艺术馆有多少距离（km）？",
        "output": "select ?t where { <清华大学艺术博物馆> <附近> ?cvt. ?cvt <实体名称> <神玉艺术馆>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "润达奇妙萌宠乐园的门票是多少钱？",
        "output": "select ?x where { <润达奇妙萌宠乐园> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕田峪长城怎么去？",
        "output": "select ?x where { <慕田峪长城> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀纳斯的泰加林廊道什么时候营业啊？",
        "output": "select ?x where { <喀纳斯景区> <娱乐项目名称> <泰加林廊道> . <泰加林廊道> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园内可以携带自拍杆吗？",
        "output": "select ?x where { <景山公园> <是否有携带自拍杆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宏源国际饭店一顿饭平均多少钱哇？",
        "output": "select ?x where { <宏源国际饭店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朋友说故宫博物院（故宫）的乾隆花园很好看，请问它是什么样的呀？",
        "output": "select ?x where { <故宫博物院（故宫）> <娱乐项目名称> <乾隆花园>. <乾隆花园> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你知道大连日航饭店下午几点可以退房吗？",
        "output": "select ?time where { <大连日航饭店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京天坛公园是什么级别的景点？",
        "output": "select ?x where { <天坛公园> <城市> <北京> . <天坛公园> <景点的等级A> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园中的东宫门是什么？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <东宫门>. <东宫门> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京励骏酒店附近可以帮寄存书包的景点",
        "output": "select ?y  where { <北京励骏酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有行李寄存> <有免费行李寄存>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆华地王朝大酒店（大足店）内有图书馆吗？",
        "output": "select ?x where { <重庆华地王朝大酒店（大足店）> <是否有图书馆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在黄山, 且距离香茗酒店附近2公里的酒店有哪些？",
        "output": "select ?y where { <黄山香茗酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <黄山>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连梵高梦境星空馆周末开门吗？",
        "output": "select ?x where { <大连梵高梦境星空馆> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住重庆维景国际大酒店要多少钱？",
        "output": "select ?x where { <重庆维景国际大酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在布尔津县的喀纳斯景区的详细地址是多少？",
        "output": "select ?x where { <喀纳斯景区> <城市> <布尔津县> . <喀纳斯景区> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚银泰阳光度假酒店的电话是多少？",
        "output": "select ?x where { <三亚银泰阳光度假酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园周围哪个酒店可以打台球？",
        "output": "select ?y where { <北海公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有桌球室> <有台球室>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孤山公园内有wifi服务那？",
        "output": "select ?x where { <孤山公园> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金狮国际酒店退房间吗？",
        "output": "select ?time where { <金狮国际酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京中山大酒店附近可以帮寄存行李箱的景点",
        "output": "select ?y  where { <南京中心大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有行李寄存> <有免费行李寄存>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宝石山内有商店吗？",
        "output": "select ?x where { <宝石山> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "圣德国际酒店最早几点可以入住？",
        "output": "select ?time where { <圣德国际酒店> <酒店入住开始时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肇庆市有哪些隶属于星湖大酒店的酒店？",
        "output": "select ?x where { ?x <城市> <肇庆> . ?x <酒店品牌名称> <星湖大酒店> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "佛山保利洲际酒店都有什么种类的早餐？",
        "output": "select ?x where { <佛山保利洲际酒店> <早餐类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泉州悦华酒店的早餐多少钱？",
        "output": "select ?x where { <泉州悦华酒店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有几个价格低于100的5A景点？",
        "output": "select (count(?x) as ?count_city) where {      ?x <城市> <北京>.     ?x <景点的等级A> \"5A\".     ?x <平均价格> ?price     filter(?price < 100) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张家港华芳金陵国际酒店的详细地址？",
        "output": "select ?x where { <张家港华芳金陵国际酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫珍宝馆内能抽烟吗？",
        "output": "select ?x where { <故宫珍宝馆> <是否有吸烟区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "山城步道那块的时光穿越梦幻馆什么时候营业？",
        "output": "select ?x where { <时光穿越梦幻馆（山城步道店）> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫御景亭什么样？",
        "output": "select ?x where { <故宫博物院（故宫）> <娱乐项目名称> <御景亭>. <御景亭> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京维景国际大酒店附近5公里的景点都有什么？",
        "output": "select ?y where { <南京维景国际大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <南京>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京有哪些带酒吧的酒店吗",
        "output": "select ?x where { ?x <城市> <南京>. ?x <是否有酒吧> <有酒吧>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玛依塔柯酒店内有接机服务吗？",
        "output": "select ?x where { <玛依塔柯酒店> <是否有接机服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京景山公园和天坛公园距离多远",
        "output": "select ?x where { <景山公园> <附近> ?cvt. ?cvt <实体名称> <天坛公园>. ?cvt <距离值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "想去观北海公园中的阅古楼，请问对年龄身高等有什么限制吗？",
        "output": "select ?x where { <北海公园> <娱乐项目名称> <阅古楼>. <阅古楼> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州孤山公园附近还有哪些景点（2km内吧）？",
        "output": "select ?y where { <孤山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <杭州>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洛阳东山宾馆内有停车场吗？",
        "output": "select ?x where { <洛阳东山宾馆> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京的酒店中，离绿地洲际酒店5公里内的有哪些啊？",
        "output": "select ?y where { <南京绿地洲际酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <南京>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九江有几家远洲品牌的酒店？",
        "output": "select (count(?x) as ?count_hotel ) where {  ?x <城市> <九江> . ?x <酒店品牌名称> <远洲> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑州如意湖景区的详细地址？",
        "output": "select ?x where { <如意湖景区> <城市> <郑州> . <如意湖景区> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在天津还有一百块钱，独角兽星空艺术馆附近2公里的景点还能去哪个？",
        "output": "select ?y where { <天津独角兽星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <天津>. ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 100) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都城市名人酒店的早餐价格是多少人民币？",
        "output": "select ?x where { <成都城市名人酒店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "丽江泸沽湖景区的交通信息如何？",
        "output": "select ?x where { <丽江泸沽湖景区> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京哪些景点适合玩一两个小时",
        "output": "select ?x where { ?x <城市> <北京>. ?x <建议游玩时长> \"1-2小时\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆有商店吗？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蓝月谷在哪个城市？",
        "output": "select ?x where { <玉龙雪山蓝月谷> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川岷山饭店附近5公里内有什么可以住的酒店呀？",
        "output": "select ?y where { <四川岷山饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <成都>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京天伦王朝酒店的价格？",
        "output": "select ?y where {  <北京天伦王朝酒店> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园中的玉瓮的项目对年龄身高有限制吗？",
        "output": "select ?x where { <北海公园> <娱乐项目名称> <玉瓮>. <玉瓮> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫长春宫有什么历史背景？",
        "output": "select ?x where { <故宫博物院（故宫）> <娱乐项目名称> <长春宫>. <长春宫> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津的独角兽星空艺术馆有什么优待政策？",
        "output": "select ?x where { <天津独角兽星空艺术馆> <城市> <天津> . <天津独角兽星空艺术馆> <优待政策> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恋爱博物馆什么时候营业？",
        "output": "select ?x where { <南京恋爱博物馆> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "云阳两江假日酒店的地址在哪？",
        "output": "select ?x where { <云阳两江假日酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老君顶冰雪王国内有商店吗？",
        "output": "select ?x where { <老君顶冰雪王国> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在石家庄属于河北旅投的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <石家庄> . ?x <酒店品牌名称> <河北旅投> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华晨宝马铁西工厂内有行李寄存服务吗？",
        "output": "select ?x where { <华晨宝马铁西工厂> <是否有行李寄存> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在上海，比上海日航饭店的更贵的酒店？",
        "output": "select ?x where {  <南郊宾馆> <平均价格> ?y. ?x <平均价格> ?z. ?x <城市> <上海>. ?x <类型> <酒店> filter(?y < ?z) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在之前的首都大酒店附近2000米都有什么北京的酒店？",
        "output": "select ?y where { <首都宾馆（原首都大酒店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <北京>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辽宁省博物馆的电话是多少？",
        "output": "select ?x where { <辽宁省博物馆> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京千禧大酒店附近5公里的景点包括？",
        "output": "select ?y where { <北京千禧大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆自然博物馆（新馆）中环境厅的开放时间？",
        "output": "select ?x where { <重庆自然博物馆（新馆）> <娱乐项目名称> <环境厅>. <环境厅> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区的营业时间什么时候？",
        "output": "select ?x where { <九寨沟风景区> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东莞的梵高星空艺术馆门票是多少钱？",
        "output": "select ?x where { <东莞梵高星空艺术馆> <城市> <东莞> . <东莞梵高星空艺术馆> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雍和宫法轮殿什么样子？",
        "output": "select ?x where { <雍和宫> <娱乐项目名称> <法轮殿>. <法轮殿> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "往颐和园东北方向走还有哪些景点",
        "output": "select ?x where { ?x <位于> ?cvt. ?cvt <实体名称> <颐和园>. ?cvt <方向> <东北方向>. ?x <类型> <景点> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美丽华酒店内有干洗服务吗？",
        "output": "select ?x where { <美丽华酒店> <是否有干洗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魔都星空艺术馆建议游玩多少时间？",
        "output": "select ?x where { <魔都星空艺术馆> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柯桥区有哪些君澜度假酒店？",
        "output": "select ?x where { ?x <城市> <柯桥区> . ?x <酒店品牌名称> <君澜度假> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南华天大酒店的押金是多少？",
        "output": "select ?x where { <湖南华天大酒店> <押金> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津瑞湾开元大酒店什么时候开始入住？",
        "output": "select ?time where { <天津瑞湾开元大酒店> <酒店入住开始时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融街丽思卡尔顿酒店附近五公里有哪些好玩的？",
        "output": "select ?y where { <北京金融街丽思卡尔顿酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我爱打桌球，三亚国光豪生度假酒店内有桌球室没？",
        "output": "select ?x where { <三亚国光豪生度假酒店> <是否有桌球室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京瑞吉酒店的价格？",
        "output": "select ?y where {  <北京瑞吉酒店> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "石梅湾艾美度假酒店哪些房间是独栋别墅？",
        "output": "select ?y where { <石梅湾艾美度假酒店> <房型名称> ?y. ?y <房型类别> \"独栋\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门的五缘湾万嘀帆船出海俱乐部的门票多少钱？",
        "output": "select ?x where { <五缘湾万嘀帆船出海俱乐部> <城市> <厦门> . <五缘湾万嘀帆船出海俱乐部> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长沙运达喜来登酒店附近5公里的景点都包括哪些？",
        "output": "select ?y where { <长沙运达喜来登酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <长沙>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王府半岛酒店哪些房型可以睡三个人",
        "output": "select ?x where { <王府半岛酒店> <房型名称> ?x. ?x <类型> <房型>. ?x <容纳人数> ?number. filter(?number = 3.0) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "抖青春天津站有导游服务吗？",
        "output": "select ?x where { <抖青春天津站> <是否有导游服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凤凰中心距离神玉艺术馆有多远？",
        "output": "select ?t where { <凤凰中心> <附近> ?cvt. ?cvt <实体名称> <神玉艺术馆>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雍和宫中的牌楼啥时候对外开放？",
        "output": "select ?x where { <雍和宫> <娱乐项目名称> <牌楼>. <牌楼> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魔都星空艺术馆的营业时间是什么时候?",
        "output": "select ?x where { <魔都星空艺术馆> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚天域度假酒店的价格是多少？",
        "output": "select ?y where {  <三亚天域度假酒店> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津金皇大酒店有可以发送传真的地方吗？",
        "output": "select ?x where { <天津金皇大酒店> <是否有传真> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门星空艺术馆附近有没有免费接送机的酒店啊？",
        "output": "select ?y where { <厦门星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有接机服务> <有接机服务（免费）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我准备从北京国宾酒店到北京金融街丽思卡尔顿酒店去找我同事，请问这两个地方有多远？",
        "output": "select ?t where { <北京国宾酒店> <附近> ?cvt. ?cvt <实体名称> <北京金融街丽思卡尔顿酒店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有哪些在励骏酒店附近2公里的景点？",
        "output": "select ?y where { <北京励骏酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问一下全年收费的慕田峪长城什么时候是旺季呢？",
        "output": "select ?x where { <慕田峪长城> <是否免费> \"全年收费\". <慕田峪长城> <淡季旺季> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "紫金山探险公园能玩几个小时？",
        "output": "select ?x where { <紫金山探险公园> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嘉善罗星阁君亭酒店可以玩沙子吗？",
        "output": "select ?x where { <嘉善罗星阁君亭酒店> <是否有沙滩> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魔都星空艺术馆的建议游玩时长是几个小时？",
        "output": "select ?x where { <魔都星空艺术馆> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区中树正群海景点是什么样的？",
        "output": "select ?x where { <九寨沟风景区> <娱乐项目名称> <树正群海>. <树正群海> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "价格低于100的5A景点在济南有多少个？",
        "output": "select ?x  where {      ?x <城市> <济南>.     ?x <景点的等级A> \"5A\".     ?x <平均价格> ?price     filter(?price < 100) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问南京的恋爱博物馆详细地址在哪？",
        "output": "select ?x where { <南京恋爱博物馆> <城市> <南京> . <南京恋爱博物馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院什么季节去最适合游玩？",
        "output": "select ?x where { <故宫博物院（故宫）> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "森泊幻想岛的官方门票价格是多少？",
        "output": "select ?x where { <森泊幻想岛> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国宾酒店附近哪些景点有母婴室？",
        "output": "select ?y  where { <北京国宾酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有母婴室> ?z.?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京长城饭店5公里内有什么景点可以溜溜弯？",
        "output": "select ?y where { <北京长城饭店（原北京喜来登长城饭店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住镇江国际饭店（解放路店）大酒店大概需要多少钱？",
        "output": "select ?x where { <镇江国际饭店（解放路店）> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安钟楼的梦幻星空抖乐园要票吗？",
        "output": "select ?x where { <西安梦幻星空抖乐园（钟楼旗舰店）> <城市> <西安> . <西安梦幻星空抖乐园（钟楼旗舰店）> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以简短介绍下赛里木湖风景名胜区中的富士东峙吗？",
        "output": "select ?x where { <赛里木湖风景名胜区> <娱乐项目名称> <富士东峙>. <富士东峙> <项目短描述> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京脱单便利店内有wifi服务吗？",
        "output": "select ?x where { <南京脱单便利店> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什市包含几个5A级别的景点？",
        "output": "select (count(?x) as ?count_city) where { ?x <城市> <喀什市>. ?x <类型> <景点>. ?x <景点的等级A> \"5A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本溪品牌为富虹国际饭店的酒店有哪些嘞？",
        "output": "select ?x where { ?x <城市> <本溪> . ?x <酒店品牌名称> <富虹国际饭店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京饭店有接机服务吗",
        "output": "select ?x where { <北京饭店> <是否有接机服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波凯洲皇冠假日酒店附近5公里的景点包括？",
        "output": "select ?y where { <宁波凯洲皇冠假日酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <宁波>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德钦县有几个AAAA级别的景点？",
        "output": "select (count(?x) as ?count_city) where {      ?x <城市> <德钦县>.     ?x <景点的等级A> \"4A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京长城饭店步行5公里可以到达的景点都有啥可玩的？",
        "output": "select ?y where { <北京长城饭店（原北京喜来登长城饭店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国际饭店几点开始办入住？",
        "output": "select ?time where { <北京国际饭店> <酒店入住开始时间> ?time. }"
    }
]