[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被誉为万岛之国的是哪个国家？",
        "output": "select ?x where { ?x <誉称> \"万岛之国\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "悉尼有哪些大学？",
        "output": "select ?x where {<悉尼_（澳大利亚新南威尔士州首府）> <高等学府> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中华民国首任教育总长是谁？",
        "output": "select ?x where { ?x <主要成就> \"中华民国首任教育总长\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国最早的一部诗歌总集是？",
        "output": "select ?x where { ?x <历史地位> \"中国最早的一部诗歌总集\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁废除了分封制？",
        "output": "select ?x where { ?x <主要成就> \"废除 分封制\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "建宁公主与韦小宝是什么关系？",
        "output": "select ?x where { <建宁公主_（金庸小说《鹿鼎记》人物）> ?x <韦小宝_（武侠小说《鹿鼎记》人物）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "瓦妮莎是科比的什么人？",
        "output": "select ?x ?y where { <科比·布莱恩特> ?x <瓦妮莎·布莱恩特>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "悉尼有哪些火车站？",
        "output": "select ?x where {<悉尼_（澳大利亚新南威尔士州首府）> <火车站> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪位作家的原名叫张煐？",
        "output": "select ?x where { ?x <别名> \"张煐（原名）\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁下令修建了万里长城？",
        "output": "select ?x where { ?x <主要成就> \"修建 万里长城\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁统一了度量衡？",
        "output": "select ?x where { ?x <主要成就> \"统一度量衡\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别名聂双全的是哪位元帅？",
        "output": "select ?y where { ?y <别名> \"聂双全\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第一个登上维密的亚洲模特是谁？",
        "output": "select ?x where { ?x <主要成就> \"第一个登上维密的亚洲模特\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李商隐和杜牧合称什么？",
        "output": "select ?x where { ?x <本名> \"李商隐，杜牧\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些国家使用欧元？",
        "output": "select ?x where { ?x <货币> <欧元>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海贼王里乔巴拥有什么果实的能力？",
        "output": "select ?x where { ?x <拥有者> <乔巴_（《海贼王》中的角色）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我是上班族的一员，给我推销一些东西吧？",
        "output": "select ?x where { ?x <适用人群> <上班族_（亦叫月光族）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "车辆驾驶方向和澳大利亚一样国家都有哪些？",
        "output": "select ?x where { <澳大利亚> <道路通行> ?z.?x <道路通行> ?z}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "IEEE的中文全称？",
        "output": "select ?x where { ?x <外文名> \"IEEE\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国古代最早的词典是什么？",
        "output": "select ?x where { ?x <意义> \"中国古代最早的词典\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "公开表明过对张国荣的崇拜之情的都有？",
        "output": "select ?x ?y where { ?x <偶像> <张国荣_（华语歌手、演员、音乐人）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英国导演诺兰的电影？",
        "output": "select ?x where { ?x <导演> <诺兰_（英国导演）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "化学式为\"C6H12O6\"的物质有哪些？",
        "output": "select ?x where { ?x <化学式> \"C6H12O6\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三国时期诸葛亮有什么发明？",
        "output": "select ?x where { ?x <发明者> <诸葛亮_（三国时期蜀汉丞相）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "57哪些动画或漫画描绘了忍者们的故事？",
        "output": "select ?x where { ?x <类型> <忍者_（日本特殊职业）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被誉为童话王国的是哪个国家？",
        "output": "select ?x where { ?x <国家美誉> \"童话王国\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高谭市的守护者是谁？",
        "output": "select ?x where { ?x <主要成就> \"高谭市守护者\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "邱勇现任哪所大学的校长？",
        "output": "select ?y where { ?y <现任校长> <邱勇_（清华大学校长）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青年演员张子枫有哪些作品？",
        "output": "select ?x where { ?x <主演> <张子枫>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵匡胤建立了哪个朝代？",
        "output": "select ?x where { ?x <开国皇帝> <赵匡胤_（宋朝开国皇帝）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "前身是铁道兵第三师的公司是？",
        "output": "select ?x where { ?x <前身> \"铁道兵第三师\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "六一居士是谁的别号？",
        "output": "select ?x where { ?x <别名> \"欧阳永叔、醉翁、六一居士\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵薇导演的电影有哪些？",
        "output": "select ?x where { ?x <导演> <赵薇_（中国内地女演员、歌手、导演）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁是\"四大名旦之首\"？",
        "output": "select ?x where { ?x <主要成就> \"四大名旦之首\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为冰上沙皇的是哪位运动员？",
        "output": "select ?x where { ?x <别名> \"zhenya（昵称）、小普、冰王子、普皇、冰上沙皇\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "D大调卡农是谁的代表作？",
        "output": "select ?x where { ?x <代表作品> <D大调卡农>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "田园诗派的创始人是谁？",
        "output": "select ?x where { ?x <主要成就> \"田园诗派创始人\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林徽因和梁思成是什么关系？",
        "output": "select ?x where { <林徽因_（中国建筑师、诗人、作家）> ?x <梁思成>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在道路上要靠右驾驶的国家有？",
        "output": "select ?x where { ?x <道路通行> \"靠右驾驶\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "博尔赫斯的国家首都在哪里？",
        "output": "select ?x where { <豪尔赫·路易斯·博尔赫斯_（阿根廷作家）> <出生地> ?y. ?y <首都> ?x}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乔丹的大儿子毕业于哪所大学？",
        "output": "select ?z where { <乔丹_（有飞人之称的美国著名篮球运动员）> <儿子> ?x. ?x <弟弟> ?y. ?x <毕业院校> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "创始地点为耶路撒冷的宗教有哪些主要典籍？",
        "output": "select ?p where { ?x <创始地点> ?y . ?y <中文名称> \"耶路撒冷\" . ?x <主要典籍> ?p . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2012汤姆斯杯冠军是哪一年入选国家队的",
        "output": "select ?y where { ?x <主要奖项> \"2012汤姆斯杯冠军\". ?x <入选国家队> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "实行宗法制管理中央，分封制管理地方的朝代是哪个？",
        "output": "select ?x where { ?x <政治制度> <宗法制度>. ?x <地方管理> \"分封制\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "121世纪主要关注什么问题?？",
        "output": "select ?y where { ?x <中文名> \"21世纪\" . ?x <主要关注问题> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发明显微镜的人是什么职业？",
        "output": "select ?y where { <显微镜> <发明人> ?x. ?x <职业> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汉武帝的陵墓在哪里？",
        "output": "select ?y where { <汉武帝_（汉朝皇帝）> <陵墓> ?x. ?x <地理位置> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "莫扎特的同行都有哪些？",
        "output": "select ?x where { <莫扎特_（欧洲著名古典主义音乐作曲家）> <职业> ?a. ?x <职业> ?a. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2006年6月建成的总面积1187平方公里的公园是哪个？",
        "output": "select ?x where { ?x <建立时间> \"2006-06\". ?x <总面积> \"1187平方公里\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "占地2448平方公里，人口694000的是哪个城市？",
        "output": "select ?x where { ?x <面积> \"2448平方公里\". ?x <人口> \"694000\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大是哪里毕业的？",
        "output": "select ?y where { ?x <别名> \"习大大\" . ?x <毕业院校> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三国后期一位名将曾\"偷渡阴平\"灭亡蜀国，他被封了什么爵位？",
        "output": "select ?y where { <偷渡阴平> <提出> ?x. ?x <爵位> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉斯维加斯所属州的别名是什么？",
        "output": "select ?x where { <拉斯维加斯_（美国内华达州的最大城市）> <所属地区> ?y. ?y <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "董仲舒信奉的思想流派的代表人物有谁？",
        "output": "select ?y where { <董仲舒_（西汉思想家）> <信仰> ?x. ?x <代表人物> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯的创始人中，谁的星座是天蝎座？",
        "output": "select ?x where { <腾讯> <创始人> ?x. ?x <星座> <天蝎_（黄道十二宫之一）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "印度教主神毗湿奴的坐骑的原型是什么？",
        "output": "select ?x where { <毗湿奴_（印度教主神）> <坐骑> ?y. ?y <原型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "续写《汉书》的是谁？",
        "output": "select ?x where { ?x <主要成就> \"续写\". ?x <主要成就> \"汉书\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俄罗斯的首都有多少人口？",
        "output": "select ?x where { <俄罗斯_（俄罗斯联邦）> <首都> ?y. ?y <人口> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称作\"小哥\"的歌手妻子是谁？",
        "output": "select ?y where { ?x <别名> \"小哥\". ?x <妻子> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员刘涛的丈夫是做什么的？",
        "output": "select ?z where { ?x <中文名> \"刘涛\" . ?x <丈夫> ?y . ?y <职业> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国的首都的占地面积多少？",
        "output": "select ?x where { <中华人民共和国> <首都> ?y. ?y <面积> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种凤梨属的植物喜欢光照？",
        "output": "select ?x where { ?x <日照> \"喜光照\". ?x <属> <凤梨属>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曼昆那本著名的《经济学原理》是谁翻译的？",
        "output": "select ?x where { <经济学原理_（N.格里高利·曼昆著经济学教材）> <译者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "加拿大最大城市有哪些机场？",
        "output": "select ?x where { <加拿大_（北美洲国家）> <最大城市> ?y. ?y <机场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我想了解一下咖啡的主要产地？",
        "output": "select ?y where { ?x <中文名> \"咖啡\" . ?x <主要产地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《天工开物》的作者出生在哪个朝代？",
        "output": "select ?y where { <天工开物_（中国古代科学著作）> <作者> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯的创始人中，谁是已婚的？",
        "output": "select ?x where { <腾讯> <创始人> ?x. ?x <婚姻> <已婚>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "最讨厌别人浪费食物、伤害女士的人是谁？",
        "output": "select ?x where { ?x <最讨厌的事> \"伤害女士\". ?x <最讨厌的事> \"浪费食物\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海期货交易所所在地区有机场吗？",
        "output": "select ?x where { <上海期货交易所> <地区> ?y. ?y <机场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些巴西足球运动员荣获过世界足球先生称号？",
        "output": "select ?x where { ?x <国籍> <巴西_（巴西联邦共和国）>. ?x <主要奖项> \"世界足球先生\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "犹太人领袖摩西的出生地在哪个大洲？",
        "output": "select ?y where { <摩西_（犹太人的民族领袖）> <出生地> ?x. ?x <所属洲> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "提出\"绝对指令\"的哲学家是哪个国家的人？",
        "output": "select ?y where { <绝对指令> <提出人> ?x. ?x <职业> <哲学家_（基础含义）>. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿根廷央行的职责是什么？",
        "output": "select ?x where { <阿根廷_（阿根廷共和国）> <中央银行> ?y. ?y <职责> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欧洲四大名著中哪部是莎士比亚的作品.",
        "output": "select ?x where { <欧洲四大名著> <包括> ?x. ?x <作者> <莎士比亚_（欧洲文艺复兴时期戏剧家）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影钢铁侠的主演都有哪些代表作品？",
        "output": "select ?x where { <Ironman_（美国2008年小罗伯特·唐尼主演电影）> <主演> ?y. ?y <代表作品> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出品速度与激情系列电影的公司的总部在哪里？",
        "output": "select ?x where { <速度与激情_（美国赛车动作主题系列电影）> <出品公司> ?y. ?y <总部地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京都有哪些火车站？",
        "output": "select ?y where { ?x <中文名称> \"南京\" . ?x <火车站> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小马哥的qq号码是多少？",
        "output": "select ?y where { ?x <别名> \"小马哥\". ?x <所持qq号码> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有一位华语女歌手，主演了一部文艺电影，该电影被评为香港金像奖最佳影片，请问该影片是？",
        "output": "select ?x where { ?x <主演> ?y. ?x <类型> <文艺_（汉语词语）>. ?y <职业> <歌手_（职业名称）>. ?x <主要奖项> \"香港电影金像奖最佳影片\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三星集团的手机中散热一般的手机型号有？",
        "output": "select ?x where { ?x <品牌> <三星_（三星集团）>. ?x <缺点> \"散热一般\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "代表作品有《泰山之光》的学者的出生日期是什么时候？",
        "output": "select ?x where { ?y <代表作品> <泰山之光>. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《琵琶行》的作者有什么贡献？",
        "output": "select ?y where { <琵琶行_（白居易诗作）> <作者> ?x. ?x <主要成就> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宋雪桦是在哪个地区上的大学？",
        "output": "select ?x where { <宋雪桦> <毕业院校> ?y. ?y <所属地区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "号称\"完美的搜索引擎\"的公司有多少员工？",
        "output": "select ?y where { ?x <公司口号> \"完美的搜索引擎，\". ?x <员工数> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五金中的那种金属可以用于油漆？",
        "output": "select ?y where { <五金> <五种指> ?x. ?y <中文名> ?x. ?y <应用> <油漆>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Hermès的总部在哪里？",
        "output": "select ?y where { ?x <外文名称> \"Hermès（Hermes）\". ?x <总部地点> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影美丽人生导演的妻子是哪国人？",
        "output": "select distinct ?p where { ?x <中文名> \"美丽人生\" . ?x <导演> ?y . ?y <妻子> ?z . ?z <国籍> ?p . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "詹妮弗·安妮斯顿出演了一部1994年上映的美国情景剧，这部美剧共有多少集？",
        "output": "select ?y where { ?x <主演> <詹妮弗·安妮斯顿>. ?x <上映时间> \"1994\". ?x <集数> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中华民国首任教育总长的代表作品？",
        "output": "select ?y where { ?x <主要成就> \"中华民国首任教育总长\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚玉的主要成分的化学式是什么？",
        "output": "select ?y where { <刚玉> <主要成份> ?x. ?x <化学式> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北大现任校长何时出生？",
        "output": "select ?y where { <北京大学> <现任校长> ?x. ?x <出生日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个集团的董事长现在是文坊中心学校的校长？",
        "output": "select ?x where { ?x <董事长> ?y. <文坊中心学校> <现任校长> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小说《诛仙》的主要角色有哪些法宝？",
        "output": "select ?x where { <诛仙_（萧鼎著古典仙侠小说）> <主要角色> ?y. ?y <法宝武器> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果公司的现任董事长外文名是什么？",
        "output": "select ?y where { <苹果_（苹果产品公司）> <现任董事长> ?x. ?x <外文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《路西法效应》的作者从事什么职业？",
        "output": "select ?y where { <路西法效应> <作者> ?x. ?x <职业> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蜀道难的作者祖籍在哪里？",
        "output": "select ?x where { <蜀道难_（李白作古体诗）> <作者> ?y. ?y <祖籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与刘昊然的星座相邻的有哪些星座？",
        "output": "select ?x where { <刘昊然> <星座> ?y. ?y <邻接星座> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《吉檀迦利》的作者是哪国人？",
        "output": "select distinct ?y where { ?x <代表作品> <吉檀迦利>. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "指环王拍摄地国土面积有多大？",
        "output": "select ?x where { <指环王_（英美2001-2003年彼得·杰克逊执导系列电影）> <拍摄地点> ?y.?y <国土面积> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘德华的哪部代表作的主演有蓝洁瑛？",
        "output": "select ?y where { <刘德华_（中国香港男演员、歌手、词作人）> <代表作品> ?y. ?y <主演> <蓝洁瑛>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "加拿大最高建筑的地理位置？",
        "output": "select ?x where { <加拿大_（北美洲国家）> <最高建筑> ?y. ?y <地理位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "傅雷儿子们的国籍都有什么?？",
        "output": "select ?z where { ?x <中文名> \"傅雷\" . ?x <儿子> ?y . ?y <国籍> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "施耐庵的代表作写于什么时候？",
        "output": "select ?y where { <施耐庵_（水浒传作者）> <代表作品> ?x. ?x <创作年代> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钢铁侠的大学是谁创办的？",
        "output": "select ?x where { <史塔克_（美国动漫及电影钢铁侠中的人物）> <毕业院校> ?y. ?y <创办者> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冰与火之歌的拍摄地点的官方语言是什么？",
        "output": "select ?x where { <冰与火之歌_（美国HBO电视台制作的电视剧）> <拍摄地点> ?y.?y <官方语言> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国安的主场最多能够容纳多少人？",
        "output": "select ?x where { <北京国安足球俱乐部> <主场馆> ?y. ?y <座位数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京奥运的吉祥物是谁设计的？",
        "output": "select ?x where { <2008年北京奥运会> <吉祥物> ?y. ?y <设计者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于厦门思明区，素称\"圆洲仔、钢琴岛\"的地方有哪些好吃的？",
        "output": "select ?y where { ?x <别名> \"圆洲仔、钢琴岛\". ?x <特色美食> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乌台诗案与哪位诗人有关？",
        "output": "select ?x where { <乌台诗案> <受害人> ?x. ?x <职业> <诗人_（汉语词语）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老家开封的双子座名人有谁？",
        "output": "select ?x ?y where { ?x <出生地> <开封_（河南省地级市）>. ?x <星座> <双子座_（天文学）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "味精主要成分的化学式是什么？",
        "output": "select ?y where { <味精> <成分> ?x. ?x <化学式> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古希腊悲剧《俄狄浦斯王》的作者有哪些代表作品？",
        "output": "select ?x where { <俄狄浦斯王_（古希腊悲剧）> <作者> ?y. ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "姚明念的那所初中校训是什么？",
        "output": "select ?z where { ?x <中文名> \"姚明\" . ?x <初中> ?y . ?y <校训> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《额尔古纳河右岸》的作者何时出生？",
        "output": "select ?y where { <额尔古纳河右岸> <作者> ?x. ?x <出生日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外文名为\"Volcanic rock\"的岩石的外观形状是怎样的？",
        "output": "select ?x where { ?y <外文名> \"Volcanic rock\". ?y <外观形状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由孙泽洲担任总设计师的作品所用的发射用火箭是哪个？",
        "output": "select ?x where { ?y <总设计师> <孙泽洲> . ?y <发射用火箭> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本田公司的主要车型都有什么？",
        "output": "select ?z where { ?x <公司名称> ?y . filter regex(?y, \"本田\") . ?x <主要车型> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蔡琰有什么成就？",
        "output": "select ?y where { ?x <本名> \"蔡琰\". ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "埃菲尔铁塔的设计师是什么时候去世的？",
        "output": "select ?y where { <埃菲尔铁塔_（巴黎城市地标之一）> <设计者> ?x. ?x <逝世日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "织田信长所处的乱世在哪一年结束？",
        "output": "select ?y where { <织田信长_（日本战国三杰之一，安土桃山时代的大名）> <所处时代> ?x. ?x <结束时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "windows系统的开发商的CEO是哪国人？",
        "output": "select ?x where { <Windows操作系统> <发行者> ?y. ?y <首席执行官> ?z. ?z <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《天龙八部》小说的作者是哪个民族的人？",
        "output": "select ?y where { <天龙八部_（金庸创作小说）> <作者> ?x. ?x <民族> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚洲哪个国家的时区是\"UTC+3\"？",
        "output": "select ?x where { ?x <所属洲> <亚洲>. ?x <时区> \"UTC+3\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吴君如老公拍过什么电影？",
        "output": "select ?x ?y where { <吴君如> <丈夫> ?y. ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名景点有松鹤斋的避暑山庄所属的气候类型是什么样的？",
        "output": "select ?x where { ?y <著名景点> <松鹤斋>. ?y <气候类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汽车的动力的外文名是什么？",
        "output": "select ?y where { <汽车> <动力> ?x. ?x <外文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别名为\"内江县\"的四川省某区的车牌代码是什么？",
        "output": "select ?x where { ?y <别名> \"内江县\". ?y <车牌代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过扫描将图像信息转换为数字信号的机器是什么？",
        "output": "select ?x where { ?x <方式> <扫描>. ?x <转换> \"图形或图像信息转换为数字信号\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《欢乐颂》作者的老师都有谁？",
        "output": "select ?y where { <欢乐颂_（贝多芬作品）> <谱曲> ?x. ?x <老师> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"Tsinghua University\"的位置？",
        "output": "select ?y where { ?x <英文名> \"Tsinghua University\". ?x <学校地址> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "具有哲学意味的，李安、章子怡合作的电影是哪一部？",
        "output": "select ?x where { ?x ?a <李安_（华人导演）>. ?x ?b <章子怡>. ?x <类型> <哲学>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手梁静茹在2000-08发行的专辑是哪一张？",
        "output": "select ?x where { ?x <专辑歌手> <梁静茹>. ?x <发行时间> \"2000-08\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拥有橡胶果实能力的角色最擅长什么霸气？",
        "output": "select ?x where { ?y <恶魔果实> <橡胶果实>. ?y <最擅长霸气> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中华人民共和国成立的标志事件的主要人物有哪些？",
        "output": "select ?y where { ?x <意义> \"中华人民共和国成立的标志\". ?x <主要人物> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些国家和加拿大有相同的政治体制？",
        "output": "select ?x where { <加拿大_（北美洲国家）> <政治体制> ?y. ?x <政治体制> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄帝的妻子有什么成就？",
        "output": "select ?y where { <黄帝> <配偶> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "史记作者的官职是？",
        "output": "select ?x where { ?y <代表作品> <史记>. ?y <官职> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影阿凡达的出品公司的经营范围有哪些？",
        "output": "select ?y where { <Avatar_（2009年上映詹姆斯·卡梅隆执导美国电影）> <出品公司> ?x. ?x <经营范围> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"罢黜百家独尊儒术\"的是我国历史上哪一位皇帝？",
        "output": "select ?x where { ?x <主要成就> \"独尊儒术\". ?x <职业> <黑洞_（特殊天体）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鲁尔工业区位于哪个国家？",
        "output": "select ?y where { ?x <中文名> \"鲁尔工业区\". ?x <所属地区> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥地利的首都的城市面积有多大？",
        "output": "select ?y where { <奥地利> <首都> ?x. ?x <城市面积> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开发chrome浏览器的公司的CEO是谁？",
        "output": "select ?y where { <Chrome_（谷歌浏览器）> <开发商> ?x. ?x <首席执行官> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你知道几个那些主角吊炸天的漫画的作者？",
        "output": "select ?x where { <高武世界_（指具体的高武世界（位面））> <代表> ?y. ?y <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有一位河南籍作家曾获茅盾文学奖，你知道他是谁吗？",
        "output": "select ?x where { ?x <出生地> <河南_（中国中部地区省份之一）>. ?x <主要成就> \"茅盾文学奖\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "任天堂的创始人在哪一年去世？",
        "output": "select ?y where { <任天堂> <创始人> ?x. ?x <逝世日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俞敏洪母校的校庆日是哪一天？",
        "output": "select ?x where { <俞敏洪> <毕业院校> ?y. ?y <校庆日> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧冰与火之歌的出品公司还有哪些作品？",
        "output": "select ?x where { <冰与火之歌_（美国HBO电视台制作的电视剧）> <出品公司> ?y.?x <出品公司> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄河的主要支流都有什么？",
        "output": "select ?y where { ?x <中文名称> \"黄河\" . ?x <主要支流> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由哥伦比亚广播公司发行的19集电视剧是哪部？",
        "output": "select ?x where { ?x <发行公司> <哥伦比亚广播公司>. ?x <集数> \"19\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "所有球衣号码是22的足球运动员？",
        "output": "select ?x where { ?x <球衣号码> \"22\". ?x <运动项目> <足球>. ?x <国籍> <中华人民共和国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫的建造者的陵墓在哪里？",
        "output": "select ?y where { <故宫_（北京故宫）> <建造者> ?x. ?x <陵墓> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李安导演的获得奥斯卡最佳外语片奖的电影获得了多少票房？",
        "output": "select ?z where { ?x <导演> <李安_（华人导演）>. ?x <主要奖项> \"奥斯卡最佳外语片奖\". ?x <票房> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "龙井茶所属类别有哪些主要营养成分？",
        "output": "select ?z where { ?x <中文名> \"龙井茶\" . ?x <类别> ?y . ?y <主要营养成分> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肯德基的创始人有哪些别名？",
        "output": "select ?y where { <肯德基> <创始人> ?x . ?x <别名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为\"何仙姑\"的是模特是谁？",
        "output": "select ?x where { ?x <别名> \"何仙姑\". ?x <职业> <模特_（职业（展示艺术、时尚产品等））>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "两部《狂人日记》的作者分别是谁？",
        "output": "select ?y where { { ?x <作品名称> \"狂人日记\". } union { ?x <书名> \"狂人日记\". } ?x <作者> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李十二是我国哪个朝代的人？",
        "output": "select ?x where { ?y <别称> <李十二>. ?y <所处时代> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿飞正传这一电影中血型为O的主角有哪些？",
        "output": "select ?x where { <阿飞正传> <主演> ?x. ?x <血型> <O型>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "每一年的9月10日是感谢传道授业解惑的教师的节日，请问这个节日是什么时候设立的？",
        "output": "select ?y where { ?x <节日时间> <9月10日>. ?x <节日意义> \"感谢传道授业解惑的教师\". ?x <设定时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和博尔赫斯同一国家的同行都有谁？",
        "output": "select ?x where { <豪尔赫·路易斯·博尔赫斯_（阿根廷作家）> <出生地> ?y. <豪尔赫·路易斯·博尔赫斯_（阿根廷作家）> <职业> ?z.?x <国籍> ?y.?x <职业> ?z.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青眼白龙的使用者信仰什么宗教?？",
        "output": "select ?z where { ?x <中文名> \"青眼白龙\" . ?x <使用者> ?y . ?y <宗教> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "克苏鲁所在群体都代表着什么？",
        "output": "select ?z where { <克苏鲁_（克苏鲁的呼唤神话小说里面的邪灵角色）> <所属> ?y. ?y <象征> ?z.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "X射线具有的性质有由谁提出的？",
        "output": "select ?y where { <X射线> <性质> ?x. ?x <提出者> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "同时获得\"MTV电影奖-最佳男演员\"和\"国际健美联合会业余组宇宙先生\"的人是谁？",
        "output": "select ?x where { ?x <主要成就> \"美国金球奖电影类-最佳新男演员\". ?x <主要成就> \"MTV电影奖-最佳男演员\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《未来形而上学导论》的作者于什么事件逝世？",
        "output": "select ?y where { <未来形而上学导论> <作者> ?x. ?x <逝世日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果公司的现任首席执行官出生于什么时间？",
        "output": "select ?y where { <苹果_（苹果产品公司）> <首席执行官> ?x. ?x <出生日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哈利波特的作者是谁？",
        "output": "select ?x where { <哈利·波特_（J.K.罗琳创作魔幻系列小说）> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个朝代的人发明了活字印刷术？",
        "output": "select ?y where { <活字印刷术> <发明者> ?x. ?x <国籍> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康熙王朝的纸片人毕业于哪个学校？",
        "output": "select ?x where { <康熙王朝_（中国2001年陈家林执导陈道明主演电视剧）> <制片人> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘彻的统治时间是哪一段？",
        "output": "select ?y where { ?x <中文名> \"刘彻\". ?x <在位时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"三吏三别\"是哪个朝代的作品？",
        "output": "select ?y where { <三吏三别> <作者> ?x. ?x <所处时代> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肯德基的创始人何时逝世？",
        "output": "select ?y where { <肯德基> <创始人> ?x . ?x <逝世日期> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大是什么时候入党的？",
        "output": "select ?x where { ?y <别名> \"习大大\". ?y <入党时间> ?x. }"
    }
]