[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梁家辉的妻子是谁？",
        "output": "select ?y where { <梁家辉> <配偶> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五指峰景区是在哪里呢？",
        "output": "select ?y where { <五指峰_（湖南张家界五指峰）> <地区> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门大学有着什么样的校训？",
        "output": "select ?y where { <厦门大学> <校训> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林黎胜毕业于哪一所高校？",
        "output": "select ?y where { <林黎胜> <毕业院校> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《新楚留香》的原著是哪位作家？",
        "output": "select ?y where { <新楚留香> <原著> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "任贤齐的英文名字是什么？",
        "output": "select ?y where { <任贤齐> <外文名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从哪个网址可以访问天涯社区呢？",
        "output": "select ?y where { <天涯社区> <官网> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲斑马是哪位歌手的代表作品？",
        "output": "select ?y where { ?y <代表作品> <斑马>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "想吃草莓奶冻需要准备什么食材呢？",
        "output": "select ?y where { <草莓奶冻> <主要食材> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "剑南诗稿是谁的作品？",
        "output": "select ?y where {<剑南诗稿> <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "池上晚雨是什么朝代的作品？",
        "output": "select ?y where {<池上晚雨> <创作年代> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员张静初出生在什么时候？",
        "output": "select ?y where {<张静初> <出生日期> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "是谁写了时间移民这部作品？",
        "output": "select ?y where {<时间移民> <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘慈欣又被叫做什么？",
        "output": "select ?y where {<刘慈欣> <别名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "建议在西湖游玩多长时间呢？",
        "output": "select ?y where {<西湖_（浙江省杭州市西湖）> <建议游玩时长> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蘑菇街的公仔牙牙出生在什么地方？",
        "output": "select ?y where {<牙牙_（蘑菇街公仔形象）> <出生地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西湖景区的湖中二塔是指？",
        "output": "select ?y where {<西湖_（浙江省杭州市西湖）> <湖中二塔> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西湖景区有多宽呢？",
        "output": "select ?y where { <西湖_（浙江省杭州市西湖）> <湖泊宽度> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的证券类型？",
        "output": "select ?x where { <索尼公司> <证券类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的员工人数？",
        "output": "select ?x where { <索尼公司> <员工人数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的上市日期？",
        "output": "select ?x where { <索尼公司> <上市日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的总股本？",
        "output": "select ?x where { <索尼公司> <总股本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的市盈率？",
        "output": "select ?x where { <索尼公司> <市盈率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美股的交易机制？",
        "output": "select ?x where { <美股> <交易机制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美股最小交易单位？",
        "output": "select ?x where { <美股> <最小交易单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美股最大涨跌幅？",
        "output": "select ?x where { <美股> <最大涨跌幅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汽车玻璃的上游是？",
        "output": "select ?x where { <汽车玻璃> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行股份有限公司的简称?",
        "output": "select ?x where { <平安银行股份有限公司> <公司简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的股票代码?",
        "output": "select ?x where { <平安银行> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "000001的公司全称?",
        "output": "select ?x where { ?x <股票代码> <000001>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "000001的公司简称?",
        "output": "select ?x where { ?x <公司名称> ?y. ?y <股票代码> <000001>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些高管?",
        "output": "select ?x where { <可立克> <公司高管> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的高管数量?",
        "output": "select ?x where { <可立克> <高管数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些男性高管?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <性别> <男>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些女性高管?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <性别> <女>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些高管年龄在50岁以上?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <大于> <50岁>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克哪个高管年龄最大?",
        "output": "select ?x where { <可立克> <年龄最大> ?x. ?x <​属于> <公司高管>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克哪个高管年龄最小?",
        "output": "select ?x where { <可立克> <年龄最小> ?x. ?x <​属于> <公司高管>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些高管年纪不到50?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <小于> <50岁>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些高管1970年前出生?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <出生早于> <1970年>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克董事长的出生时间?",
        "output": "select ?x where { <可立克> <董事长> ?y. ?y <出生时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克董事长的学历?",
        "output": "select ?x where { <可立克> <董事长> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克董事长的上任时间?",
        "output": "select ?x where { <可立克> <董事长> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克公司成立时间?",
        "output": "select ?x where { <可立克> <公司成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些高管硕士学历?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <学历类别> <硕士>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些高管本科学历?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <学历类别> <本科>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克有哪些高管大专学历?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <学历类别> <大专>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的董事长?",
        "output": "select ?x where { <可立克> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的第一任董事长?",
        "output": "select ?x where { <可立克> <第一任董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的监事会主席?",
        "output": "select ?x where { <可立克> <监事会主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的法人?",
        "output": "select ?x where { <可立克> <公司法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的副董事长?",
        "output": "select ?x where { <可立克> <副董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的董事成员?",
        "output": "select ?x where { <可立克> <董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的独立董事成员?",
        "output": "select ?x where { <可立克> <独立董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的监事会成员?",
        "output": "select ?x where { <可立克> <监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的有几位副总经理?",
        "output": "select ?x where { <可立克> <副总经理数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的职工监事是谁?",
        "output": "select ?x where { <可立克> <职工监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的最新上任的独立董事是谁?",
        "output": "select ?x where { <可立克> <最新任独立董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克第一任董事长的上任时间?",
        "output": "select ?x where { <可立克> <第一任董事长> ?y. ?y <上任时间>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的现任董事长的上任时间?",
        "output": "select ?x where { <可立克> <现任董事长> ?y. ?y <上任时间>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的顾董国籍?",
        "output": "select ?x where { <顾洁_(可立克高管)> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可立克的高管中外国国籍的有哪几位?",
        "output": "select ?x where { <可立克> <公司高管> ?x. ?x <国籍> <外国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金自天正有博士后学历的高管是谁?",
        "output": "select ?x where { <金自天正> <公司高管> ?x. ?x <学历> <博士后>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金自天正高管的最高学历?",
        "output": "select ?x where { <金自天正> <公司高管> ?y. ?y <最高学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金自天正的财务总监是谁?",
        "output": "select ?x where { <金自天正> <财务总监> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红豆股份的董事会秘书是谁?",
        "output": "select ?x where { <红豆股份> <董事会秘书> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红豆股份的创始人",
        "output": "select ?x where { <红豆股份> <企业创始人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红豆股份的公司地址",
        "output": "select ?x where { <红豆股份> <公司地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红豆股份的注册时间",
        "output": "select ?x where { <红豆股份> <工商注册时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红豆股份的上市时间",
        "output": "select ?x where { <红豆股份> <上市时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "红豆股份的经营范围",
        "output": "select ?x where { <红豆股份> <经营范围> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孟晓平在红豆股份担任了什么职务",
        "output": "select ?x where { <孟晓平_（红豆股份）> <所担任职务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "潍柴重机的CEO?",
        "output": "select ?x where { <潍柴重机> <ceo> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒泰艾普的CFO?",
        "output": "select ?x where { <恒泰艾普> <cfo> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大康农业的COO?",
        "output": "select ?x where { <大康农业> <coo> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三毛派神的人事行政总监?",
        "output": "select ?x where { <三毛派神> <人事行政总监> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香梨股份的副总裁?",
        "output": "select ?x where { <香梨股份> <副总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "捷成世纪的会计?",
        "output": "select ?x where { <捷成世纪> <会计> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "招商银行的副行长?",
        "output": "select ?x where { <招商银行> <副行长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国盛金控的首席信息官?",
        "output": "select ?x where { <国盛金控> <首席信息官> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百大集团的代理总经理",
        "output": "select ?x where { <百大集团> <代理总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和而泰的人力资源主管",
        "output": "select ?x where { <和而泰> <人力资源主管> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "酒钢宏兴的代理董事会秘书,总经济师",
        "output": "select ?x where { <酒钢宏兴> <代理董事会秘书> ?x. <酒钢宏兴> <总经济师>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华夏银行的代行行长",
        "output": "select ?x where { <华夏银行> <代行行长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老百姓的信息副总裁",
        "output": "select ?x where { <老百姓> <信息副总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康达尔的首席技术官",
        "output": "select ?x where { <康达尔> <首席技术官> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新华保险的首席财务官",
        "output": "select ?x where { <新华保险> <首席财务官> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛金王的首席运营官",
        "output": "select ?x where { <青岛金王> <首席运营官> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海银行的首席风险官",
        "output": "select ?x where { <上海银行> <首席风险官> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "TCL集团的助理总裁",
        "output": "select ?x where { <TCL集团> <助理总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华西证券的合规负责人",
        "output": "select ?x where { <华西证券> <合规负责人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "博云新材的名誉董事长",
        "output": "select ?x where { <博云新材> <名誉董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "招商银行的外部监事",
        "output": "select ?x where { <招商银行> <外部监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长春高新的外部董事",
        "output": "select ?x where { <长春高新> <外部董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "圣邦股份的市场总监",
        "output": "select ?x where { <圣邦股份> <市场总监> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中源协和的常务副总经理",
        "output": "select ?x where { <中源协和> <常务副总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浔兴股份的总会计书",
        "output": "select ?x where { <浔兴股份> <总会计书> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浔兴股份的张健群担任了哪些职务",
        "output": "select ?x where { <张健群_（浔兴股份）> <所担任职务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通威股份的总审计师",
        "output": "select ?x where { <通威股份> <总审计师> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国太保的总精算师",
        "output": "select ?x where { <中国太保> <总精算师> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中文在线的执行总经理",
        "output": "select ?x where { <中文在线> <执行总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长城汽车的技术研究院试验中心总工程师",
        "output": "select ?x where { <长城汽车> <技术研究院试验中心总工程师> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纳思达的技术负责人",
        "output": "select ?x where { <纳思达> <技术负责人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "永兴特钢的经理助理",
        "output": "select ?x where { <永兴特钢> <经理助理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "铁汉生态的联席总裁",
        "output": "select ?x where { <铁汉生态> <联席总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "岭南股份的股东监事",
        "output": "select ?x where { <岭南股份> <股东监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新华都的董事会办公室主任",
        "output": "select ?x where { <新华都> <董事会办公室主任> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "步长制药的采购副总裁",
        "output": "select ?x where { <步长制药> <采购副总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在中金黄金担任财务负责人,总会计师的是谁",
        "output": "select ?x where { <中金黄金> <代理董事会秘书> ?x. <中金黄金> <总经济师>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国大陆银行类别",
        "output": "select ?x where { <银行> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中央银行的简称",
        "output": "select ?x where { <中央银行> <简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中央银行的全称",
        "output": "select ?x where { <中央银行> <全称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "商业银行类别",
        "output": "select ?x where { <商业银行> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国五大行",
        "output": "select ?x where { <银行> <五强排名> ?x.?x <国家> <中国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "马云的妻子",
        "output": "select ?x where { <马云> <妻子> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿里巴巴创始人",
        "output": "select ?x where { <阿里巴巴> <企业创始人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鄢建兵的前妻是谁",
        "output": "select ?x where { <鄢建兵_(赢时胜)> <前妻> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可转换债券的三个特点",
        "output": "select ?x where { <可转换债券> <产品特点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有几家湘财证券的营业部",
        "output": "select ?x where { <湘财证券> <网点> ?x. ?x <所属地区> <北京>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "建国门湘财证券营业部地址",
        "output": "select ?x where { <湘财证券> <网点> ?x. ?x <附近标志> <建国门>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我家在朝阳区，附近有哪几家湘财证券营业部",
        "output": "select ?x where { <湘财证券> <网点> ?x. ?x <区属名称> <朝阳区>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朝阳门外大街上有湘财证券的营业部吗",
        "output": "select ?x where { <湘财证券> <网点> ?x. ?x <街道名称> <朝阳门外大街>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海淀区的湘财证券营业部叫什么?",
        "output": "select ?x where { <湘财证券> <网点> ?x. ?x <区属名称> <海淀区>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生指数的缩写",
        "output": "select ?x where { <恒生指数> <英文名缩写> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "MACD指标的中文全称",
        "output": "select ?x where { <MACD> <中文全称为> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "常用的KDJ参数",
        "output": "select ?x where { <KDJ_随机指标> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信用卡类别",
        "output": "select ?x where { <信用卡> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "投资者申请赎回基金，几天后可查询",
        "output": "select ?x where { <基金赎回> <可查询时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金开户途径",
        "output": "select ?x where { <基金开户> <方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "投资银行经营业务",
        "output": "select ?x where { <投资银行> <经营业务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "投资银行的四种类型",
        "output": "select ?x where { <投资银行> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券承销的方式",
        "output": "select ?x where { <证券承销> <方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股份有限公司的设立方式",
        "output": "select ?x where { <股份有限公司> <设立方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股份有限公司的组织机构主要包括",
        "output": "select ?x where { <股份有限公司> <组织机构> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股份公司的清算方式",
        "output": "select ?x where { <股份有限公司> <清算方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "货币的种类",
        "output": "select ?x where { <货币> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国最早的货币是什么",
        "output": "select ?x where { <中国> <最早的纸币> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "货币的一般发行方",
        "output": "select ?x where { <货币> <发行方> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "涨停方式分类",
        "output": "select ?x where { <涨停> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我国公积金的种类",
        "output": "select ?x where { <公积金> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外汇期货合约的交割月份",
        "output": "select ?x where { <外汇期货> <合约交割时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外汇期货英镑的代号是",
        "output": "select ?x where { <英镑> <外汇期货代号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "八种主要货币的外汇期货",
        "output": "select ?x where { <外汇期货> <货币类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港交所的全称",
        "output": "select ?x where { <港交所> <全称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港交所的竞价时段",
        "output": "select ?x where { <港交所> <竞价时段> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港交所的早市交易时段",
        "output": "select ?x where { <港交所> <早市交易时段> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港交所的延续早市交易时段",
        "output": "select ?x where { <港交所> <延续早市交易时段> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "港交所的午后（下午）交易时段",
        "output": "select ?x where { <港交所> <午后交易时段> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香港交易所什么时候成为恒生指数成份股",
        "output": "select ?x where { <港交所_(恒生指数成份股)> <获批准时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "移动平均线是谁提出的?",
        "output": "select ?x where { <移动平均线> <提出人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百度(中国)的大股东参股了哪几家公司",
        "output": "select ?x where { <百度(中国)> <参股的公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生指数包含哪些",
        "output": "select ?x where { <恒生指数> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股本概念分类",
        "output": "select ?x where { <股本> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蓝筹股的类别",
        "output": "select ?x where { <蓝筹股> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开通股票账户的费用项",
        "output": "select ?x where { <股票开户费> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "分时K线的种类",
        "output": "select ?x where { <分时K线> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国内的基金评级机构",
        "output": "select ?x where { <基金> <评级机构> ?x.?x <国家> <中国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "分级债券基金可分为哪些",
        "output": "select ?x where { <分级债券基金> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杠杆基金有哪些",
        "output": "select ?x where { <杠杆基金> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票(指数)分级基金的分级模式主要有哪些",
        "output": "select ?x where { <股票(指数)分级基金> <分级模式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "买新三板的股票要开什么权限",
        "output": "select ?x where { <新三版> <交易权限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪几类信托产品",
        "output": "select ?x where { <信托产品> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券类信托理财产品的相关费用主要有哪些",
        "output": "select ?x where { <证券类信托理财产品> <费用类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信托产品的发行机构",
        "output": "select ?x where { <信托产品> <发行机构> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金资管产品的发行机构",
        "output": "select ?x where { <基金资管产品> <发行机构> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信托产品有投资期限吗?",
        "output": "select ?x where { <信托产品> <投资期限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "资产管理业务委托方包含哪些?",
        "output": "select ?x where { <资管产品> <业务委托方> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国国库券的最短期限",
        "output": "select ?x where { <国库券> <最短期限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国库券什么时候首次发行",
        "output": "select ?x where { <国库券> <首次发行时间>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国库券的债务人",
        "output": "select ?x where { <国库券> <债务人>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险公司可采取的组织形式",
        "output": "select ?x where { <保险公司> <组织形式>?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险代理人的分类",
        "output": "select ?x where { <保险代理人> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险公估人的职能",
        "output": "select ?x where { <保险公估人> <职能> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险准备金包括",
        "output": "select ?x where { <保险准备金> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险费率组成",
        "output": "select ?x where { <保险费率> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险费率厘定的基本原则",
        "output": "select ?x where { <保险费率> <厘定原则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险公司分摊损失的方法",
        "output": "select ?x where { <保险公司> <责任分摊方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "货币期货的主要交易场所",
        "output": "select ?x where { <货币期货> <交易场所> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "场内交易的金融期权主要包括",
        "output": "select ?x where { <金融期权> <场内交易类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融远期合约的主要类型",
        "output": "select ?x where { <金融远期合约> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "处于领先地位的ETF期权交易市场?",
        "output": "select ?x where { <ETF期权交易市场> <领先国家> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外汇期权的种类",
        "output": "select ?x where { <外汇期权> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股指期货的三大要务",
        "output": "select ?x where { <股指期货> <要务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从事保险活动需要了解的法律",
        "output": "select ?x where { <保险业务> <法规> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国首家赤道银行",
        "output": "select ?x where { ?x <为中国第一家> <赤道银行>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多德-弗兰克法案的正式通过是在哪一年",
        "output": "select ?x where { <多德-弗兰克法案> <通过时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融监管有哪些方式",
        "output": "select ?x where { <金融监管> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现有的金融监管结构",
        "output": "select ?x where { <金融监管> <结构模式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融监管治理的要素",
        "output": "select ?x where { <金融监管> <要素> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "逆周期金融监管的内容有哪些",
        "output": "select ?x where { <逆周期金融监管> <内容> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "权证的基本要素",
        "output": "select ?x where { <权证> <要素> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银行融资的主要手段",
        "output": "select ?x where { <银行> <融资手段> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "混合型融资方式包括哪些",
        "output": "select ?x where { <混合型融资> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "家族办公室的资本管理对象",
        "output": "select ?x where { <家族办公室> <管理对象> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外汇理财的主要品种",
        "output": "select ?x where { <外汇理财> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外币储蓄存款的四大类型",
        "output": "select ?x where { <外币储蓄存款> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "理财顾问的付费方式",
        "output": "select ?x where { <理财顾问> <付费方式> ?x. }"
    }
]