[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一个网络流行语表示\"非常好笑\"的意思？",
        "output": "select ?x where { ?x <属于> <网络语言> . ?x <释义> \"觉得非常好笑\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "罗马数字MXXIV等于哪个自然数？",
        "output": "select ?x where { ?x <罗马数字> \"MXXIV\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁发明了木牛流马？",
        "output": "select ?x where { ?x <主要成就> \"发明木牛流马\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英文名为EarthShaker的游戏人物所属的游戏的制作人是谁？",
        "output": "select ?x where { ?y <外文名> \"EarthShaker\" . ?y <所属游戏> ?z . ?z <制作人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"Clash of Clans\"的发行商是？",
        "output": "select ?x where { ?y <原版名称> \"Clash of Clans\" . ?y <发行商> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "化学式为\"CH2O\"的化学物质英文名称为？",
        "output": "select ?y where { ?y <化学式> \"CH2O\" . ?y <英文名称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些学校属于C9联盟？",
        "output": "select ?y where { ?y <属性> <C9_（九校联盟）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钠皂的主要成分的熔点是？",
        "output": "select ?x where { <钠皂> <主要成分> ?y . ?y <熔点> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞船\"黄金之心\"出自哪个作品？",
        "output": "select ?x where { <黄金之心_（科幻小说中的飞船）> <作品名称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "史强是哪位作家所著科幻小说中的人物？",
        "output": "select ?x where { <史强_（科幻小说《三体》系列中的人物）> <登场作品> ?y . ?y <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个数字的12进制表示与八进制数\"45\"的10进制表示相同？",
        "output": "select ?x where { ?y <八进制> \"45\" . ?x <十二进制> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "itoa函数来自哪个编程语言？",
        "output": "select ?x where { <itoa函数> <来源> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "<悼念玛丽·居里>的作者所属于哪个民族？",
        "output": "select ?x where { <悼念玛丽·居里> <作者> ?y . ?y <民族> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科学家牛顿的英文名是？",
        "output": "select ?x where { <牛顿_（艾萨克·牛顿）> <外文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "使用ios操作系统的手机上运行名称为何的应用商店？",
        "output": "select ?x where { ?y <操作系统> <iOS_（苹果公司的移动操作系统）> . ?y <应用商店> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "密度为1.18g/cm3的一种强酸是？",
        "output": "select ?x where { ?x <密度> \"1.18g/cm3\" . <强酸> <主要> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "分子量为2的气体有什么样的天然同位素？",
        "output": "select ?x where { ?y <分子量> \"2\" . ?y <天然同位素> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "地球大气中包含的哪种元素是科学家舍勒发现的？",
        "output": "select ?x where { ?x <发现人> <舍勒_（瑞典化学家）> . <地球大气> <成份> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "原子序数为8的元素能够成哪几种单质？",
        "output": "select ?x where { ?y <原子序数> \"8\" . ?y <构成单质> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "圆周率有哪些近似值？",
        "output": "select ?x where { <圆周率> <近似值> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伯瓦尔·弗塔根在游戏《魔兽世界》中的身份是？",
        "output": "select ?x where { <伯瓦尔·弗塔根_（游戏人物）> <身份> ?x . ?x <游戏> <魔兽_（网络游戏《魔兽世界》的简称）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "作家余华有哪些代表作？",
        "output": "select ?x where { <余华_（当代作家）> <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "一氧化碳的爆炸极限是？",
        "output": "select ?x where { <一氧化碳> <爆炸极限> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种用作强氧化剂的化学物质外观是针状固体或液体？",
        "output": "select ?x where { ?x <外观> \"针状固体或液体\" . ?x <应用> <强氧化剂> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四氯化碳要如何储存？",
        "output": "select ?x where { <四氯化碳> <储存方式> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "桑迪·牛顿参与主演了哪一步由罗兰·艾默里奇导演电影？",
        "output": "select ?x where { ?x <主演> <桑迪·牛顿> . ?x <导演> <罗兰·艾默里奇> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小说《流浪地球》的作者是？",
        "output": "select ?x where { <流浪地球_（书名）> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小说《达芬奇密码》的作者出生于何时？",
        "output": "select ?x where { ?y <出生日期> ?x . ?y <代表作品> <达芬奇密码_（图书）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "数字49的二进制表示为？",
        "output": "select ?x where { <49_（数字）> <二进制> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百度的董事长是谁？",
        "output": "select ?x where { <百度> <董事长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒星的\"氦闪\"是一种什么性质的物理过程？",
        "output": "select ?x where { <氦闪> <性质> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "原子序数为92、用于原子弹的化学元素是？",
        "output": "select ?x where { ?x <用途> <原子弹> . ?x <原子序数> \"92\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何用罗马数字书写十进制数48？",
        "output": "select ?x where { <48> <罗马数字> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电流通常用哪个英文字母表示？",
        "output": "select ?x where { <电流> <物理量符号> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学的校歌是什么？",
        "output": "select ?x where { <北京大学> <校歌> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘昊然是什么星座的？",
        "output": "select ?x where { <刘昊然> <星座> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘昊然的粉丝称为什么？",
        "output": "select ?x where { <刘昊然> <粉丝名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鹿晗主演过什么电影？",
        "output": "select ?x where { ?x <主演> <鹿晗> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鹿晗的男或女朋友是谁？",
        "output": "select ?x where { ?x <恋人> <鹿晗> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胡歌的毕业院校在哪里？",
        "output": "select ?x where { <胡歌_（中国内地男演员）> <毕业院校> ?y . ?y <所属地区> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英文名为\"KRIS\"的歌手的中文名？",
        "output": "select ?x where { ?y <外文名> \"KRIS\" . ?y <职业> <歌手_（职业名称）> . ?y <中文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "莎士比亚是哪国的戏剧家？",
        "output": "select ?x where { <莎士比亚_（欧洲文艺复兴时期戏剧家）> <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《罗密欧与朱丽叶》的作者有什么别名？",
        "output": "select ?x where { ?y <代表作品> <罗密欧与朱丽叶_（莎士比亚著名戏剧）> . ?y <别名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伦敦市的人口有多少？",
        "output": "select ?x where { <伦敦_（英国首都）> <人口> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英国首都的机场叫什么？",
        "output": "select ?x where { <英国_（大不列颠及北爱尔兰联合王国）> <首都> ?y . ?y <机场> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国首都面积多大？",
        "output": "select ?x where { <美国_（美利坚合众国）> <首都> ?y . ?y <面积> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海南有什么著名景点？",
        "output": "select ?x where { <海南_（中国行政区）> <著名景点> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《教父》得过什么奖？",
        "output": "select ?x where { <教父_（1972年美国黑帮电影）> <主要奖项> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名moba类游戏dota2的开发商是谁？",
        "output": "select ?x where { <dota2> <开发商> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哲学家柏拉图出生在哪里？",
        "output": "select ?x where { <柏拉图_（古希腊哲学家）> <出生地> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哲学家柏拉图的老师的信仰是什么？",
        "output": "select ?x where { <柏拉图_（古希腊哲学家）> <老师> ?y . ?y <信仰> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哲学家柏拉图的老师逝世于哪一年？",
        "output": "select ?x where { <柏拉图_（古希腊哲学家）> <老师> ?y . ?y <逝世日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "dell创始人来自哪个国家？",
        "output": "select ?x where { <戴尔公司> <创始人> ?y . ?y <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "dell公司的口号是什么？",
        "output": "select ?x where { <戴尔公司> <公司口号> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果公司成立于哪一天？",
        "output": "select ?x where { <苹果_（苹果产品公司）> <成立时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果公司的现任CEO是谁？",
        "output": "select ?x where { <苹果_（苹果产品公司）> <首席执行官> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苹果公司创始人出生于哪天？",
        "output": "select ?x where { <苹果_（苹果产品公司）> <创始人> ?y . ?y <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斯坦福大学现任校长得过什么奖？",
        "output": "select ?x where { <斯坦福大学> <现任校长> ?y . ?y <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周杰伦的血型？",
        "output": "select ?x where { <周杰伦> <血型> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "昆凌女儿是什么星座的？",
        "output": "select ?x where { ?y <妈妈> <昆凌> . ?y <星座> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香港词人黄伟文出生于哪一年？",
        "output": "select ?x where { <黄伟文_（香港填词人、时尚评论人）> <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由黄伟文填词，陈奕迅演唱的歌曲有哪些？",
        "output": "select ?x where { ?x <填词> <黄伟文_（香港填词人、时尚评论人）> . ?x <歌曲原唱> <陈奕迅> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名歌手陈奕迅的出生日期是？",
        "output": "select ?x where { <陈奕迅> <外文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陈奕迅和张柏芝一起演了什么电影？",
        "output": "select ?x where { ?x <主演> <陈奕迅> . ?x <主演> <张柏芝> .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥斯卡金像奖的发起单位是？",
        "output": "select ?x where { <奥斯卡金像奖> <发起单位> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《泰坦尼克号》导演的国籍是？",
        "output": "select ?x where { <泰坦尼克号_（2012年詹姆斯·卡梅隆执导3D电影）> <导演> ?y . ?y <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "莱昂纳多·迪卡普里奥演的哪部电影得了奥斯卡最佳男主角？",
        "output": "select ?x where { ?x <主演> <莱昂纳多·迪卡普里奥> . ?x <主要奖项> \"2016年 第73届金球奖剧情片最佳男主角（获奖）\"\t}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "漫威公司成立于哪一年？",
        "output": "select ?x where { <漫威> <成立时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "漫威的母公司的官网域名是？",
        "output": "select ?x where { <漫威> <母公司> ?y . ?y <官网> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "名模卡莉·克劳斯的身高？",
        "output": "select ?x where { <卡莉·克劳斯_（美国超模）> <身高> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发行专辑《1989》的歌手出生于哪天？",
        "output": "select ?x where { <1989_（泰勒·斯威夫特第五张录音室专辑）> <专辑歌手> ?y . ?y <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被无数人称为\"老婆\"的新垣结衣是干什么的？",
        "output": "select ?x where { <新垣结衣> <职业> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被誉为\"性感小野马\"的金泫雅有多重？",
        "output": "select ?x where { <金泫雅> <体重> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "身为万千少女的梦中情人，外文名为\"Takeshi Kaneshiro\"的演员是什么血型？",
        "output": "select ?x where { ?y <外文名> \"Takeshi Kaneshiro\" . ?y <血型> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《春光乍泄》中黎耀辉的恋人是谁？",
        "output": "select ?x where { <黎耀辉> <恋人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "姓\"江\"的代表人物有哪些？",
        "output": "select ?x where { <江_（中国姓氏）> <代表人物> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "告诫我们\"改编不是乱编\"，艺名\"六小龄童\"的德艺双馨的老艺术家的本名是什么？",
        "output": "select ?x where { ?y <别名> \"六小龄童（艺名）\" . ?y <中文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陈思成做导演以后，请刘昊然主演的片子有什么？",
        "output": "select ?x where { ?x <主演> <刘昊然> . ?x <导演> <陈思成_（青年导演、演员、编剧）>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在黑龙江出生并且任职于九校联盟中的大学的老师有哪些？",
        "output": "select ?x where { ?x <出生地> <黑龙江_（最北和最东的省级行政区）> . ?x <职业> ?y . ?y <属性> <C9_（九校联盟）> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从北大中文系的毕业又回到北大任教的人有哪些？",
        "output": "select ?x where { ?x <毕业院校> <北京大学中文系> . ?x <职业> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"The Lake Poets\"有哪些代表性作家？",
        "output": "select ?y where { ?x <外文名> \"The Lake Poets\" . ?x <代表人物> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在希腊神话里掌管医药的是哪一位神？",
        "output": "select ?x where { ?x <神话体系> <希腊神话_（西方神话体系之一）> . ?x <司掌> <医药> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "查理·包法利是哪一位作家的老师的作品里的主人公？",
        "output": "select ?x where { <查理·包法利> <出自> ?y . ?z<代表作品> ?y . ?x <老师> ?z }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些著名犹太作家？",
        "output": "select ?x where { ?x <民族> <犹太> . ?x <职业> <作家_（汉语词语）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王菲和金城武共同主演的电影有多长时间片长？",
        "output": "select ?x where { ?y <主演> <王菲_（华语女歌手、演员）> . ?y <主演> <金城武> . ?y <片长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"P(A|B)=P(B|A)*P(A)/P(B)\"是哪一个数学分支里的公式？",
        "output": "select ?x where { ?y <表达式> \"P(A|B)=P(B|A)*P(A)/P(B)\" . ?y <适用领域范围> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "角色谢尔顿·库珀最先于哪一年在影视作品中出现？",
        "output": "select ?x where { <谢尔顿·库珀> <登场作品> ?y . ?y <上映时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被誉为\"赣西明珠\"的江西省地级市是？",
        "output": "select ?x where { ?x <别名> \"赣西明珠\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于华东师范大学并于2014获得伊莱亚斯-科里奖的化学家是？",
        "output": "select ?x where { ?x <主要成就> \"2014伊莱亚斯·j·科里奖\" . ?x <毕业院校> <华师大_（华东师范大学）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "堺雅人和香川照之共同主演了哪些剧集或电影？",
        "output": "select ?x where { ?x <主演> <堺雅人> . ?x <主演> <香川照之> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国最早的诗歌总集在内容上可以划分为哪几类？",
        "output": "select ?x where { ?y <历史地位> \"中国最早的一部诗歌总集\" . ?y <内容分类> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《浮士德》的作者是哪国人？",
        "output": "select ?x where { <浮士德_（以德国民间传说为题材长篇诗剧）> <作者> ?y . ?y <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《夜莺颂》作者的宗教信仰是？",
        "output": "select ?x where { <夜莺颂> <作者> ?y . ?y <信仰> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唯美主义的流派有哪些代表人物？",
        "output": "select ?x where { <唯美主义> <代表人物> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "积极浪漫主义精神的文学流派里有哪些代表人物？",
        "output": "select ?x where { ?y <释义> \"积极浪漫主义精神的文学流派\" . ?y <代表人物> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Realism的定义是？",
        "output": "select ?x where { ?y <外文名> \"Realism\" . ?y <定义> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "詹姆斯卡梅隆出生于加拿大的哪里？",
        "output": "select ?x where { <詹姆斯·卡梅隆_（加拿大电影导演）> <出生地> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获诺贝尔文学奖的爱尔兰诗人有哪些？",
        "output": "select ?x where { ?x <职业> <诗人_（汉语词语）> . ?x <国籍> <爱尔兰_（爱尔兰共和国）> . ?x <主要成就> \"诺贝尔文学奖\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁是著名的表现主义犹太小说家？",
        "output": "select ?x where { ?x <民族> <犹太人> . ?x <职业> <小说家_（写小说的作家）> . ?x <文学流派> \"表现主义\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王小波的丈母娘是谁？",
        "output": "select ?x where { ?y <配偶> <王小波_（中国当代作家、学者、文学家）> . ?y <母亲> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "注册号为\"330100400015575\"的公司的CEO是谁？",
        "output": "select ?x where { ?y <注册号> \"330100400015575\" . ?y <首席执行官> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳成立于98年11月11日的有限责任公司是？",
        "output": "select ?x where { ?x <总部地点> <深圳> . ?x <公司性质> <有限责任公司> . ?x <成立时间> \"1998-11-11\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "塞万提斯的代表作品有多少个字？",
        "output": "select ?x where { <塞万提斯·萨维德拉> <代表作品> ?y . ?y <字数> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唱《给所有知道我名字的人》的歌手是哪个星座的？",
        "output": "select ?x where { <给所有知道我的名字的人> <演唱> ?y . ?y <星座> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "闻一多创作了哪些十四行诗？",
        "output": "select ?x where { ?x <作者> <闻一多> . ?x <文学体裁> <十四行诗> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "文艺复兴在法国有哪些代表人物？",
        "output": "select ?x where { <法国文艺复兴> <代表人物> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"Biblia\"是哪一部作品的拉丁语名称？",
        "output": "select ?x where { ?x <拉丁语> \"Biblia\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪一位主教是出生于北非的？",
        "output": "select ?x where { ?x <出生地> <北非> . ?x <职业> <主教_（宗教中的神职人员）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《俄狄浦斯王》的作者是哪个国家的人？",
        "output": "select ?x where { ?y <国籍> ?x . ?z<书名> \"《俄狄浦斯王》\" . ?z <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "特洛伊战争主要有哪些将领指挥？",
        "output": "select ?x where { <特洛伊战争_（古希腊战争）> <主要指挥官> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "制作Kindle的公司的官网是？",
        "output": "select ?x where { <Kindle> <制作方> ?y . ?y <官网> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发行于2005年由蔡科俊编曲，方文山作词的周杰伦音乐作品的名称是？",
        "output": "select ?x where { ?x <发行时间> \"2005\" . ?x <填词> <方文山> . ?x <编曲> <蔡科俊>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "某位以魔幻现实主义著称的作家于1985年首发的长篇小说名字是？",
        "output": "select ?x where { <魔幻现实主义> <代表作家> ?y . ?y <代表作品> ?x . ?x <首版时间> \"1985\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别名为\"诡屋掠凶实录\"的美国恐怖电影的导演是？",
        "output": "select ?x where { ?y <其它译名> \"厉阴宅（台）/诡屋掠凶实录（港）\" . ?y <导演> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "防骗指南在什么地方？",
        "output": "SELECT ?x WHERE { <防骗指南> <地区> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学获得过哪些主要奖项？",
        "output": "SELECT ?x WHERE { <北京大学> <主要奖项> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学有多少专职院士？",
        "output": "SELECT ?x WHERE { <清华大学> <专职院士> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪所公立大学以\"自强不息，厚德载物\"作为校训？",
        "output": "SELECT ?x WHERE { ?x <校训> <自强不息> . ?x <校训> <厚德载物_（成语）> . ?x <类别> <公立大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2011年度时尚先生盛典在哪里举办？",
        "output": "SELECT ?x WHERE { <2011年度时尚先生盛典> <地区> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柏拉图的作品有哪些？",
        "output": "SELECT ?x WHERE { ?x <作者> <柏拉图_（古希腊哲学家）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斐多篇的作者的老师是谁？",
        "output": "SELECT ?y WHERE { ?x <老师> ?y . <斐多篇> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《理想国》的作者有哪些主张？",
        "output": "SELECT ?y WHERE { ?x <主张> ?y . <理想国_（理想国）> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《会饮篇》的作者的本名是什么？",
        "output": "SELECT ?y WHERE { ?x <本名> ?y . <会饮篇> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"以太\"概念的提出者是谁？",
        "output": "SELECT ?x WHERE { <以太_（科学理论）> <提出者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"目的因\"这一说法出自哪位哲学家？",
        "output": "SELECT ?x WHERE { <目的因> <出自> ?x . ?x <职业> <哲学家_（基础含义）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "修昔底德的主要作品是哪一部？",
        "output": "SELECT ?x WHERE { <修昔底德_（古希腊历史学家、雅典十将军之一）> <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些著名的现实主义者？",
        "output": "SELECT ?x WHERE { <现实主义者> <代表人物> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "修昔底德的职业是什么？",
        "output": "SELECT ?x WHERE { <修昔底德_（古希腊历史学家、雅典十将军之一）> <职业> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名的\"修昔底德陷阱\"的提出者是谁？",
        "output": "SELECT ?x WHERE { <修昔底德陷阱> <提出者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "希罗多德的作品有哪些？",
        "output": "SELECT ?x WHERE { ?x <作者> <希罗多德> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"双城论\"的提出者的作品有哪些？",
        "output": "SELECT ?x WHERE { <双城论> <提出者> ?y . ?x <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《论三位一体》的作者的主要成就有哪些？",
        "output": "SELECT ?x WHERE { ?y <代表作品> <论三位一体> . ?y <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基督教哲学的代表人物有哪些？",
        "output": "SELECT ?x WHERE { <基督教哲学> <代表人物> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"坐标几何\"的提出者还提出了哪些主张？",
        "output": "SELECT ?x WHERE { <坐标几何> <提出者> ?y . ?x <提出者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些著名数学家同时也是物理学家？",
        "output": "SELECT ?x WHERE { ?x <职业> <物理学家_（探索、研究物理学的科学家）> . ?x <职业> <数学家_（数学家（世界著名数学家））> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些哲学家既是数学家又是物理学家？",
        "output": "SELECT ?x WHERE { ?x <职业> <物理学家_（探索、研究物理学的科学家）> . ?x <职业> <数学家_（数学家（世界著名数学家））> . ?x <职业> <哲学家_（基础含义）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁最先提出了自在与自为的概念？",
        "output": "SELECT ?x WHERE { <自在与自为> <提出人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《美学讲演录》的作者的代表作品有哪些？",
        "output": "SELECT ?y WHERE { <美学讲演录> <作者> ?x . ?x <代表作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请列举一些诗人哲学家。",
        "output": "SELECT ?x WHERE { ?x <职业> <诗人_（汉语词语）> . ?x <职业> <哲学家_（基础含义）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《瞧，这个人》是谁的作品？",
        "output": "SELECT ?x WHERE { <瞧，这个人> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尼采出生在什么时间？",
        "output": "SELECT ?x WHERE { <弗里德里希·威廉·尼采> <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尼采的代表作品有哪些？",
        "output": "SELECT ?x WHERE { <弗里德里希·威廉·尼采> <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德国出过哪些哲学家？",
        "output": "SELECT ?x WHERE { ?x <国籍> <德国_（德意志联邦共和国）> . ?x <职业> <哲学家_（基础含义）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些篮球运动员？",
        "output": "SELECT ?x WHERE { ?x <职业> <篮球_（球类运动）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "篮球起源于什么地方？",
        "output": "SELECT ?x WHERE { <篮球_（球类运动）> <起源地点> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《火影忍者》的作者是谁？",
        "output": "SELECT ?x WHERE { <火影忍者_（岸本齐史创作的少年漫画）> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《火影忍者》连载于哪部杂志？",
        "output": "SELECT ?x WHERE { <火影忍者_（岸本齐史创作的少年漫画）> <连载杂志> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "11月的流星是什么星座的？",
        "output": "SELECT ?x WHERE { <流星_（天文现象）> <11月> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国庆节的纪念方式有哪些？",
        "output": "SELECT ?x WHERE { <国庆节> <纪念方式> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全世界有哪些国庆节？",
        "output": "SELECT ?x WHERE { ?x <节日类型> <国庆节> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不同国家的国庆日分别在什么时间？",
        "output": "SELECT ?y WHERE { ?x <节日类型> <国庆节> . ?x <节日时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国独立日有哪些节日活动？",
        "output": "SELECT ?y WHERE { <美国独立日_（美国国庆日）> <节日活动> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《齐物论》的作者出生于何处？",
        "output": "SELECT ?y WHERE { <齐物论> <作者> ?x . ?x <出生地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"弱者道之用\"是谁的主张？",
        "output": "SELECT ?y WHERE { <弱者道之用> <作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "火影中漩涡鸣人会使用哪些忍术？",
        "output": "SELECT ?y WHERE { ?y <使用者> <漩涡鸣人> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是寄存器？",
        "output": "SELECT ?y WHERE { <寄存器> <定义> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《四书章句集注》的作者的主要成就有哪些？",
        "output": "SELECT ?y WHERE { ?x <主要作品> <四书章句集注> . ?x <主要成就> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"三段论推理\"的作者是谁？",
        "output": "SELECT ?y WHERE { <三段论推理> <创作者> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华为的董事长是谁？",
        "output": "select ?x where { <华为技术有限公司> <董事长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Porsche AG的创始人是谁？",
        "output": "select ?x where { ?y <外文名称> \"Porsche AG\" . ?y <创始人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德国有哪些著名的汽车品牌？",
        "output": "select ?x where { <德国_（德意志联邦共和国）> <汽车品牌> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "微软公司有什么软件产品？",
        "output": "select ?x where { <微软> <主要软件产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国总统奥巴马出生在什么地方？",
        "output": "select ?x where { <侯赛因_（美国总统）> <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "麻省理工学院的创建者是？",
        "output": "select ?x where { <麻省理工学院> <创办者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "舒伯特是哪国人？",
        "output": "select ?x where { <舒伯特> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"商鞅变法\"发生于哪个时代？",
        "output": "select ?x where { ?x <主要事件> \"商鞅变法\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第一部《异形》的导演是谁？",
        "output": "select ?x where { <异形_（《异形》系列电影第一部）> <导演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曲毛楼梯草的主要分布在哪？",
        "output": "select ?x where { <曲毛楼梯草> <分布区域> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汤显祖是哪个朝代的人？",
        "output": "select ?x where { <汤显祖_（中国明代戏曲家、文学家）> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "暗夜女神勒托出自哪个神话体系？",
        "output": "select ?x where { <勒托> <神话体系> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魅族CEO是谁？",
        "output": "select ?x where { <魅族_（魅族科技有限公司）> <现任ceo> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柳明珠的主要成就是什么？",
        "output": "select ?x where { <柳明珠> <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国实行什么政治制度？",
        "output": "select ?x where { <中华人民共和国> <政治体制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乌克兰的气候是什么类型？",
        "output": "select ?x where { <乌克兰> <气候> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "里奥·梅西现在效力哪只球队？",
        "output": "select ?x where { <里奥·梅西_（阿根廷足球运动员）> <所属运动队> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《山楂树之恋》是谁拍的？",
        "output": "select ?x where { <山楂树_（2010年张艺谋执导电影）> <导演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张国荣是哪里人？",
        "output": "select ?x where { <张国荣_（华语歌手、演员、音乐人）> <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布偶猫原产地在哪里？",
        "output": "select ?y where { <布偶猫_（动物）> <原产地> ?y. }"
    }
]