[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈阳市离国家地理探险家中心附近5公里内的景点都有哪些？",
        "output": "select ?y where { <国家地理探险家中心> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院提供婴儿车租赁服务吗？",
        "output": "select ?x where { <南京博物院> <是否有婴儿车租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南九天酒店内有储物柜租赁服务吗？",
        "output": "select ?x where { <思南九天温泉酒店> <是否有储物柜租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽晶酒店附近5公里的景点都有哪些？",
        "output": "select ?y where { <北京丽晶酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海皇廷世际酒店的联系方式是多少？",
        "output": "select ?x where { <上海皇廷世际酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住的是宿州国际大酒店，第二天几点前必须退房？",
        "output": "select ?time where { <宿州国际大酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "距离济南护城河最近的酒店？",
        "output": "select ?y where { <济南护城河> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "求孤山公园附近有会议室的酒店",
        "output": "select ?y where { <孤山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有充电车位> <有充电车位>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华晨宝马铁西工厂内有wifi服务吗？",
        "output": "select ?x where { <华晨宝马铁西工厂> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院附近2公里的景点有哪些？",
        "output": "select ?y where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "丽江泸沽湖景区的营业时间是多少？",
        "output": "select ?x where { <丽江泸沽湖景区> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "空中之翼航空飞行跳伞俱乐部门票多少钱？",
        "output": "select ?x where { <空中之翼航空飞行跳伞俱乐部> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京恋爱博物馆里面有没有自助的那种讲解机？",
        "output": "select ?x where { <南京恋爱博物馆> <是否有自助讲解机> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州印象星空光影艺术馆（南宋御街店）内有酒店吗？",
        "output": "select ?x where { <杭州印象星空光影艺术馆（南宋御街店）> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第一站雍和宫，第二站清华大学艺术博物馆，请问这两站相隔几公里？",
        "output": "select ?t where { <雍和宫> <附近> ?cvt. ?cvt <实体名称> <清华大学艺术博物馆>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如意湖景区是免费的吗？",
        "output": "select ?x where { <如意湖景区> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州包含几个5A级别的景点？",
        "output": "select (count(?x) as ?count_city) where { ?x <城市> <杭州>. ?x <景点的等级A> \"5A\". ?x <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园距离景山公园有多远？",
        "output": "select ?t where { <北海公园> <附近> ?cvt. ?cvt <实体名称> <景山公园>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京恋爱博物馆地址在哪？",
        "output": "select ?x where { <南京恋爱博物馆> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在天津海河附近5公里的景点中价格低于80块钱的都有？",
        "output": "select ?y where { <海河> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <天津>. ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 80) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园到北京西苑饭店的距离？",
        "output": "select ?t where { <景山公园> <附近> ?cvt. ?cvt <实体名称> <北京西苑饭店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东城5D流星雨古装星空馆什么时候对外开放？",
        "output": "select ?x where { <5D流星雨古装星空馆（东城店）> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "空中之翼航空飞行跳伞俱乐部在哪所城市？",
        "output": "select ?x where { <空中之翼航空飞行跳伞俱乐部> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京嘉里大酒店哪些房型能加床呢？",
        "output": "select ?y where { <北京嘉里大酒店> <房型名称> ?y. ?y <是否可以加床> \"可以加床\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万豪酒店最多有能住多少人的套房",
        "output": "select (max(?x) as ?max_x) where { <宁波万豪酒店> <房型名称> ?y. ?y <容纳人数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的浙江世贸君澜大饭店附近2km有啥景点可以玩吗？",
        "output": "select ?y where { <浙江世贸君澜大饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <杭州>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "想去北京瑞吉酒店附近的景点逛逛，哪个景点可以租到婴儿车呢？",
        "output": "select ?y  where { <北京瑞吉酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有婴儿车租赁> <有免费婴儿车租赁>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "时光穿越梦幻馆门票要多少钱？",
        "output": "select ?x where { <时光穿越梦幻馆（山城步道店）> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "首都大酒店支持哪些支付方式？",
        "output": "select ?x where { <首都宾馆（原首都大酒店）> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以几句话描述一下天坛公园中皇穹宇项目吗？",
        "output": "select ?x where { <天坛公园> <娱乐项目名称> <皇穹宇>. <皇穹宇> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南护城河中的亲水景区3岁孩子能玩吗？",
        "output": "select ?x where { <济南护城河> <娱乐项目名称> <亲水景区>. <亲水景区> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉的不可思议星空解压馆有什么优惠政策吗？",
        "output": "select ?x where { <不可思议星空解压馆> <城市> <武汉> . <不可思议星空解压馆> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州博物馆的春天去还是冬天去好？",
        "output": "select ?x where { <苏州博物馆> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都总府皇冠假日酒店内有网球场吗？",
        "output": "select ?x where { <成都总府皇冠假日酒店> <是否有网球场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有几个价格低于2000的喜来登酒店？",
        "output": "select (count(?x) as ?count_hotel) where {      ?x <酒店品牌名称> <喜来登>.     ?x <城市> <北京>.     ?x <平均价格> ?price.     filter(?price < 2000). }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大唐不夜城的最佳游玩时间是什么季节？",
        "output": "select ?x where { <大唐不夜城> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "4A级别的景点在沈阳有几个？",
        "output": "select (count(?x) as ?count_travel) where {      ?x <城市> <沈阳>.     ?x <景点的等级A> \"4A\". ?x <类型> <景点>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布尔津县的喀纳斯景区什么时候最适合游玩？",
        "output": "select ?x where { <喀纳斯景区> <城市> <布尔津县> .   <喀纳斯景区> <最佳游玩时间> ?x .}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香港美利酒店适合两个人住的房型有哪些",
        "output": "select ?x where { <香港美利酒店> <房型名称> ?x. ?x <容纳人数> \"2.0\"^^<http://www.w3.org/2001/XMLSchema#float>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泸沽湖市的丽江泸沽湖景区的官方门票是多少钱？",
        "output": "select ?x where { <丽江泸沽湖景区> <城市> <泸沽湖> . <丽江泸沽湖景区> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "品牌为锦江的酒店在赣州有哪几家？",
        "output": "select ?x where { ?x <城市> <赣州> . ?x <酒店品牌名称> <锦江酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不可思议星空解压馆有哪些优惠政策？",
        "output": "select ?x where { <不可思议星空解压馆> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京哪些酒店可以兑换外币",
        "output": "select ?x where { ?x <城市> <北京>. ?x <是否有外币兑换> <有外币兑换>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都香格里拉大酒店内有班车服务吗？",
        "output": "select ?x where { <成都香格里拉大酒店> <是否有班车服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆有点意思，求具体地址",
        "output": "select ?x where { <广州失恋博物馆> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园附近的酒店，没有吸烟区的",
        "output": "select ?y  where { <颐和园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有吸烟区> <无吸烟区>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚有几家天域度假品牌的酒店？",
        "output": "select (count(?x) as ?count_hotel) where {  ?x <城市> <三亚> .  ?x <酒店品牌名称> <天域度假酒店> . ?x <类型> <酒店>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "富临大酒店坐落在哪所城市？",
        "output": "select ?x where { <深圳富临大酒店> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳恒丰海悦国际酒店在香港维港凯悦尚萃酒店（原香港海汇酒店）的什么方位？",
        "output": "select ?x where { <深圳恒丰海悦国际酒店> <位于> ?cvt.  ?cvt <实体名称> <香港维港凯悦尚萃酒店（原香港海汇酒店）>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "适合在壶山温泉游玩几个小时？",
        "output": "select ?x where { <壶山温泉> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "羊卓雍措详细地址在哪？",
        "output": "select ?x where { <羊卓雍措> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中国大饭店有取款机吗？",
        "output": "select ?x where { <北京中国大饭店> <是否有自动提款机> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京励骏酒店最晚几点可以退房？",
        "output": "select ?x where { <北京励骏酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亳州市内有哪几家品牌为城市之家的酒店？",
        "output": "select ?x where { ?x <城市> <亳州> . ?x <酒店品牌名称> <城市之家> . ?x <类型> <酒店> .}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都香格里拉大酒店的入住年龄限制是什么？",
        "output": "select ?x where { <成都香格里拉大酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京颐和园附近5公里包括哪些低于1000块钱的酒店？",
        "output": "select ?y where { <颐和园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?price < 1000) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安天域凯莱大饭店中的国风雅致客房的详细类型是什么？",
        "output": "select ?g where { <西安天域凯莱大饭店>     <房型名称>      <国风雅致客房>. <国风雅致客房>  <房型详细类型> ?g. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五缘湾万嘀帆船出海俱乐部的官方门票数据是多少？",
        "output": "select ?x where { <五缘湾万嘀帆船出海俱乐部> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院在永银钱币博物馆的什么方位？",
        "output": "select ?x where { <南京博物院> <位于> ?cvt.  ?cvt <实体名称> <永银钱币博物馆>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩周围有能兑换美元的宾馆吗？",
        "output": "select ?y where { <外滩> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有外币兑换> <有外币兑换>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在东莞，5D流星雨古装星空馆附近5公里的景点？",
        "output": "select ?y where { <5D流星雨古装星空馆（东城店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <东莞>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安皇冠假日酒店附近有哪些景点可以租个储物柜放东西呢",
        "output": "select ?y  where { <西安皇冠假日酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有储物柜租赁> <有免费储物柜租赁>.  ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "富阳国际贸易中心大酒店的wifi情况？",
        "output": "select ?x where { <富阳国际贸易中心大酒店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金陵状元楼大酒店附近5公里, 且城市在南京的酒店包括哪些？",
        "output": "select ?y where { <南京金陵状元楼大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <南京>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅里雪山国家公园多少钱？",
        "output": "select ?x where { <梅里雪山国家公园> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布尔津县的喀纳斯景区人均价格是多少？",
        "output": "select ?x where { <喀纳斯景区> <城市> <布尔津县> . <喀纳斯景区> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "丽江泸沽湖景区是否免费？",
        "output": "select ?x where { <丽江泸沽湖景区> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "参观九寨沟风景区中树正瀑布对年龄身高有限制吗？",
        "output": "select ?x where { <九寨沟风景区> <娱乐项目名称> <树正瀑布>. <树正瀑布> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津独角兽星空艺术馆在哪？",
        "output": "select ?x where { <天津独角兽星空艺术馆> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京天坛公园附近5公里的景点都有哪些？",
        "output": "select ?y where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "4A的北海公园，它的门票价格是多少？",
        "output": "select ?x where { <北海公园> <景点的等级A> \"4A\" . <北海公园> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京富力万丽酒店的退房时间最晚到几点？",
        "output": "select ?x where { <北京富力万丽酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在西安隶属于威斯汀的酒店有哪些？",
        "output": "select ?x where { ?x <城市> <西安> . ?x <酒店品牌名称> <威斯汀> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "台山君海悦凤凰酒店内有外币兑换服务吗？",
        "output": "select ?x where { <台山君海悦凤凰酒店> <是否有外币兑换> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫附近哪个酒店能K歌？",
        "output": "select ?y where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有KTV> <有KTV>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金狮国际酒店的提供餐食的时间？",
        "output": "select ?x where { <金狮国际酒店> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有哪些可以泡温泉的度假酒店",
        "output": "select ?x where { ?x <城市> <北京>. ?x <是否有温泉> <有温泉>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有哪些景点在国家大剧院附近5千米附近？",
        "output": "select ?y where { <国家大剧院> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沧州阿尔卡迪亚国际酒店最晚啥时候得退房？",
        "output": "select ?time where { <沧州阿尔卡迪亚国际酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区的最佳游玩时间？什么季节最漂亮？",
        "output": "select ?x where { <九寨沟风景区> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "参与时光穿越梦幻馆（山城步道店）爱心鸟巢项目，有啥限制条件吗？",
        "output": "select ?x where { <时光穿越梦幻馆（山城步道店）> <娱乐项目名称> <爱心鸟巢>. <爱心鸟巢> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "距离西湖最近的酒店？推荐一下",
        "output": "select ?y  where { <西湖风景名胜区（西湖）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海格冲浪俱乐部有酒店吗？",
        "output": "select ?x where { <海格冲浪俱乐部> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉萨的布达拉宫淡季和旺季分别是什么时候？",
        "output": "select ?x where { <布达拉宫> <城市> <拉萨> . <布达拉宫> <淡季旺季> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津海河附近2公里酒店有什么推荐的？",
        "output": "select ?y where { <海河> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京新世纪日航饭店内有多功能厅吗？",
        "output": "select ?x where { <北京新世纪日航饭店> <是否有多功能厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沙溪古镇内有酒店吗？",
        "output": "select ?x where { <沙溪古镇> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门鼓浪湾酒店附近5公里的景点有哪些？",
        "output": "select ?y where { <厦门鼓浪湾酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京天伦王朝酒店和瑞吉酒店距离多远",
        "output": "select ?x where { <北京天伦王朝酒店> <附近> ?cvt. ?cvt <实体名称> <北京瑞吉酒店>. ?cvt <距离值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "萤火虫星空艺术馆（钟楼旗舰店）所在城市是哪？",
        "output": "select ?x where { <萤火虫星空艺术馆（钟楼旗舰店）> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "森泊幻想岛的建议游玩时长是多久？",
        "output": "select ?x where { <森泊幻想岛> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南省博物馆的联系电话是多少？",
        "output": "select ?x where { <湖南省博物馆> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津赛象酒店的早餐类型包括哪些？",
        "output": "select ?x where { <天津赛象酒店> <早餐类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国际饭店附近5公里都有哪些高于100块钱好玩的景点？",
        "output": "select ?y where { <北京国际饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>. ?y <平均价格> ?price filter(?price > 100) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淮北口子国际酒店的平均价格是多少？",
        "output": "select ?x where { <淮北口子国际大酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州孤山公园的详细地址？",
        "output": "select ?x where { <孤山公园> <城市> <杭州> . <孤山公园> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园附近有能租车的酒店吗？",
        "output": "select ?y where { <景山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有租车服务> <有租车服务>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有哪些香格里拉酒店",
        "output": "select ?x where { ?x <酒店品牌名称> <香格里拉酒店>. ?x <城市> <北京>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欧亚国际酒店入住年龄有什么限制？",
        "output": "select ?x where { <欧亚国际酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东营东胜大厦内有打保龄球的地方吗？",
        "output": "select ?x where { <东营东胜大厦> <是否有保龄球馆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孩子还小，沈阳科学宫哪些项目是没有年龄限制的？",
        "output": "select ?y where { <沈阳科学宫> <娱乐项目名称> ?y. ?y <项目限制（一般指身高年龄限制）> \"无限制\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安威斯汀大酒店内内部有高尔夫球场吗？",
        "output": "select ?x where { <西安威斯汀大酒店> <是否有高尔夫球场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "富阳国际贸易中心大酒店的电话？",
        "output": "select ?x where { <富阳国际贸易中心大酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚亚龙湾喜来登度假酒店最早几点入住？",
        "output": "select ?time where { <三亚亚龙湾喜来登度假酒店> <酒店入住开始时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "目的地是景点等级为4A的思南九天温泉酒店，请问有推荐的交通路线吗？",
        "output": "select ?x where { <思南九天温泉酒店> <景点的等级A> \"4A\" . <思南九天温泉酒店> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东北大厦中尊贵豪华城景双床房有电脑吗",
        "output": "select ?x where { <东北大厦> <房型名称> <尊贵豪华城景双床房>. <尊贵豪华悠景大床房> <电脑配置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园附近的哪些酒店能租车？",
        "output": "select ?y where { <颐和园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有租车服务> <有租车服务>.?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美丽华酒店的详细地址？",
        "output": "select ?x where { <美丽华酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛的香格里拉大酒店附近5公里有哪些景点？",
        "output": "select ?y where { <青岛香格里拉大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园位于天坛公园的什么方向？",
        "output": "select ?x where {  <颐和园> <位于> ?cvt.  ?cvt <实体名称> <天坛公园>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "4A级别的景点在博乐市有几个？",
        "output": "select (count(?x) as ?count_city) where {      ?x <城市> <博乐市>.     ?x <景点的等级A> \"4A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京首都宾馆附近5公里的景点包括哪些？准备睡醒出去溜达溜达",
        "output": "select ?y where { <首都宾馆（原首都大酒店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国贸大酒店的平均价格是多少？",
        "output": "select ?x where { <北京国贸大酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津的独角兽星空艺术馆在哪？",
        "output": "select ?x where { <天津独角兽星空艺术馆> <城市> <天津> . <天津独角兽星空艺术馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南华天大酒店内有邮政服务吗？",
        "output": "select ?x where { <湖南华天大酒店> <是否有邮政服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京爱情博物展新街口总店里面的夕阳剪影的项目描述是什么？",
        "output": "select ?x where { <南京爱情博物展（新街口总店）> <娱乐项目名称> <夕阳剪影>. <夕阳剪影> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "4A景山公园，官网多少",
        "output": "select ?x where { <景山公园> <景点的等级A> \"4A\". <景山公园> <景点官方网站> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国宾酒店到景山公园有多远呀？明天睡醒准备去玩",
        "output": "select ?t where { <北京国宾酒店> <附近> ?cvt. ?cvt <实体名称> <景山公园>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京华侨大厦在哪",
        "output": "select ?x where { <北京华侨大厦> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长沙运达喜来登酒店几点能吃上饭？",
        "output": "select ?x where { <长沙运达喜来登酒店> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕田峪长城门票多少钱？",
        "output": "select ?x where { <慕田峪长城> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物馆周边还有哪些可以玩的景点",
        "output": "select ?x where { <南京博物院> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩附近哪些酒店有租车服务？",
        "output": "select ?y where { <外滩> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有租车服务> <有租车服务>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "坐落在上海的魔都星空艺术馆建议游玩几个小时？",
        "output": "select ?x where { <魔都星空艺术馆> <城市> <上海> . <魔都星空艺术馆> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫的优惠政策是什么？",
        "output": "select ?x where { <布达拉宫> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在北京金融街威斯汀大酒店附近1公里价格高于2k的高端酒店包括哪些？",
        "output": "select ?y where { <北京金融街威斯汀大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?price > 2000) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉新世界酒店附近5公里的景点有哪些？",
        "output": "select ?y where { <武汉新世界酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大庆市博物馆的景区等级是多少？",
        "output": "select ?x where { <大庆市博物馆> <景点的等级A> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚国光豪生度假酒店价格贵吗，平均多少钱？",
        "output": "select ?x where { <三亚国光豪生度假酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在杭州，孤山公园附近5公里的景点包括哪些？",
        "output": "select ?y where { <孤山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京颐和园的平均价格是多少？",
        "output": "select ?x where { <颐和园> <城市> <北京> . <颐和园> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "昆山瑞士大酒店的联系电话是多少？",
        "output": "select ?x where { <昆山瑞士大酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泉州酒店的退房时间是几点？",
        "output": "select ?x where { <泉州酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赛里木湖风景名胜区的湖心情侣什么时候开放？",
        "output": "select ?x where { <赛里木湖风景名胜区> <娱乐项目名称> <湖心情侣>. <湖心情侣> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安钟楼附近的萤火虫星空艺术馆附近5公里的景点有哪些？",
        "output": "select ?y where { <萤火虫星空艺术馆（钟楼旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚红色娘子军演艺公园军人有优惠吗？",
        "output": "select ?x where { <三亚红色娘子军演艺公园> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淮北口子国际大酒店的可以最晚几点退房？",
        "output": "select ?x where { <淮北口子国际大酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梵高星空美术馆（江汉路旗舰店）有婴儿车租赁服务吗？",
        "output": "select ?x where { <梵高星空美术馆（江汉路旗舰店）> <是否有婴儿车租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在长沙中维神农大酒店住一晚，平均价格是多少？",
        "output": "select ?x where { <长沙中维神农大酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "身上还有100块钱，北京首都宾馆附近5公里的景点包括哪些？准备睡醒出去溜达溜达",
        "output": "select ?y where { <首都宾馆（原首都大酒店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 100) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安天域凯莱大饭店中凯莱家庭客房可以加床吗？",
        "output": "select ?x where { <西安天域凯莱大饭店> <房型名称> <凯莱家庭客房>. <凯莱家庭客房> <是否可以加床> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冈仁波齐内有停车场吗？",
        "output": "select ?x where { <冈仁波齐> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "余姚阳明温泉山庄的平均价格是多少？",
        "output": "select ?x where { <余姚阳明温泉山庄> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孤山公园几个小时能够全部游玩结束？",
        "output": "select ?x where { <孤山公园> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳星河丽思卡尔顿酒店内有礼宾服务吗？",
        "output": "select ?x where { <深圳星河丽思卡尔顿酒店> <是否有礼宾服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江汉路梵高星空美术馆的详细地址在哪？",
        "output": "select ?x where { <梵高星空美术馆（江汉路旗舰店）> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玩完沈阳科学宫身上还有60块钱，想去附近的景点去继续玩，请问附近5公里的景点包括什么？",
        "output": "select ?y where { <沈阳科学宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>. ?y <平均价格> ?price filter(?price < 60) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在北京长城饭店附近5公里的酒店中高于3000块钱的有哪些？",
        "output": "select ?y where { <北京长城饭店（原北京喜来登长城饭店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5).?y <类型> <酒店>. ?y <平均价格> ?price. filter(?price > 3000) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长春开元名都大酒店内有吸烟区吗？",
        "output": "select ?x where { <长春开元名都大酒店> <是否有吸烟区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "想去参观颐和园昆明湖，请问该景点对年龄和身高有什么限制吗？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <昆明湖>. <昆明湖> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "厦门星空艺术馆在日月谷渡假村的什么方向？",
        "output": "select ?x where { <厦门星空艺术馆> <位于> ?cvt. ?cvt <实体名称> <厦门日月谷温泉渡假村>. ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从北京金隅喜来登大酒店到奥林匹克森林公园有多远？",
        "output": "select ?t where { <北京金隅喜来登大酒店> <附近> ?cvt. ?cvt <实体名称> <奥林匹克森林公园>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "离钟楼最近的那家萤火虫星空艺术馆最近的酒店叫什么？",
        "output": "select ?y where { <萤火虫星空艺术馆（钟楼旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "森泊幻想岛的优惠政策是啥？",
        "output": "select ?x where { <森泊幻想岛> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中奥马哥孛罗大酒店最晚几点退房？",
        "output": "select ?x where { <北京中奥马哥孛罗大酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳好日子皇冠假日酒店在什么地方？",
        "output": "select ?x where { <深圳好日子皇冠假日酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纳木错国家风景区的官方价格是多少？",
        "output": "select ?x where { <纳木错国家风景区> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚到乌鲁木齐城市，住在了乌鲁木齐西北石油酒店，请问附近1公里的酒店有哪些啊？想去逛逛",
        "output": "select ?y where { <乌鲁木齐西北石油酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <乌鲁木齐>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在宜春,且酒店品牌为维景国际的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <宜春> . ?x <酒店品牌名称> <维景国际> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巅峰乐园有哪些游玩项目",
        "output": "select ?x where { <重庆·巅峰乐园> <娱乐项目名称> ?x. }"
    }
]