[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查项目对于检测盗汗、关节疼痛以及消瘦这些症状有效？",
        "output": "select ?x where { ?x <涉及症状> <盗汗> . ?x <涉及症状> <关节疼痛> . ?x <涉及症状> <消瘦> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目可以检测出关节疼痛、消瘦和肝肿大这些症状？",
        "output": "select ?x where { ?x <涉及症状> <关节疼痛> . ?x <涉及症状> <消瘦> . ?x <涉及症状> <肝肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现消瘦、肝肿大以及淋巴结结核症状时，需要做哪一项检查？",
        "output": "select ?x where { ?x <涉及症状> <消瘦> . ?x <涉及症状> <肝肿大> . ?x <涉及症状> <淋巴结结核> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查能测定肝肿大、淋巴结结核和持续性弛张热这些症状？",
        "output": "select ?x where { ?x <涉及症状> <肝肿大> . ?x <涉及症状> <淋巴结结核> . ?x <涉及症状> <持续性弛张热> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于持续性弛张热、浅表淋巴结进行性肿大和浅表淋巴结肿大症状要靠哪项检查进行检测？",
        "output": "select ?x where { ?x <涉及症状> <持续性弛张热> . ?x <涉及症状> <浅表淋巴结进行性肿大> . ?x <涉及症状> <浅表淋巴结肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在出现浅表淋巴结进行性肿大、浅表淋巴结肿大，而且得了水痘的情况下应该做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <浅表淋巴结进行性肿大> . ?x <涉及症状> <浅表淋巴结肿大> . ?x <涉及疾病> <水痘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么样的检查项目对检测水痘、病毒性肝炎以及白血病有作用？",
        "output": "select ?x where { ?x <涉及疾病> <水痘> . ?x <涉及疾病> <病毒性肝炎> . ?x <涉及疾病> <白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目能测定病毒性肝炎、白血病以及联合免疫缺陷病？",
        "output": "select ?x where { ?x <涉及疾病> <病毒性肝炎> . ?x <涉及疾病> <白血病> . ?x <涉及疾病> <联合免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查适合检测联合免疫缺陷病、风疹以及麻疹这些疾病？",
        "output": "select ?x where { ?x <涉及疾病> <联合免疫缺陷病> . ?x <涉及疾病> <风疹> . ?x <涉及疾病> <麻疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有风疹、麻疹和布鲁氏菌病可以做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <风疹> . ?x <涉及疾病> <麻疹> . ?x <涉及疾病> <布鲁氏菌病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么样的检查能检测麻疹、布鲁氏菌病和小儿原发性免疫缺陷病？",
        "output": "select ?x where { ?x <涉及疾病> <麻疹> . ?x <涉及疾病> <布鲁氏菌病> . ?x <涉及疾病> <小儿原发性免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了布鲁氏菌病、小儿原发性免疫缺陷病和小儿发烧，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <布鲁氏菌病> . ?x <涉及疾病> <小儿原发性免疫缺陷病> . ?x <涉及疾病> <小儿发烧> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一种能检查出小儿原发性免疫缺陷病、小儿发烧和抗体免疫缺陷病？",
        "output": "select ?x where { ?x <涉及疾病> <小儿原发性免疫缺陷病> . ?x <涉及疾病> <小儿发烧> . ?x <涉及疾病> <抗体免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查项目可以测定小儿发烧、抗体免疫缺陷病和慢性肾上腺皮质功能减退症？",
        "output": "select ?x where { ?x <涉及疾病> <小儿发烧> . ?x <涉及疾病> <抗体免疫缺陷病> . ?x <涉及疾病> <慢性肾上腺皮质功能减退症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查项目能检测抗体免疫缺陷病、慢性肾上腺皮质功能减退症和免疫机能障碍？",
        "output": "select ?x where { ?x <涉及疾病> <抗体免疫缺陷病> . ?x <涉及疾病> <慢性肾上腺皮质功能减退症> . ?x <涉及疾病> <免疫机能障碍> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查对检测免疫机能障碍、慢性粒单核细胞白血病和获得性免疫缺陷综合征有效？",
        "output": "select ?x where { ?x <涉及疾病> <免疫机能障碍> . ?x <涉及疾病> <慢性粒单核细胞白血病> . ?x <涉及疾病> <获得性免疫缺陷综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目能检查出慢性粒单核细胞白血病、获得性免疫缺陷综合征和小儿非霍奇金淋巴瘤？",
        "output": "select ?x where { ?x <涉及疾病> <慢性粒单核细胞白血病> . ?x <涉及疾病> <获得性免疫缺陷综合征> . ?x <涉及疾病> <小儿非霍奇金淋巴瘤> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了获得性免疫缺陷综合征、小儿非霍奇金淋巴瘤和布氏菌病，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <获得性免疫缺陷综合征> . ?x <涉及疾病> <小儿非霍奇金淋巴瘤> . ?x <涉及疾病> <布氏菌病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一种能检测小儿非霍奇金淋巴瘤、布氏菌病和慢性骨髓单核细胞性白血病？",
        "output": "select ?x where { ?x <涉及疾病> <小儿非霍奇金淋巴瘤> . ?x <涉及疾病> <布氏菌病> . ?x <涉及疾病> <慢性骨髓单核细胞性白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查对检测慢性骨髓单核细胞性白血病、原发性免疫缺陷病和大水疱形成有效？",
        "output": "select ?x where { ?x <涉及疾病> <慢性骨髓单核细胞性白血病> . ?x <涉及疾病> <原发性免疫缺陷病> . ?x <涉及疾病> <大水疱形成> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有原发性免疫缺陷病、大水疱形成和德国麻疹，应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <原发性免疫缺陷病> . ?x <涉及疾病> <大水疱形成> . ?x <涉及疾病> <德国麻疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目对检测大水疱形成、德国麻疹和修饰后麻疹有作用？",
        "output": "select ?x where { ?x <涉及疾病> <大水疱形成> . ?x <涉及疾病> <德国麻疹> . ?x <涉及疾病> <修饰后麻疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查项目能检查出德国麻疹、修饰后麻疹和先天性免疫缺陷病？",
        "output": "select ?x where { ?x <涉及疾病> <德国麻疹> . ?x <涉及疾病> <修饰后麻疹> . ?x <涉及疾病> <先天性免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了修饰后麻疹、先天性免疫缺陷病和幼年型粒-单核细胞白血病需要做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <修饰后麻疹> . ?x <涉及疾病> <先天性免疫缺陷病> . ?x <涉及疾病> <幼年型粒-单核细胞白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对于检测先天性免疫缺陷病、幼年型粒-单核细胞白血病和艾迪生病是有效的？",
        "output": "select ?x where { ?x <涉及疾病> <先天性免疫缺陷病> . ?x <涉及疾病> <幼年型粒-单核细胞白血病> . ?x <涉及疾病> <艾迪生病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在患有幼年型粒-单核细胞白血病、艾迪生病以及急性淋巴细胞性白血病时应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <幼年型粒-单核细胞白血病> . ?x <涉及疾病> <艾迪生病> . ?x <涉及疾病> <急性淋巴细胞性白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查可以检测出艾迪生病、急性淋巴细胞性白血病和骨髓单核细胞白血病？",
        "output": "select ?x where { ?x <涉及疾病> <艾迪生病> . ?x <涉及疾病> <急性淋巴细胞性白血病> . ?x <涉及疾病> <骨髓单核细胞白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查项目对于检测急性淋巴细胞性白血病、骨髓单核细胞白血病和水痘-带状疱疹性葡萄膜炎有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <急性淋巴细胞性白血病> . ?x <涉及疾病> <骨髓单核细胞白血病> . ?x <涉及疾病> <水痘-带状疱疹性葡萄膜炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查能检查出骨髓单核细胞白血病、水痘-带状疱疹性葡萄膜炎和老年人流行性感冒？",
        "output": "select ?x where { ?x <涉及疾病> <骨髓单核细胞白血病> . ?x <涉及疾病> <水痘-带状疱疹性葡萄膜炎> . ?x <涉及疾病> <老年人流行性感冒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有水痘-带状疱疹性葡萄膜炎、老年人流行性感冒和皮下T细胞淋巴瘤，需要去做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <水痘-带状疱疹性葡萄膜炎> . ?x <涉及疾病> <老年人流行性感冒> . ?x <涉及疾病> <皮下T细胞淋巴瘤> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查能检测出血尿伴蛋白尿、血红蛋白尿和胸痛这些症状？",
        "output": "select ?x where { ?x <涉及症状> <血尿伴蛋白尿> . ?x <涉及症状> <血红蛋白尿> . ?x <涉及症状> <胸痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病人出现血红蛋白尿、胸痛和肢体的非凹性水肿症状时，应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及症状> <血红蛋白尿> . ?x <涉及症状> <胸痛> . ?x <涉及症状> <肢体的非凹性水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查对检测胸痛、肢体的非凹性水肿和剧烈运动或强体力劳动后血尿有效？",
        "output": "select ?x where { ?x <涉及症状> <胸痛> . ?x <涉及症状> <肢体的非凹性水肿> . ?x <涉及症状> <剧烈运动或强体力劳动后血尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项医学检查可以有效检测肢体的非凹性水肿、剧烈运动或强体力劳动后血尿和不稳定性心绞痛这些症状？",
        "output": "select ?x where { ?x <涉及症状> <肢体的非凹性水肿> . ?x <涉及症状> <剧烈运动或强体力劳动后血尿> . ?x <涉及症状> <不稳定性心绞痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于出现的剧烈运动或强体力劳动后血尿、不稳定性心绞和一过性肉眼血尿这些症状，可以通过怎样的检查项目检测病情？",
        "output": "select ?x where { ?x <涉及症状> <剧烈运动或强体力劳动后血尿> . ?x <涉及症状> <不稳定性心绞痛> . ?x <涉及症状> <一过性肉眼血尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查项目能检查出不稳定性心绞痛、一过性肉眼血尿和血尿伴排尿不畅症状的发生？",
        "output": "select ?x where { ?x <涉及症状> <不稳定性心绞痛> . ?x <涉及症状> <一过性肉眼血尿> . ?x <涉及症状> <血尿伴排尿不畅> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现一过性肉眼血尿、血尿伴排尿不畅和间歇性血尿时需要做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <一过性肉眼血尿> . ?x <涉及症状> <血尿伴排尿不畅> . ?x <涉及症状> <间歇性血尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查能有效检测血尿伴排尿不畅、间歇性血尿和遗传性粪卟啉病症状的发生？",
        "output": "select ?x where { ?x <涉及症状> <血尿伴排尿不畅> . ?x <涉及症状> <间歇性血尿> . ?x <涉及疾病> <遗传性粪卟啉病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查能有效检测出遗传性粪卟啉病、小儿急性间歇性卟啉病和混合型卟啉病？",
        "output": "select ?x where { ?x <涉及疾病> <遗传性粪卟啉病> . ?x <涉及疾病> <小儿急性间歇性卟啉病> . ?x <涉及疾病> <混合型卟啉病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了小儿急性间歇性卟啉病、混合型卟啉病和皮肌炎应该做怎样的检查？",
        "output": "select ?x where { ?x <涉及疾病> <小儿急性间歇性卟啉病> . ?x <涉及疾病> <混合型卟啉病> . ?x <涉及疾病> <皮肌炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查能检测出混合型卟啉病、皮肌炎和心肌梗死？",
        "output": "select ?x where { ?x <涉及疾病> <混合型卟啉病> . ?x <涉及疾病> <皮肌炎> . ?x <涉及疾病> <心肌梗死> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对检测皮肌炎、心肌梗死和原卟啉病比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <皮肌炎> . ?x <涉及疾病> <心肌梗死> . ?x <涉及疾病> <原卟啉病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有心肌梗死、原卟啉病和红细胞生成性卟啉病，这时候需要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <心肌梗死> . ?x <涉及疾病> <原卟啉病> . ?x <涉及疾病> <红细胞生成性卟啉病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项医学检查能对心肌梗死、不稳定型心绞痛和小儿病毒性心肌炎做出检测？",
        "output": "select ?x where { ?x <涉及疾病> <心肌梗死> . ?x <涉及疾病> <不稳定型心绞痛> . ?x <涉及疾病> <小儿病毒性心肌炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一项会对小儿病毒性心肌炎、老年人稳定型心绞痛和先兆型梗塞做出有效的检测？",
        "output": "select ?x where { ?x <涉及疾病> <小儿病毒性心肌炎> . ?x <涉及疾病> <老年人稳定型心绞痛> . ?x <涉及疾病> <先兆型梗塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查项目可以检查出老年人稳定型心绞痛、先兆型梗塞和缺血性胸痛？",
        "output": "select ?x where { ?x <涉及疾病> <老年人稳定型心绞痛> . ?x <涉及疾病> <先兆型梗塞> . ?x <涉及疾病> <缺血性胸痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查能检查出先兆型梗塞、缺血性胸痛和老年人变异型心绞痛？",
        "output": "select ?x where { ?x <涉及疾病> <先兆型梗塞> . ?x <涉及疾病> <缺血性胸痛> . ?x <涉及疾病> <老年人变异型心绞痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于检测缺血性胸痛、老年人变异型心绞痛和缺血性心脏病，哪一项检查是有作用的？",
        "output": "select ?x where { ?x <涉及疾病> <缺血性胸痛> . ?x <涉及疾病> <老年人变异型心绞痛> . ?x <涉及疾病> <缺血性心脏病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在患者出现传导性耳聋、外耳道癣和副耳这些症状时，应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及症状> <传导性耳聋> . ?x <涉及症状> <外耳道癣> . ?x <涉及症状> <副耳> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项医学检查能对嗌塞、幻味和单侧鼻腔阻塞病症做出检测？",
        "output": "select ?x where { ?x <涉及症状> <嗌塞> . ?x <涉及症状> <幻味> . ?x <涉及症状> <单侧鼻腔阻塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查能对幻味、单侧鼻腔阻塞和耳闷症状做出有效的检测？",
        "output": "select ?x where { ?x <涉及症状> <幻味> . ?x <涉及症状> <单侧鼻腔阻塞> . ?x <涉及症状> <耳闷> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现单侧鼻腔阻塞、耳闷和耳廓癣症状，应该做哪项检查合适？",
        "output": "select ?x where { ?x <涉及症状> <单侧鼻腔阻塞> . ?x <涉及症状> <耳闷> . ?x <涉及症状> <耳廓癣> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查项目对检测耳闷、耳廓癣和耳痛症状有作用？",
        "output": "select ?x where { ?x <涉及症状> <耳闷> . ?x <涉及症状> <耳廓癣> . ?x <涉及症状> <耳痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查可以测定耳廓癣、耳痛以及咽痛这些症状？",
        "output": "select ?x where { ?x <涉及症状> <耳廓癣> . ?x <涉及症状> <耳痛> . ?x <涉及症状> <咽痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在伴有耳痛、咽痛和蠕动感这些症状时，需要做哪一项检查？",
        "output": "select ?x where { ?x <涉及症状> <耳痛> . ?x <涉及症状> <咽痛> . ?x <涉及症状> <蠕动感> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者咽痛、打喷嚏且有蠕动感，做哪项检查是有用的？",
        "output": "select ?x where { ?x <涉及症状> <咽痛> . ?x <涉及症状> <蠕动感> . ?x <涉及症状> <打喷嚏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查可以检测蠕动感、打喷嚏和鼻溢液这些症状？",
        "output": "select ?x where { ?x <涉及症状> <蠕动感> . ?x <涉及症状> <打喷嚏> . ?x <涉及症状> <鼻溢液> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目对检测打喷嚏、鼻溢液和咳痰有效？",
        "output": "select ?x where { ?x <涉及症状> <打喷嚏> . ?x <涉及症状> <鼻溢液> . ?x <涉及症状> <咳痰> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查项目能检测到鼻溢液、咳痰和耳内流脓症状？",
        "output": "select ?x where { ?x <涉及症状> <鼻溢液> . ?x <涉及症状> <咳痰> . ?x <涉及症状> <耳内流脓> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，出现咳痰、耳内流脓和听力减退适宜做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <咳痰> . ?x <涉及症状> <耳内流脓> . ?x <涉及症状> <听力减退> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现耳内流脓、听力减退以及血性耳漏病症时。要做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <耳内流脓> . ?x <涉及症状> <听力减退> . ?x <涉及症状> <血性耳漏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于涉及到的耳溢液、歪鼻和腮腺区肿大症状，去做哪项相关检查比较有效？",
        "output": "select ?x where { ?x <涉及症状> <耳溢液> . ?x <涉及症状> <歪鼻> . ?x <涉及症状> <腮腺区肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "做什么检查可以检测腮腺区肿大、咽部溃疡和搏动性耳鸣症状？",
        "output": "select ?x where { ?x <涉及症状> <腮腺区肿大> . ?x <涉及症状> <咽部溃疡> . ?x <涉及症状> <搏动性耳鸣> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于咽部溃疡、搏动性耳鸣和发作性咳嗽的症状，需要做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <咽部溃疡> . ?x <涉及症状> <搏动性耳鸣> . ?x <涉及症状> <发作性咳嗽> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查可以检测搏动性耳鸣、发作性咳嗽和咽部异物感？",
        "output": "select ?x where { ?x <涉及症状> <搏动性耳鸣> . ?x <涉及症状> <发作性咳嗽> . ?x <涉及症状> <咽部异物感> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有什么检查项目可以检测出发作性咳嗽、咽部异物感和耳廓腹侧面局限性囊肿这些症状？",
        "output": "select ?x where { ?x <涉及症状> <发作性咳嗽> . ?x <涉及症状> <咽部异物感> . ?x <涉及症状> <耳廓腹侧面局限性囊肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查能对咽部异物感、耳廓腹侧面局限性囊肿以及耳硬化症做出检测？",
        "output": "select ?x where { ?x <涉及症状> <咽部异物感> . ?x <涉及症状> <耳廓腹侧面局限性囊肿> . ?x <涉及症状> <耳硬化症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查项目能检测出耳廓腹侧面局限性囊肿、耳硬化症和耳骨外翻的症状？",
        "output": "select ?x where { ?x <涉及症状> <耳廓腹侧面局限性囊肿> . ?x <涉及症状> <耳硬化症> . ?x <涉及症状> <耳骨外翻> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现耳硬化症、耳骨外翻和传导性耳鸣症状时，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <耳硬化症> . ?x <涉及症状> <耳骨外翻> . ?x <涉及症状> <传导性耳鸣> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了中毒性休克综合征、小儿呼吸道合胞病毒肺炎和小儿肺炎疾病时，做哪项检查比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <中毒性休克综合征> . ?x <涉及疾病> <小儿呼吸道合胞病毒肺炎> . ?x <涉及疾病> <小儿肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查与检测休克型肺炎、重症急性呼吸综合征和光气中毒有关？",
        "output": "select ?x where { ?x <涉及疾病> <休克型肺炎> . ?x <涉及疾病> <重症急性呼吸综合征> . ?x <涉及疾病> <光气中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查可以检测出重症急性呼吸综合征、光气中毒和慢性呼吸衰竭？",
        "output": "select ?x where { ?x <涉及疾病> <重症急性呼吸综合征> . ?x <涉及疾病> <光气中毒> . ?x <涉及疾病> <慢性呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有光气中毒、慢性呼吸衰竭和肺泡蛋白沉着症时，应该做哪种检查项目？",
        "output": "select ?x where { ?x <涉及疾病> <光气中毒> . ?x <涉及疾病> <慢性呼吸衰竭> . ?x <涉及疾病> <肺泡蛋白沉着症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当得了慢性呼吸衰竭、肺泡蛋白沉着症和气胸这些疾病时，哪一项检查项目是有必要考虑的？",
        "output": "select ?x where { ?x <涉及疾病> <慢性呼吸衰竭> . ?x <涉及疾病> <肺泡蛋白沉着症> . ?x <涉及疾病> <气胸> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "能检测肺泡蛋白沉着症、气胸和特发性间质性肺炎这些疾病的检查是什么？",
        "output": "select ?x where { ?x <涉及疾病> <肺泡蛋白沉着症> . ?x <涉及疾病> <气胸> . ?x <涉及疾病> <特发性间质性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对于测定气胸、特发性间质性肺炎和动脉硬化性血管病比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <气胸> . ?x <涉及疾病> <特发性间质性肺炎> . ?x <涉及疾病> <动脉硬化性血管病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了特发性间质性肺炎、动脉硬化性血管病和中毒性肺炎的患者应该去做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <特发性间质性肺炎> . ?x <涉及疾病> <动脉硬化性血管病> . ?x <涉及疾病> <中毒性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有怎样的检查项目能对中毒性肺炎、老年人慢性阻塞性肺疾病以及新生儿呼吸暂停做出检测？",
        "output": "select ?x where { ?x <涉及疾病> <中毒性肺炎> . ?x <涉及疾病> <老年人慢性阻塞性肺疾病> . ?x <涉及疾病> <新生儿呼吸暂停> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有老年人慢性阻塞性肺疾病、新生儿呼吸暂停和先天性肺动静脉瘘这些疾病时，应该去做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <老年人慢性阻塞性肺疾病> . ?x <涉及疾病> <新生儿呼吸暂停> . ?x <涉及疾病> <先天性肺动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有什么样的检查项目能检测新生儿呼吸暂停、先天性肺动静脉瘘和老年人急性呼吸窘迫综合征这些疾病？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿呼吸暂停> . ?x <涉及疾病> <先天性肺动静脉瘘> . ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证监会主席哪一年出生",
        "output": "select distinct ?x where { <证监会> <主席> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现任证监会主席是什么民族的？",
        "output": "select distinct ?x where { <证监会> <主席> ?y. ?y <民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现任证监会主席是什么学历？",
        "output": "select ?x where { <证监会> <主席> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银监会主席哪一年出生",
        "output": "select ?x where { <银监会> <主席> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现任银监会主席是什么民族的？",
        "output": "select ?x where { <银监会> <主席> ?y. ?y <民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "现任银监会主席是什么学历？",
        "output": "select ?x where { <银监会> <主席> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万达董事长哪一年生的",
        "output": "select ?x where { <万达> <董事长> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万达董事长的儿子是谁？",
        "output": "select ?x where { <万达> <董事长> ?y. ?y <儿子> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿里巴巴董事局主席的故乡在哪？",
        "output": "select ?x where { <阿里巴巴> <董事局主席> ?y. ?y <家乡所在地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "顺丰董事长名下有多少家企业？",
        "output": "select ?x where { <顺丰控股> <董事长> ?y. ?y <参股公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方科技的董事长有多少家关联企业？",
        "output": "select ?x where { <京东方科技集团股份有限公司> <董事长> ?y. ?y <参股公司数量> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方科技集团股份有限公司的董秘有多少关联企业",
        "output": "select ?x where { <京东方科技集团股份有限公司> <公司董秘> ?y. ?y <关联公司数量> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方A的董事长是什么学历？",
        "output": "select ?x where { <京东方A> <董事长> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魔性诱惑的主演是哪国人？",
        "output": "select ?x where { <魔性诱惑> <主演> ?y . ?y <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下北阳光灿烂的日子主演是什么星座？",
        "output": "select ?x where { <下北阳光灿烂的日子> <主演> ?y . ?y <星座> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "用风筝吸引雷电的科学家是哪国人？",
        "output": "select ?x where { ?y <主要成就> \"用风筝吸引雷电对电进行了探索\" . ?y <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《穷理查年鉴》的作者逝世于是哪天？",
        "output": "select ?x where { ?y <代表作品> <穷理查年鉴> . ?y <逝世日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴勃罗·鲁伊斯·毕加索外文名叫什么？",
        "output": "select ?x where { ?y <中文名> \"巴勃罗·鲁伊斯·毕加索\" . ?y <外文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《哭泣的女人》的作者出生于哪天？",
        "output": "select ?x where { <哭泣的女人_（毕加索创作油画）> <作者> ?y . ?y <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嬴政出生于中国哪个省份？",
        "output": "select ?x where { ?y <中文名> \"嬴政\" . ?y <出生地> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嬴政信仰哪家学派？",
        "output": "select ?x where { ?y <中文名> \"嬴政\" . ?y <信仰> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "让车同轨，书同文的是中国哪位皇帝？",
        "output": "select ?x where { ?x <主要成就> \"车同轨\" . ?x <主要成就> \"书同文\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李星辰出生于哪一年？",
        "output": "select ?x where { <李星辰> <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "火星的质量？",
        "output": "select ?x where { <火星_（太阳系八大行星之一）> <质量> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为\"小飞侠\"的是哪位著名篮球运动员？",
        "output": "select ?x where { ?x <别名> \"小飞侠，\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"小飞侠\"身穿多少号球衣？",
        "output": "select ?x where { ?y <别名> \"小飞侠，\" . ?y <球衣号码> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"小飞侠\"的父亲是哪位篮球运动员？",
        "output": "select ?x where { ?y <别名> \"小飞侠，\" . ?y <父亲> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"小飞侠\"出生州的州长是谁？",
        "output": "select ?x where { ?y <别名> \"小飞侠，\" . ?y <出生地> ?z . ?z <现任州长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"黑曼巴\"的妻子是谁？",
        "output": "select ?x where { ?y <别名> \"黑曼巴\" . ?y <妻子> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"独立宣言\"的签署日期？",
        "output": "select ?x where { <独立宣言_（美国立国文书之一）> <签署日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"独立宣言\"的批准地点？",
        "output": "select ?x where { <独立宣言_（美国立国文书之一）> <批准地点> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沁园春雪的作者的毕业院校是？",
        "output": "select ?x where { <沁园春·雪> <作者> ?y . ?y <毕业院校> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"雄关漫道真如铁，而今迈步从头越\"的作者的出生地？",
        "output": "select ?x where { <雄关漫道真如铁，而今迈步从头越> <作者> ?y . ?y <出生地> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"人间正道是沧桑\"的作者是谁？",
        "output": "select ?x where { <人间正道是沧桑_（毛泽东诗句）> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "是谁提出了\"韬奋精神\"？",
        "output": "select ?x where { <韬奋精神> <作者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界上第一台计算机叫什么名字？",
        "output": "select ?x where { <计算机> <第一台计算机> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老虎在动物分类里属于哪个科？",
        "output": "select ?x where { <虎_（大型猫科动物）> <科> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老虎的拉丁学名叫什么？",
        "output": "select ?x where { <虎_（大型猫科动物）> <拉丁学名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老虎在生物学分类里属于哪个属？",
        "output": "select ?x where { <虎_（大型猫科动物）> <属> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《功夫》的男主角的外文名是什么？",
        "output": "select ?x where { ?y <代表作品> <功夫_（2004年周星驰主演电影）> . ?y <外文名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周星驰的籍贯是哪里？",
        "output": "select ?x where { <周星驰> <籍贯> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周星驰的别名有哪些？",
        "output": "select ?x where { <周星驰> <别名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "逃学威龙2的主演的身高多少？",
        "output": "select ?x where { <逃学威龙2> <主演> ?y . ?y <身高> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "功夫的主演是谁？",
        "output": "select ?x where { <功夫_（2004年周星驰主演电影）> <主演> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水浒传的别名有哪些？",
        "output": "select ?x where { <水浒传_（中国古典长篇小说，四大名著之一）> <作品别名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学校歌是由谁创作的？",
        "output": "select ?x where { <北京大学校歌> <作者> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贾宝玉是哪本书里的角色？",
        "output": "select ?x where { <贾宝玉_（红楼梦人物）> <登场作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嫦娥的丈夫的主要成就是什么？",
        "output": "select ?y where { ?x <主要成就> ?y . ?x <配偶> <嫦娥_（中国上古神话传说人物）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "妲己是谁的女儿？",
        "output": "select ?x where { ?x <子女> <妲己_（商纣王妃子）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "畿服制始于哪个朝代？",
        "output": "select ?x where { <畿服制> <朝代> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "兵圣的主要成就有哪些？",
        "output": "select ?y where { ?x <别称> <兵圣_（东方兵圣孙武）> . ?x <主要成就> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名的长平之战发生于我国哪个历史时期？",
        "output": "select ?x where { ?x <主要战役> <长平之战_（战役名称）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"成败一知己，生死两妇人\"所说的人物有什么重大成就？",
        "output": "select ?y where { <成败一知己，生死两妇人> <主要人物> ?x . ?x <主要成就> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "葬于茂陵的皇帝在位于哪段时间？",
        "output": "select ?y where { ?x <陵墓> <茂陵_（汉武帝陵寝）> . ?x <在位时间> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"光武中兴\"说的是哪位皇帝？",
        "output": "select ?x where { <光武中兴> <相关人物> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李清照丈夫的代表作品是什么？",
        "output": "select ?y where { <李清照_（宋代女词人）> <配偶> ?x . ?x <代表作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"兰陵王\"是对谁的尊称？",
        "output": "select ?x where { <兰陵王_（北齐徐州兰陵郡王）> <本名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《西厢记》又名什么？",
        "output": "select ?x where { <西厢记_（元代王实甫著古典戏剧）> <又名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "白炽灯是哪国人发明的？",
        "output": "select ?y where { <白炽灯> <发明者> ?x . ?x <国籍> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "薛宝钗的哥哥外号叫什么？",
        "output": "select ?y where { ?x <妹妹> <薛宝钗> . ?x <别名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "历史上的秦桧是哪里人？",
        "output": "select ?x where { <秦桧_（南宋著名奸臣）> <出生地> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "严嵩的儿子人称？",
        "output": "select ?y where { <严嵩> <儿子> ?x . ?x <别称> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《西游记》中孙悟空的兵器叫什么？",
        "output": "select ?x where { <孙悟空_（古典名著《西游记》中的主角）> <兵器> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《红楼梦》中贾兰母亲的住所是哪里？",
        "output": "select ?y where { <贾兰_（小说《红楼梦》人物）> <母亲> ?x . ?x <居所> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唐太宗李世民的年号是什么？",
        "output": "select ?x where { <李世民_（唐太宗）> <年号> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东坡肉的发明人死后谥号为？",
        "output": "select ?y where { <东坡肉> <创制人> ?x . ?x <谥号> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《红楼梦》中贾琏妻子的丫鬟是谁？",
        "output": "select ?y where { ?x <丈夫> <贾琏_（小说《红楼梦》人物）> . ?x <丫鬟> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乐山大佛始建于哪一年？",
        "output": "select ?x where { <乐山大佛> <开凿时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "木牛流马的发明者有哪些文学代表作？",
        "output": "select ?y where { <木牛流马_（诸葛亮发明的运粮工具）> <发明者> ?x . ?x <代表作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁创立了关宁铁骑？",
        "output": "select ?x where { <关宁铁骑> <创始人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "明成祖朱棣的年号是什么？",
        "output": "select ?x where { <朱棣_（明成祖）> <年号> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武则天的陵寝是？",
        "output": "select ?x where { <武则天_（中国武周时期女皇帝）> <陵寝> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"负荆请罪\"说的是谁的故事？",
        "output": "select ?x where { ?x <典故> <负荆请罪> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "战国四大名将之首的外号是？",
        "output": "select ?y where { ?x <地位> \"战国四大名将之首\" . ?y <别称> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《六韬》的作者有什么重大成就？",
        "output": "select ?y where { <六韬> <作者> ?x . ?x <主要成就> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "庄周出生于哪里？",
        "output": "select ?y where { ?x <本名> \"庄周\" . ?x <出生地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三国女诗人蔡琰的主要作品有哪些？",
        "output": "select ?y where { ?x <本名> \"蔡琰\" . ?x <主要作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三国吕布，人称？",
        "output": "select ?x where { <吕布_（东汉末年名将、割据诸侯）> <别称> ?x . }"
    }
]