[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "榕城的车牌代码是什么？",
        "output": "select ?y where { ?x <别名> \"榕城、\". ?x <车牌代码> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "微积分中的微、积分是什么关系？",
        "output": "select ?x where { <微积分_（数学概念）> <微、积分关系> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "习大大什么时候出生？",
        "output": "select ?y where { ?x <别名> \"习大大\". ?x <出生日期> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五虎将中被称作武圣的是谁？",
        "output": "select ?x where { <五虎上将_（人物组合称谓）> <成员> ?x. ?x <别称> <武圣_（三国名将关羽的尊称）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些政治家信仰马克思主义？",
        "output": "select ?x where { ?x <职业> <政治家>. ?x <信仰> <马克思主义>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "地处新西兰的牛奶公司有？",
        "output": "select ?x where { ?x <经营范围> <牛奶_（饮品）>. ?x <总部地点> <新西兰>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "985工程都包括哪些北京高校？",
        "output": "select ?x where { ?x <属性> <985工程> . ?x <所属地区> <北京_（中华人民共和国首都）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "司徒镇（高邮市）的特产中老少皆宜的是？",
        "output": "select ?x where { ?x <适宜人群> <老少皆宜>. <司徒镇（高邮市）> <特产> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三门峡出过哪些演员？",
        "output": "select ?x where { ?x <出生地> <三门峡> . ?x <职业> ?y . ?y <中文名> \"演员\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈涛主持的正在播出的节目是？",
        "output": "select ?x where { ?x <主持人> <沈涛_（浙江卫视主持人）>. ?x <播出状态> \"播出中\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《秦律》的作者有哪些成就？",
        "output": "select ?y where { ?x <主要作品> <秦律>. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我国在明朝时都有哪些著名的外交家？",
        "output": "select ?x where { ?x <所处时代> <明朝_（中国历史朝代）> . ?x <职业> <外交家> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绥靖天皇的父亲是何时即位的？",
        "output": "select ?x where { <绥靖天皇> <父亲> ?y. ?y <即位年月> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江大学出了哪些科学家？",
        "output": "select ?x where { ?x <职业> <科学家_（从事科学研究的人群）> . ?x <毕业院校> <浙江大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些位于湖北的公司？",
        "output": "select ?x where { ?x <地点> <湖北> . ?x <类别> <公司> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "主张\"知识即美德\"的哲学家的代表作有哪些？",
        "output": "select ?y where { ?x <主张> \"知识即美德\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些科学家？",
        "output": "select ?x where { ?x <职业> <科学家_（从事科学研究的人群）> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影神秘家族的导演出生于什么时候？",
        "output": "select ?x where { <神秘家族_（2016年朴裕焕执导电影）> <导演> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉大学出了哪些天文学家？",
        "output": "select ?x where { ?x <职业> <天文学家> . ?x <毕业院校> <武汉大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些经济学家？",
        "output": "select ?x where { ?x <职业> <经济学家_（拥有原创的经济学基础理论的经济学人）> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "价值五亿赏金，最擅长霸王色的海贼是谁？",
        "output": "select ?x where { ?x <现悬赏金> \"五亿贝利\". ?x <最擅长霸气> \"霸王色\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皇马的主场的西班牙文名是什么？",
        "output": "select ?x where { <皇家马德里_（皇家马德里足球俱乐部）> <主场馆> ?y. ?y <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "MaineCoon的原产地在哪里？",
        "output": "select ?y where { ?x <英文名> \"MaineCoon\". ?x <原产地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "09年诺贝尔和平奖获得者的妻子是谁？",
        "output": "select ?x where { ?y <主要成就> \"2009年 诺贝尔和平奖获得者\". ?y <妻子> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"东施效颦\"这个词涉及的两个人物中哪个是王妃？",
        "output": "select ?x where { <东施效颦> <主要人物> ?x. ?x <职业> <王妃_（汉语词语）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吉林大学出过哪些科学家？",
        "output": "select ?x where { ?x <职业> <科学家_（从事科学研究的人群）> . ?x <毕业院校> <吉林大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郦道元的《水经注》编撰于哪个朝代？",
        "output": "select ?x where { <水经注> <作者> <郦道元>. <水经注> <创作年代> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钱钟书是在哪个地区上的大学？",
        "output": "select ?x where { <钱钟书> <毕业院校> ?y. ?y <所属地区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俄罗斯的首都的邮政区码是多少？",
        "output": "select ?x where { <俄罗斯共和国> <首都> ?y. ?y <邮政区码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江大学出了哪些导演？",
        "output": "select ?x where { ?x <职业> <导演> . ?x <毕业院校> <浙江大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北邮的哪条校训的意思是\"知道的多\"？",
        "output": "select ?x where { <北京邮电大学> <校训> ?x. ?x <词义> \"知道的多\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诸葛亮有哪些代表作品？",
        "output": "select distinct ?y where { ?x <中文名> \"诸葛亮\" . ?x <代表作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉大学出了哪些企业家？",
        "output": "select ?x where { ?x <职业> <企业家> . ?x <毕业院校> <武汉大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学出了哪些哲学家？",
        "output": "select ?x where { ?x <职业> <哲学家_（基础含义）> . ?x <毕业院校> <清华大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "唱《钟无艳》的歌手在哪里毕业的？",
        "output": "select ?x where { ?y <代表作品> <钟无艳_（中国古代四大丑女之一）>. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朴槿惠父亲的主要成就？",
        "output": "select ?x where { <朴槿惠> <父亲> ?y. ?y <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冰与火之歌是在哪个洲拍摄的？",
        "output": "select ?x where { <冰与火之歌_（美国HBO电视台制作的电视剧）> <拍摄地点> ?y.?y <所属洲> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学出了哪些天文学家？",
        "output": "select ?x where { ?x <职业> <天文学家> . ?x <毕业院校> <清华大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三国杀的开发商属于什么性质的公司？",
        "output": "select distinct ?z where { ?x <中文名> \"三国杀\" . ?x <开发商> ?y . ?y <公司性质> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些物理学家？",
        "output": "select ?x where { ?x <职业> <物理学家_（探索、研究物理学的科学家）> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些思想家？",
        "output": "select ?x where { ?x <职业> <思想家_（词语）> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"2009年第一轮第3位被雷霆队选中\"的球员的身高是？",
        "output": "select ?y where { ?x <nba选秀> \"2009年第一轮第3位被雷霆队选中\" . ?x <身高> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西方音乐主要使用什么乐器？",
        "output": "select ?y where { ?x <中文名> \"西方音乐\" . ?x <乐器> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《出师表》的作者逝世后被安葬于何处？",
        "output": "select ?y where { ?x <代表作品> <出师表_（诸葛亮作品）>. ?x <墓葬> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华盖集的作者有哪些别名呢？",
        "output": "select ?y where { ?x <代表作品> <华盖集>. ?x <别名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乔丹的二儿子场上司职什么位置？",
        "output": "select ?z where { <乔丹_（有飞人之称的美国著名篮球运动员）> <儿子> ?x. ?x <弟弟> ?y. ?y <场上位置> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川大学出了哪些作家？",
        "output": "select ?x where { ?x <职业> <作家_（汉语词语）> . ?x <毕业院校> <四川大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "联想GPU所用操作系统的特点有哪些？",
        "output": "select ?x where { <联想GPU> <操作系统> ?y. ?y <特点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称作\"娜姐\"的网球运动员的单打战绩是多少？",
        "output": "select ?y where { ?x <别名> \"娜姐\". ?x <单打职业战绩> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李幼斌和张桐共同主演过哪部作品？",
        "output": "select ?x where { ?x <主演> ?y. ?y <中文名> \"李幼斌\" . ?x <主演> ?z . ?z <中文名> \"张桐\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "运动员李娜的丈夫拿过什么奖项？",
        "output": "select ?z where { ?x <中文名> \"李娜\" . ?x <丈夫> ?y . ?y <主要奖项> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长篇小说《骆驼祥子》的作者是哪个民族？",
        "output": "select ?y where { ?x <代表作品> <骆驼祥子_（国家大剧院原创歌剧）>. ?x <民族> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江泽民同志提出\"三个代表\"重要思想的时间是？",
        "output": "select ?x where { <三个代表重要思想> <提出人> <江泽民>. <三个代表重要思想> <提出时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别名为湘的电话区号是什么？",
        "output": "select distinct ?y where { ?x <别名> \"湘、楚、湘楚、潇湘、三湘四水\". ?x <电话区号> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慕尼黑工业大学属于哪个国家哪个州？",
        "output": "select ?y where { ?x <著名大学> <慕尼黑工业大学>. ?x <所属地区> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川大学出了哪些企业家？",
        "output": "select ?x where { ?x <职业> <企业家> . ?x <毕业院校> <四川大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曹丕执政时期国家流通的货币是什么？",
        "output": "select ?y where { ?x <国家领袖> <曹丕_（三国时期曹魏开国皇帝）>. ?x <货币> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由梁翘柏作曲，李焯雄填词的歌曲有哪些？",
        "output": "select ?x where { ?x <填词> <李焯雄>. ?x <谱曲> <梁翘柏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我在国外想拨打中国的号码前面该加什么？",
        "output": "select ?y where { ?x <中文名称> \"中华人民共和国\" . ?x <国际电话区号> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员陈晓的经纪公司建在哪里？",
        "output": "select ?x where { <陈晓_（中国内地男演员）> <经纪公司> ?y. ?y <总部地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《半生缘》的作者其笔名有？",
        "output": "select ?x where { <半生缘_（张爱玲作品）> <作者> ?y. ?y <笔名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "给初音未来配音的那个人是什么星座呀？",
        "output": "select distinct ?z where { ?x <中文名> \"初音未来\" . ?x <配音> ?y . ?y <星座> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些生物学家？",
        "output": "select ?x where { ?x <职业> <生物学家> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《野草》的作者原名是？",
        "output": "select ?x where { <野草_（鲁迅创作散文诗集）> <作者> ?y. ?y <原名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霸王龙所在的总目繁荣时间是什么？",
        "output": "select ?z where { ?x <中文学名> \"霸王龙\" . ?x <总目> ?y . ?y <繁荣时间> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长江的沿岸重要城市都有什么？",
        "output": "select ?y where { ?x <中文名> \"长江\" . ?x <沿岸重要城市> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国绰号叫\"老北京，LBJ，詹皇，King James，小皇帝\"的篮球运动员其全名叫什么？",
        "output": "select ?x where { ?x <别名> \"老北京，LBJ，詹皇，King James，小皇帝\". ?x <运动项目> <篮球_（球类运动）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东南大学出过哪些数学家？",
        "output": "select ?x where { ?x <职业> <数学家_（数学家（世界著名数学家））> . ?x <毕业院校> <东南大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吉林大学出过哪些企业家？",
        "output": "select ?x where { ?x <职业> <企业家> . ?x <毕业院校> <吉林大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影十面埋伏是什么时候出品的？",
        "output": "select ?y where { ?x <外文名> \"House of Flying Daggers\". ?x <出品时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康佳集团的法人是谁?",
        "output": "select ?x where { <康佳集团股份有限公司> <法定代表人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的公司名称?",
        "output": "select ?x where { <飞亚股份> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的董事长是谁?",
        "output": "select ?x where { <飞亚股份> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的总经理叫什么?",
        "output": "select ?x where { <飞亚股份> <总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的董事会秘书是谁?",
        "output": "select ?x where { <飞亚股份> <董事会秘书> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的副总经理有哪几位?",
        "output": "select ?x where { <飞亚股份> <副总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的董事有哪几位?",
        "output": "select ?x where { <飞亚股份> <董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的独立董事有哪几位?",
        "output": "select ?x where { <飞亚股份> <独立董事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的总会计师是谁?",
        "output": "select ?x where { <飞亚股份> <总会计师> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的职工监事是谁?",
        "output": "select ?x where { <飞亚股份> <职工监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的职工代表监事是谁?",
        "output": "select ?x where { <飞亚股份> <职工代表监事> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞亚股份的总经理助理是谁?",
        "output": "select ?x where { <飞亚股份> <总经理助理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中粮地产的董事长上任时间?",
        "output": "select ?x where { <中粮地产> <董事长> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中粮地产的法人上任时间?",
        "output": "select ?x where { <中粮地产> <法人> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中粮地产的职工监事上任时间?",
        "output": "select ?x where { <中粮地产> <职工监事> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中粮地产的监事会主席上任时间?",
        "output": "select ?x where { <中粮地产> <监事会主席> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中粮地产的监事会副主席上任时间?",
        "output": "select ?x where { <中粮地产> <监事会副主席> ?y. ?y <上任时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的董事长是谁？",
        "output": "select ?x where { <恒生电子> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子股份有限公司的总裁叫什么名字？",
        "output": "select ?x where { <恒生电子> <总裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的全称是什么？",
        "output": "select ?x where { <平安银行> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的间接兄弟企业都有哪些？",
        "output": "select ?x where { <平安银行> <间接兄弟企业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的间接非控股股东都有哪些？",
        "output": "select ?x where { <平安银行> <间接非控股股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的间接控股股东都有哪些？",
        "output": "select ?x where { <平安银行> <间接控股股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的兄弟企业都有哪些？",
        "output": "select ?x where { <平安银行> <兄弟企业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平安银行的母公司都有哪些？",
        "output": "select ?x where { <平安银行> <母公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的下属子公司、参股公司有哪些？",
        "output": "select ?x where { <恒生电子> <下属子公司、参股公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子有哪些子公司？",
        "output": "select ?x where { <恒生电子> <子公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的兄弟企业有哪几家？",
        "output": "select ?x where { <恒生电子> <兄弟企业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的联营企业都有谁？",
        "output": "select ?x where { <恒生电子> <联营企业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的母公司是谁？",
        "output": "select ?x where { <恒生电子> <母公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "A股有多少上市公司？",
        "output": "select ?x where { <A股> <上市公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是指数型基金？",
        "output": "select ?x where { <指数型基金> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大数据100指数是什么指数？",
        "output": "select ?x where { <大数据100指数> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是长多？",
        "output": "select ?x where { <长多> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "融资融券的费率？",
        "output": "select ?x where { <融资融券> <费率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是RSI指标?",
        "output": "select ?x where { <RSI指标> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子在哪里上市的",
        "output": "select ?x where { <恒生电子> <上市地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的是什么性质的",
        "output": "select ?x where { <恒生电子> <公司性质> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子是哪年成立的",
        "output": "select ?x where { <恒生电子> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"Hundsun Technologies Inc.\"是哪个公司的外文名称",
        "output": "select ?x where { ?x <外文名称> <Hundsun_Technologies_Inc.> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国农科技的主要业务是啥？",
        "output": "select ?x where { <国农科技> <主要业务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海泰发展的股票代码是多少",
        "output": "select ?x where { <海泰发展> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的十大股东都有谁",
        "output": "select ?x where { <恒生电子> <最大股票> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的全称是什么",
        "output": "select ?x where { <大华股份> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蚂蚁金服旗下有哪些主要产品？",
        "output": "select ?x where { <蚂蚁金服> <产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蚂蚁金服的融资时间？",
        "output": "select ?x where { <蚂蚁金服> <融资时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝成立时间？",
        "output": "select ?x where { <支付宝> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信雅达的法定代表人是谁",
        "output": "select ?x where { <信雅达> <法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信雅达的注册资本是多少？",
        "output": "select ?x where { <信雅达> <注册资本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海康威视总部在哪里？",
        "output": "select ?x where { <海康威视> <总部地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海康威视的企业口号是什么？",
        "output": "select ?x where { <海康威视> <企业口号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国内有哪些期货交易所？",
        "output": "select ?x where { <期货交易所> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海有几个期货交易所",
        "output": "select ?x where { <上海> <期货交易所数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国有几个期货交易所",
        "output": "select ?x where { <中国> <期货交易所数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑州有几个期货交易所？",
        "output": "select ?x where { <郑州> <期货交易所数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连有几个期货交易所？",
        "output": "select ?x where { <大连> <期货交易所数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上期所都交易什么期货？",
        "output": "select ?x where { <上期所> <交易品种> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金期货可以在哪里交易？",
        "output": "select ?x where { <黄金期货> <交易机构> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "燃料油期货在哪交易",
        "output": "select ?x where { <燃料油期货> <交易机构> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "橡胶期货在哪个交易所交易",
        "output": "select ?x where { <橡胶期货> <交易机构> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑商所可以交易什么期货？",
        "output": "select ?x where { <郑商所> <交易品种> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大商所都能交易什么期货",
        "output": "select ?x where { <大商所> <交易品种> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑商所交易的期货有几种",
        "output": "select ?x where { <郑商所> <交易品种数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上期所交易的期货有几种",
        "output": "select ?x where { <上期所> <交易品种数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大商所的期货交易有多少种",
        "output": "select ?x where { <大商所> <交易品种数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上期所在中国哪个城市",
        "output": "select ?x where { <上期所> <位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大商所在中国哪个城市",
        "output": "select ?x where { <大商所> <位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑商所在中国哪个城市",
        "output": "select ?x where { <郑商所> <位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于大连的期货交易所叫什么",
        "output": "select ?x where { <大连> <期货交易所> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的股票代码是多少？",
        "output": "select ?x where { <大华股份> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的市值是多少？",
        "output": "select ?x where { <大华股份> <市值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的净资产是多少？",
        "output": "select ?x where { <大华股份> <净资产> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的净利润是多少？",
        "output": "select ?x where { <大华股份> <净利润> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的市净率是多少？",
        "output": "select ?x where { <大华股份> <市净率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的毛利率是多少？",
        "output": "select ?x where { <大华股份> <毛利率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的净利率是多少？",
        "output": "select ?x where { <大华股份> <净利率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的ROE是多少？",
        "output": "select ?x where { <大华股份> <ROE> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长江和记实业有限公司的中文简称是什么",
        "output": "select ?x where { <长江和记实业有限公司> <公司简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长江和记实业有限公司的注册地址是哪里",
        "output": "select ?x where { <长江和记实业有限公司> <注册地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长江和记实业有限公司是谁名下的企业",
        "output": "select ?x where { <长江和记实业有限公司> <法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信和置业的全称是什么",
        "output": "select ?x where { <信和置业> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信和置业的外文名称",
        "output": "select ?x where { <信和置业> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银河娱乐集团有限公司简称什么",
        "output": "select ?x where { <银河娱乐集团有限公司> <公司简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银河娱乐集团有限公司外文名称",
        "output": "select ?x where { <银河娱乐集团有限公司> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银河娱乐集团有限公司什么时候成立的",
        "output": "select ?x where { <银河娱乐集团有限公司> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银河娱乐集团有限公司的主席是谁",
        "output": "select ?x where { <银河娱乐集团有限公司> <主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银河娱乐集团有限公司的传真是多少",
        "output": "select ?x where { <银河娱乐集团有限公司> <传真> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周生生集团国际有限公司简称什么",
        "output": "select ?x where { <周生生集团国际有限公司> <公司简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周生生集团国际有限公司外文名称",
        "output": "select ?x where { <周生生集团国际有限公司> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周生生集团国际有限公司的注册地址",
        "output": "select ?x where { <周生生集团国际有限公司> <注册地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周生生集团国际有限公司的主席是谁",
        "output": "select ?x where { <周生生集团国际有限公司> <主席> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周生生集团国际有限公司的传真是多少",
        "output": "select ?x where { <周生生集团国际有限公司> <传真> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国银行在哪里的上市的？",
        "output": "select ?x where { <中国银行> <上市地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国上市公司的股票有哪几种",
        "output": "select ?x where { <股票> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国工商银行哪一年成立的",
        "output": "select ?x where { <中国工商> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国工商银行在哪里上市的",
        "output": "select ?x where { <中国工商> <上市地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香港证券交易总部所在哪里",
        "output": "select ?x where { <香港证券交易所> <总部位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海证券交易总部所在哪？",
        "output": "select ?x where { <上海证券交易所> <总部位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国农业银行总部设在哪里",
        "output": "select ?x where { <中国农业银行> <总部位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融业包括哪些行业",
        "output": "select ?x where { <金融业> <行业类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "00国债08的全称？",
        "output": "select ?x where { <00国债08> <债券名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "丝绸转债的全称？",
        "output": "select ?x where { <丝绸转债> <债券名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的法定代表人是谁",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的法定代表人名下有多少家公司",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <法人> ?y. ?y <参股企业数量> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的注册资本是多少",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <注册资本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的成立日期",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <成立日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的统一社会信用代码",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <统一社会信用代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的工商注册号",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <工商注册号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的组织机构代码",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <组织机构代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的英文名称",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的注册地址",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <注册地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝（中国）网络技术有限公司的历史法人",
        "output": "select ?x where { <支付宝（中国）网络技术有限公司> <历史法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江大华技术股份有限公司成立日期？",
        "output": "select ?x where { <浙江大华技术股份有限公司> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江大华技术股份有限公司企业地址？",
        "output": "select ?x where { <浙江大华技术股份有限公司> <总部地址> ?x. }"
    }
]