[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票的报价单位？",
        "output": "select ?x where { <股票> <报价单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深市A股的增发代码是什么？",
        "output": "select ?x where { <深市A股> <增发代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "停牌股票何时复牌？",
        "output": "select ?x where { <停牌股票> <何时复牌> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板转让方式有哪些？",
        "output": "select ?x where { <新三板> <转让方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板的投资者有哪些？",
        "output": "select ?x where { <新三板> <投资者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板股票代码是以什么开头的？",
        "output": "select ?x where { <新三板股票代码> <号段> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板协议转让有哪些成交情况？",
        "output": "select ?x where { <新三板协议转让> <成交情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板交易时间？",
        "output": "select ?x where { <新三板> <交易时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板挂牌申请需要多少时间？",
        "output": "select ?x where { <新三板挂牌申请> <费时> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板股票的代码有什么特点？",
        "output": "select ?x where { <新三板股票代码> <特点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中概股有哪些？",
        "output": "select ?x where { <中概股> <相关股票> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "XD是什么的缩写？",
        "output": "select ?x where { <XD> <缩写> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票上市首日冠以什么字样？",
        "output": "select ?x where { <股票上市首日> <字样> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海A股股票代码是什么开头的？",
        "output": "select ?x where { <上海A股股票代码> <开头数字> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "客户风险承受能力分类标准？",
        "output": "select ?x where { <客户风险承受能力> <分类标准> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券转银行单日限额？",
        "output": "select ?x where { <证券转银行> <单日限额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上证50ETF期权合约的委托类型？",
        "output": "select ?x where { <上证50ETF期权合约> <委托类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票成交规则是什么？",
        "output": "select ?x where { <股票> <成交规则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开放式基金的面值是多少？",
        "output": "select ?x where { <开放式基金> <面值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东方通信的所属行业？",
        "output": "select ?x where { <东方通信> <行业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东方通信的所在城市？",
        "output": "select ?x where { <东方通信> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东方通信的上市时间？",
        "output": "select ?x where { <东方通信> <上市时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东方通信的实际控制人？",
        "output": "select ?x where { <东方通信> <实际控制人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东方通信的所属概念？",
        "output": "select ?x where { <东方通信> <概念> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东方通信的主营产品？",
        "output": "select ?x where { <东方通信> <主营产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水泥的上游是？",
        "output": "select ?x where { <水泥> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水泥的下游是？",
        "output": "select ?x where { <水泥> <下游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "混泥土的下游上市公司？",
        "output": "select ?x where { <混泥土> <下游> ?y. ?x <主营产品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "混泥土的上游上市公司？",
        "output": "select ?x where { <混泥土> <上游> ?y. ?x <主营产品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "食用油的下位产品？",
        "output": "select ?x where { <食用油> <下位产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "食用油的上游上市公司？",
        "output": "select ?x where { <食用油> <上游> ?y. ?x <主营产品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "食用油的下游上市公司？",
        "output": "select ?x where { <食用油> <下游> ?y. ?x <主营产品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小包装玉米油的上位产品？",
        "output": "select ?x where { <小包装玉米油> <上位产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "橄榄油的下游有？",
        "output": "select ?x where { <橄榄油> <下游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "橄榄油的上游有？",
        "output": "select ?x where { <橄榄油> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国内的量化产品有？",
        "output": "select ?x where { <国内> <量化产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "借壳重组完成的股票？",
        "output": "select ?x where { <借壳成功> <相关股票> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王亚伟持股的股票？",
        "output": "select ?x where { <王亚伟> <持股> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "连续涨停的股票？",
        "output": "select ?x where { <连续涨停> <相关股票> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "跌破举牌价的股票？",
        "output": "select ?x where { <跌破举牌价> <相关股票> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "数字孪生概念有哪些股票？",
        "output": "select ?x where { <数字孪生概念> <相关股票> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "白酒行业景气周期延续对哪些股票有利好？",
        "output": "select ?x where { ?y <事件> <白酒行业景气周期延续>. ?x <行业> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "量化回测风险指标？",
        "output": "select ?x where { <量化回测> <风险指标> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "夏普比率公式？",
        "output": "select ?x where { <夏普比率> <公式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "麦氏综合指标是谁创的？",
        "output": "select ?x where { <麦氏综合指标> <开创者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "永辉超市主营产品？",
        "output": "select ?x where { <永辉超市> <主营产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "超市的上游是？",
        "output": "select ?x where { <超市> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "超市的下游是？",
        "output": "select ?x where { <超市> <下游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "迪士尼收购福克斯?",
        "output": "select ?x where { <迪士尼以什么价格收购福克斯> <价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿里巴巴以什么价格收购申通快递？",
        "output": "select ?x where { <阿里巴巴收购申通快递> <价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "合成树脂的上游是？",
        "output": "select ?x where { <合成树脂> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钢铁的下游是？",
        "output": "select ?x where { <钢铁> <下游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "产业链有哪四个维度？",
        "output": "select ?x where { <产业链有> <维度> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "网宿科技2月以来股价翻倍本周酱油超40亿市值限售股解禁影响的公司是？",
        "output": "select ?x where { ?y <事件> <网宿科技2月以来股价翻倍本周酱油超40亿市值限售股解禁>. ?x <股东> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《ST仰帆股票交易异常波动公告》的公告类型？",
        "output": "select ?x where { <《ST仰帆股票交易异常波动公告》> <公告类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深市中小企业板块A股证券代码是多少？",
        "output": "select ?x where { <深市中小企业板块A股> <证券代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上交所逆回购的起点金额？",
        "output": "select ?x where { <上交所逆回购> <起点金额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深交所逆回购的起点金额？",
        "output": "select ?x where { <深交所逆回购> <起点金额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "期权卖方最大收益是什么？",
        "output": "select ?x where { <期权卖方> <最大收益> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新三板股票协议转让的申报类型？",
        "output": "select ?x where { <新三板股票协议转让> <申报类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金信息披露的内容？",
        "output": "select ?x where { <基金> <信息披露内容> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "股票有哪些评级？",
        "output": "select ?x where { <股票> <评级> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安控科技市值？",
        "output": "select ?x where { <安控科技> <市值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "针对上市公司的监管类函件有哪些？",
        "output": "select ?x where { <上市公司> <监管类函件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "融资利息如何计算？",
        "output": "select ?x where { <融资利息> <公式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何计算融券费用？",
        "output": "select ?x where { <融券费用> <公式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上市公司发布的公告都有哪些类型？",
        "output": "select ?x where { <公告> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "5G是什么的简称？",
        "output": "select ?x where { <5G> <简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "云南白药总股本？",
        "output": "select ?x where { <云南白药> <总股本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海证券交易所的咨询热线是？",
        "output": "select ?x where { <上海证券交易所> <咨询热线> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深证证券交易所的咨询热线是？",
        "output": "select ?x where { <深证证券交易所> <咨询热线> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中美贸易谈判中方牵头人是？",
        "output": "select ?x where { <中美贸易谈判> <中方牵头人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "交通运输包含哪些二级行业？",
        "output": "select ?x where { <交通运输> <二级行业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "公用事业包含哪些二级行业？",
        "output": "select ?x where { <公用事业> <二级行业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "市场择时的分类？",
        "output": "select ?x where { <市场择时> <分类> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "趋势择时有哪些技术面指标？",
        "output": "select ?x where { <趋势择时> <技术面指标> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "牙膏的上游是？",
        "output": "select ?x where { <牙膏> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风电的上游是？",
        "output": "select ?x where { <风电> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "顺丰控股主营产品有？",
        "output": "select ?x where { <顺丰控股> <主营产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "养殖的上游是？",
        "output": "select ?x where { <养殖> <上游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "养殖的下游是？",
        "output": "select ?x where { <养殖> <下游> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国三大证券交易所？",
        "output": "select ?x where { <美国> <三大证券交易所> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外汇风险类型？",
        "output": "select ?x where { <外汇风险><类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老虎证券的投资方？",
        "output": "select ?x where { <老虎证券> <投资方> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些美国上市的日本公司？",
        "output": "select ?x where { ?x <国家> <日本>. ?x <上市地点> <美国>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美股的开盘时间？",
        "output": "select ?x where { <美股> <开盘时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的总市值？",
        "output": "select ?x where { <索尼公司> <总市值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的网站地址？",
        "output": "select ?x where { <索尼公司> <网站地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的所属行业？",
        "output": "select ?x where { <索尼公司> <所属行业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "索尼公司的成立时间？",
        "output": "select ?x where { <索尼公司> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"黄老邪\"是谁的别称？",
        "output": "select ?x where { ?x <别名> \"东邪、黄老邪、黄岛主\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"老毒物\"是谁的别称？",
        "output": "select ?x where { ?x <别名> \"西毒、老毒物\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"一灯大师\"是谁的别称？",
        "output": "select ?x where { ?x <别名> \"一灯大师、南帝、南僧\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"九指神丐\"是谁的别称？",
        "output": "select ?x where { ?x <别名> \"北丐、九指神丐\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"中神通\"是谁的别称？",
        "output": "select ?x where { ?x <别名> \"中神通\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"老顽童\"是谁的别称？",
        "output": "select ?x where { ?x <别名> \"老顽童\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁曾获得过\"华山论剑\"天下第一？",
        "output": "select ?x where { {?x <主要成就> \"在华山论剑夺得天下第一\".} union {?x <主要成就> \"在第二次华山论剑夺得天下第一\".} }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"黄老邪\"的徒弟有谁？",
        "output": "select ?y where { ?x <别名> \"东邪、黄老邪、黄岛主\" . {?y <师父> ?x.} union {?y <师傅> ?x.} }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"东邪\"的女婿是谁？",
        "output": "select ?y where { ?x <别名> \"东邪、黄老邪、黄岛主\" . ?y <岳父> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁会蛤蟆功？",
        "output": "select ?x where { <蛤蟆功_（金庸小说中的武功）> <修习者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁会先天功和一阳指？",
        "output": "select ?x where { { ?x <武功绝技> <一阳指> . ?x <武功绝技> <先天功> . } UNION  { ?x <武功> <一阳指> . ?x <武功> <先天功> . } }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洪七公会的什么武功被称为\"天下第一阳刚神功\"？",
        "output": "select ?x where { <洪七公> <武功> ?x . ?x <称誉> \"天下第一阳刚神功\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"全真七子\"都有谁？",
        "output": "select ?x where { <全真七子> <成员> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"江南七怪\"都有谁？",
        "output": "select ?x where { <江南七怪_（小说《射雕英雄传》中人物组合）> <成员> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨康的爸爸的孙子是谁？",
        "output": "select distinct ?y where { ?x <儿子> <杨康_（武侠小说《射雕英雄传》中的人物）> . ?x <孙子> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郭靖和黄蓉都会什么武功？",
        "output": "select ?x where { <郭靖_（金庸武侠小说《射雕英雄传》男主角）> <武功> ?x . <黄蓉_（金庸武侠小说《射雕英雄传》女主角）> <武功> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "包惜弱的丈夫是谁？",
        "output": "select ?x where { <包惜弱> <丈夫> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "裘千仞的妹妹是谁？",
        "output": "select ?y where { ?x <弟弟> <裘千仞> . ?x <妹妹> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "相貌英俊的赵王的养子是谁？",
        "output": "select ?y where { ?x <相貌> \"英俊\" . ?x <王位> \"赵王\" . ?x <养子> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周伯通在哪里创出了空明拳？",
        "output": "select ?x where { <空明拳> <创始地> ?x . <空明拳> <创始者> <周伯通> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金轮国师的什么武功有十龙十象之力？",
        "output": "select ?y where { ?x <别名> \"金轮国师、五轮法王\" . ?x <内功> ?y . ?y <功效特点> \"每招都有十龙十象的千斤之力\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨过使用什么武器？",
        "output": "select ?x where { <杨过> <武器> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨过和小龙女是什么恋？",
        "output": "select ?z where { ?x <相关人物> <杨过> . ?x <相关人物> ?y . ?y <中文名> \"小龙女\" . ?x <相恋类型> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王重阳的红颜知己创立了什么门派？",
        "output": "select ?y where { <王重阳_（金庸武侠小说中的人物）> <红颜知己> ?x . ?y <创立人> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小龙女是李莫愁的什么人？",
        "output": "select ?x where { <李莫愁_（金庸武侠小说）> ?x ?y . ?y <中文名> \"小龙女\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郭靖和黄蓉的子女是谁？",
        "output": "select ?x where { <郭靖_（金庸武侠小说《射雕英雄传》男主角）> <子女> ?x . <黄蓉_（金庸武侠小说《射雕英雄传》女主角）> <子女> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"逍遥二仙\"是谁？",
        "output": "select ?x where { {?x <别名> \"杨左使，逍遥二仙\".} union {?x <其他名称> \"苦头陀，逍遥二仙\".}}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "明教\"四大法王\"是谁？",
        "output": "select ?x where { <明教四大法王> <成员> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"金毛狮王\"的师父是谁？",
        "output": "select ?y where { ?x <别名> \"金毛狮王，谢退思\" . ?x <师父> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"白眉鹰王\"是谁的外公？",
        "output": "select ?y where { ?x <别名> \"白眉鹰王\" . ?y <外公> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"少林金刚伏魔圈\"由哪三人组成？",
        "output": "select ?x where { <少林金刚伏魔圈> <使用者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"金毛狮王\"是\"混元霹雳手\"的什么人？",
        "output": "select ?y where { ?x <别名> \"金毛狮王，谢退思\" . ?z ?y ?x . ?z <别名> \"混元霹雳手、圆真\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁练成了九阳神功？",
        "output": "select ?x where { <九阳神功_（金庸小说中的武功）> <练成神功者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁没有练成九阳神功？",
        "output": "select ?x where { <九阳神功_（金庸小说中的武功）> <练功未成者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张三丰创立了什么门派？",
        "output": "select ?x where { <张三丰_（武侠小说人物）> <荣誉> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "使用\"真武七截阵\"的七人分别是谁？",
        "output": "select ?y where { ?x <成员> ?y . ?x <阵法> <真武七截阵_（小说《倚天屠龙记》武当派阵式）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "灭绝师太的哪个徒弟会九阴白骨爪？",
        "output": "select ?x where { <灭绝师太_（小说《倚天屠龙记》人物）> <徒弟> ?x . <九阴白骨爪> <修习者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨不悔的爸爸是谁？",
        "output": "select ?x where { ?y <岳父> ?x . ?y <妻子> <杨不悔_（金庸小说《倚天屠龙记》中人物）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"昆仑三圣\"是谁？",
        "output": "select ?x where { ?x <别名> \"昆仑三圣\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "令狐冲的师父是谁？",
        "output": "select ?x where { <令狐冲> <师传> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "令狐冲会什么武功？",
        "output": "select ?x where { {<令狐冲> <剑法> ?x.} UNION {<令狐冲> <内功> ?x.} }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"五岳剑派\"的掌门分别是谁？",
        "output": "select ?y where { <五岳剑派> ?x ?y . filter(regex(?y,\"掌门\")) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青城派哪位掌门号称\"三峡以西剑法第一\"？",
        "output": "select ?x where { <青城派_（金庸小说中的门派）> <掌门人> ?x . ?x <号称> \"三峡以西剑法第一\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁让令狐冲接任恒山派掌门人？",
        "output": "select ?x where { ?x <遗言> \"让令狐冲接任恒山派掌门人\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海底捞的创始人有什么爱好？",
        "output": "select ?x where { <海底捞> <创始人> ?y . ?y <爱好> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"薰衣草之者\"属于什么气候？",
        "output": "select ?x where { <薰衣草之都> <所指> ?y . ?y <气候条件> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"路不拾遗，夜不闭户\"的时代是谁开创的？",
        "output": "select ?x where { <路不拾遗，夜不闭户> <时代> ?y . ?y <开创者> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《巴黎圣母院》和《悲惨世界》的作者是哪国人？",
        "output": "select ?x where { <巴黎圣母院_（维克多·雨果长篇小说）> <作者> ?y . <悲惨世界_（法国作家雨果创作长篇小说）> <作者> ?y . <雨果_（法国作家）> <国籍> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海伦公式的提出者还有哪些成就？",
        "output": "select ?x where { <海伦公式> <提出者> ?y . ?y <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冯·诺依曼发明了什么？",
        "output": "select ?x where { { ?x <发明人> <约翰·冯·诺依曼> . } UNION { ?x <发明者> <约翰·冯·诺依曼> . }}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《守望先锋》的开发公司是哪一年成立的？",
        "output": "select ?x where { <守望先锋_（2016年暴雪娱乐发行的团队射击游戏）> <发行商> ?y . ?y <成立时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手陈粒毕业于哪个学校？",
        "output": "select ?x where { ?y <中文名> \"陈粒\" . ?y <职业> <歌手_（职业名称）> . ?y <毕业院校> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有一种细胞器是记载遗传信息的载体，它是由什么物质组成的？",
        "output": "select ?x where { ?y <意义> \"记载遗传信息的载体\" . ?y <组成> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诺贝尔奖包含哪些奖项同？",
        "output": "select ?x where { { <诺贝尔奖> <包含奖项1> ?x. } UNION { <诺贝尔奖> <包含奖项2> ?x. }}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柯南·道尔笔下，华生的搭档的原型是谁？",
        "output": "select ?x where { ?y <搭档> <华生_（侦探小说《福尔摩斯探案记》中的人物）> . ?y <原型> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高田贤三是一知名品牌的设计师，这一品牌的设计原则是什么？",
        "output": "select ?x where { ?y <设计师> <高田贤三> . ?y <设计原则> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么药物可以用于预防HPV？",
        "output": "select ?x where { ?y <其他名称> \"HPV\" . ?x <主要适用症> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "卡西尼发现的行星有几颗卫星？",
        "output": "select ?x where { ?y <发现者> <卡西尼_（意大利天文学家）> . ?y <卫星数量> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨紫和张一山搭档的影视作品？",
        "output": "select ?x where { ?x <主演> <杨紫> . ?x <主演> <张一山_（中国内地演员）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "夜愿的现任主唱是谁？",
        "output": "select ?x where { ?y <中文名> \"夜愿\" . ?y <现任主唱> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被誉为\"中国古典小说的最高峰\"的名著共有多少章？",
        "output": "select ?x where { ?y <文学地位> \"中国古典小说的最高峰\" . ?y <章回数目> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "期望效应的具体含义？",
        "output": "select ?x where { <期望效应> <实质> ?y . ?y <基本信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于日本的休眠火山？",
        "output": "select ?x where { ?x <类型> <休眠火山> . ?x <地点> <日本_（日本国）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中华民国的首都又称为？",
        "output": "select ?x where { <中华民国> <首都> ?y . ?y <别名> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "马拉松世界纪录的保持者是谁？",
        "output": "select ?x where { {<马拉松_（长跑比赛项目）> <男子世界记录> ?x.} UNION {<马拉松_（长跑比赛项目）> <女子世界纪录> ?x.}}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"现代遗传学之父\"有什么科学贡献？",
        "output": "select ?x where { ?y <获得荣誉> \"现代遗传学之父\" . {?x <发现者> ?y.} UNION {?x <提出者> ?y.}}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮卡丘出场的作品？",
        "output": "select ?x where { {<皮卡丘> <登场作品> ?x.} UNION {?x <主要角色> <皮卡丘>.}}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "马里奥的弟弟是什么职业？",
        "output": "select ?x where { ?y <哥哥> <马里奥_（任天堂公司游戏角色）> . ?y <职业> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本国花可以做成什么食物？",
        "output": "select ?x where { ?y <地位> \"日本国花\" . ?x <主要食材> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老佛爷参与设计了哪些品牌？",
        "output": "select ?x where { <老佛爷_（知名设计师卡尔·拉格斐）> <主要成就> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "SHE的成员有哪些？",
        "output": "select ?x where { <S.H.E> <组合成员> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "夫妻肺片是用什么做的？",
        "output": "select ?x where { <夫妻肺片> <主要食材> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小棋养了一只萨摩耶，你能告诉他萨摩耶喜欢什么食物吗？",
        "output": "select ?x where { <萨摩耶犬_（犬科哺乳动物）> <喜食> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些药物可以用于抑郁症的治疗?",
        "output": "select ?x where { ?x <主要适用症> <抑郁症_（医疗百科）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "地球可以分为七大洲四大洋，其中四大洋分别指什么？",
        "output": "select ?x where { <四大洋> <特指> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小明很想去看极光，他应该去什么地方？",
        "output": "select ?x where { <极光_（自然现象）> <极光区> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "康乃馨象征着什么？",
        "output": "select ?x where { <康乃馨_（石竹属植物）> <象征意义> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "星巴克出售什么？",
        "output": "select ?x where { <星巴克_（美国连锁咖啡公司）> <经营范围> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界三大饮料？",
        "output": "select ?x where { <世界三大饮料> <三大饮料> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "常染色体病是由什么引起的？",
        "output": "select ?x where { <常染色体病> <原因> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么判断是否出现了倒春寒现象？",
        "output": "select ?x where { <倒春寒> <标准> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "七夕这一天人们一般会做什么？",
        "output": "select ?x where { <七夕节> <节日活动> ?x.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "七八月份，我国东南沿海地区大多会遭遇台风，台风是由什么引发的？",
        "output": "select ?x where { <台风_（气象学名词）> <成因> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "庞贝古城是因什么而毁灭的？",
        "output": "select ?x where { <庞贝古城_（亚平宁半岛古城）> <毁灭原因> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "元宵节为什么要吃汤圆？",
        "output": "select ?x where { <汤圆_（中国传统食品汤圆）> <意义> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "文艺复兴运动的起源地在哪里？",
        "output": "select ?x where { <文艺复兴> <兴起国家> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小明想去杭州游玩，听说西湖景区有\"一山、二塔、三岛、三堤、五湖\"，你能告诉他三堤是指什么吗？",
        "output": "select ?x where { <西湖_（浙江省杭州市西湖）> <湖中三堤> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "历史上泰坦尼克号是在哪一天沉没的？",
        "output": "select ?x where { <泰坦尼克号_（英国豪华邮轮）> <沉没时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小明去西藏旅游时，当地的少数民族向他献上了哈达，是什么意思？",
        "output": "select ?x where { <哈达_（蒙古族、藏族传统丝织品）> <意义> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深度学习可以应用在哪些领域？",
        "output": "select ?x where { <深度学习> <应用领域> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧《家有儿女》中，刘梅和她前夫生的儿子叫什么？",
        "output": "select ?x where { <刘梅_（《家有儿女》中的人物）> <前夫> ?y . ?x <父亲> ?y . ?x <母亲> <刘梅_（《家有儿女》中的人物）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "以\"完美的搜索引擎\"为口号的公司的CEO是谁？",
        "output": "select ?x where { ?y <公司口号> \"完美的搜索引擎，\" . ?y <首席执行官> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "化学元素碳可以组成哪些单质？",
        "output": "select ?x where { <碳单质> <存在形式> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "氯元素的原子量是？",
        "output": "select ?x where { <氯> <原子量> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "单质熔点为97.72℃、沸点为883℃的化学元素电子排布式为？",
        "output": "select ?y where { ?x <熔点> \"97.72℃\" . ?x <沸点> \"883℃\" . ?x <电子排布式> ?y . }"
    }
]