[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脾肿大并且咳嗽通过哪项检查有效？",
        "output": "select ?x where { ?x <涉及症状> <咳嗽> . ?x <涉及症状> <脾肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪项可以诊断出脾肿大和盗汗？",
        "output": "select ?x where { ?x <涉及症状> <脾肿大> . ?x <涉及症状> <盗汗> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "盗汗且关节疼痛该检查什么？",
        "output": "select ?x where { ?x <涉及症状> <盗汗> . ?x <涉及症状> <关节疼痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当感到关节疼痛还日渐消瘦该做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <关节疼痛> . ?x <涉及症状> <消瘦> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于消瘦还伴随肝肿大这些症状，要通过哪项检查检测病情？",
        "output": "select ?x where { ?x <涉及症状> <消瘦> . ?x <涉及症状> <肝肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现肝肿大和淋巴结结核的临床表现，这时候要做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <肝肿大> . ?x <涉及症状> <淋巴结结核> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现浅表淋巴结进行性肿大和浅表淋巴结肿大要做怎样的检查有效？",
        "output": "select ?x where { ?x <涉及症状> <浅表淋巴结进行性肿大> . ?x <涉及症状> <浅表淋巴结肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有水痘还伴有浅表淋巴结肿大的症状，这是要做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <浅表淋巴结肿大> . ?x <涉及疾病> <水痘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有病毒性肝炎和白血病时应该做什么检查？",
        "output": "select ?x where { ?x <涉及疾病> <病毒性肝炎> . ?x <涉及疾病> <白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病人患有白血病和联合免疫缺陷病，通过哪项检查比较有用？",
        "output": "select ?x where { ?x <涉及疾病> <白血病> . ?x <涉及疾病> <联合免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有风疹和麻疹要做什么检查？",
        "output": "select ?x where { ?x <涉及疾病> <风疹> . ?x <涉及疾病> <麻疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "麻疹和布鲁氏菌病的病人应该做哪项检查?",
        "output": "select ?x where { ?x <涉及疾病> <麻疹> . ?x <涉及疾病> <布鲁氏菌病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布鲁氏菌病和小儿原发性免疫缺陷病的患者要做哪个检查项目？",
        "output": "select ?x where { ?x <涉及疾病> <布鲁氏菌病> . ?x <涉及疾病> <小儿原发性免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿发烧、抗体免疫缺陷病通过哪种检查比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <小儿发烧> . ?x <涉及疾病> <抗体免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查项目中，哪项对检测慢性肾上腺皮质功能减退症和免疫机能障碍有效？",
        "output": "select ?x where { ?x <涉及疾病> <慢性肾上腺皮质功能减退症> . ?x <涉及疾病> <免疫机能障碍> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于患有免疫机能障碍和慢性粒单核细胞白血病，应该检测什么？",
        "output": "select ?x where { ?x <涉及疾病> <免疫机能障碍> . ?x <涉及疾病> <慢性粒单核细胞白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性粒单核细胞白血病和获得性免疫缺陷综合征需要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <慢性粒单核细胞白血病> . ?x <涉及疾病> <获得性免疫缺陷综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布氏菌病以及慢性骨髓单核细胞性白血病要通过哪项检查比较有用？",
        "output": "select ?x where { ?x <涉及疾病> <布氏菌病> . ?x <涉及疾病> <慢性骨髓单核细胞性白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "做什么检查对检测慢性骨髓单核细胞性白血病和原发性免疫缺陷病有效？",
        "output": "select ?x where { ?x <涉及疾病> <慢性骨髓单核细胞性白血病> . ?x <涉及疾病> <原发性免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了原发性免疫缺陷病以及大水疱形成，这时候要做什么检查？",
        "output": "select ?x where { ?x <涉及疾病> <原发性免疫缺陷病> . ?x <涉及疾病> <大水疱形成> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有大水疱形成还有德国麻疹，需要检查什么？",
        "output": "select ?x where { ?x <涉及疾病> <大水疱形成> . ?x <涉及疾病> <德国麻疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪项对检测德国麻疹和修饰后麻疹有效？",
        "output": "select ?x where { ?x <涉及疾病> <德国麻疹> . ?x <涉及疾病> <修饰后麻疹> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在检查项目中，哪种可以检查出修饰后麻疹和先天性免疫缺陷病",
        "output": "select ?x where { ?x <涉及疾病> <修饰后麻疹> . ?x <涉及疾病> <先天性免疫缺陷病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于先天性免疫缺陷病以及年型粒-单核细胞白血病患者，他们应该做什么检查？",
        "output": "select ?x where { ?x <涉及疾病> <先天性免疫缺陷病> . ?x <涉及疾病> <幼年型粒-单核细胞白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有幼年型粒-单核细胞白血病还有艾迪生病，通过哪个检查对病情有作用？",
        "output": "select ?x where { ?x <涉及疾病> <幼年型粒-单核细胞白血病> . ?x <涉及疾病> <艾迪生病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当感染艾迪生病和急性淋巴细胞性白血病该做怎样的检查？",
        "output": "select ?x where { ?x <涉及疾病> <艾迪生病> . ?x <涉及疾病> <急性淋巴细胞性白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪项检查对检测急性淋巴细胞性白血病和骨髓单核细胞白血病有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <急性淋巴细胞性白血病> . ?x <涉及疾病> <骨髓单核细胞白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "医学检查项目中，哪个可以检查水痘-带状疱疹性葡萄膜炎和老年人流行性感冒？",
        "output": "select ?x where { ?x <涉及疾病> <水痘-带状疱疹性葡萄膜炎> . ?x <涉及疾病> <老年人流行性感冒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查属于蛋白质测定，且对血尿伴蛋白尿等病症有效？",
        "output": "select ?x where { ?x <类型> <蛋白质测定> . ?x <涉及症状> <血尿伴蛋白尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现血尿伴蛋白尿和血红蛋白尿病症，要检查什么？",
        "output": "select ?x where { ?x <涉及症状> <血尿伴蛋白尿> . ?x <涉及症状> <血红蛋白尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查能对检测血红蛋白尿和胸痛这些症状有作用？",
        "output": "select ?x where { ?x <涉及症状> <血红蛋白尿> . ?x <涉及症状> <胸痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感动胸痛以及出现肢体的非凹性水肿，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <胸痛> . ?x <涉及症状> <肢体的非凹性水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现肢体的非凹性水肿以及剧烈运动或强体力劳动后血尿这些症状要做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <肢体的非凹性水肿> . ?x <涉及症状> <剧烈运动或强体力劳动后血尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当发生剧烈运动或强体力劳动后血尿以及不稳定性心绞痛，需要去检查什么？",
        "output": "select ?x where { ?x <涉及症状> <剧烈运动或强体力劳动后血尿> . ?x <涉及症状> <不稳定性心绞痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现不稳定性心绞痛和一过性肉眼血尿的症状要做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <不稳定性心绞痛> . ?x <涉及症状> <一过性肉眼血尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪项检查对检测一过性肉眼血尿以及血尿伴排尿不畅这些症状有效？",
        "output": "select ?x where { ?x <涉及症状> <一过性肉眼血尿> . ?x <涉及症状> <血尿伴排尿不畅> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当发生血尿伴排尿不畅以及间歇性血尿，这时候应该去做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <血尿伴排尿不畅> . ?x <涉及症状> <间歇性血尿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有遗传性粪卟啉病的病人者出现间歇性血尿需要做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <间歇性血尿> . ?x <涉及疾病> <遗传性粪卟啉病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎患者且伴有混合型卟啉病该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <混合型卟啉病> . ?x <涉及疾病> <皮肌炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于皮肌炎以及心肌梗死患者，什么样的检查项目是必要的？",
        "output": "select ?x where { ?x <涉及疾病> <皮肌炎> . ?x <涉及疾病> <心肌梗死> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有心肌梗死和原卟啉病适宜做什么检查？",
        "output": "select ?x where { ?x <涉及疾病> <心肌梗死> . ?x <涉及疾病> <原卟啉病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种蛋白质测定的检查能检测冠状动脉粥样硬化型心脏病？",
        "output": "select ?x where { ?x <类型> <蛋白质测定> . ?x <涉及疾病> <冠状动脉粥样硬化型心脏病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当患上冠状动脉粥样硬化型心脏病和心肌梗死，应该去检查什么？",
        "output": "select ?x where { ?x <涉及疾病> <冠状动脉粥样硬化型心脏病> . ?x <涉及疾病> <心肌梗死> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么样的检查能测定心肌梗死和不稳定型心绞痛？",
        "output": "select ?x where { ?x <涉及疾病> <心肌梗死> . ?x <涉及疾病> <不稳定型心绞痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不稳定型心绞痛、儿病毒性心肌炎这些疾病要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <不稳定型心绞痛> . ?x <涉及疾病> <小儿病毒性心肌炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪项对测定小儿病毒性心肌炎以及老年人稳定型心绞痛比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <小儿病毒性心肌炎> . ?x <涉及疾病> <老年人稳定型心绞痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有老年人稳定型心绞痛和先兆型梗塞需要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <老年人稳定型心绞痛> . ?x <涉及疾病> <先兆型梗塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "先兆型梗塞和缺血性胸痛疾病应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <先兆型梗塞> . ?x <涉及疾病> <缺血性胸痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查对检测缺血性胸痛和老年人变异型心绞痛有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <缺血性胸痛> . ?x <涉及疾病> <老年人变异型心绞痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌培养与鉴定中，哪项检查可以检测传导性耳聋？",
        "output": "select ?x where { ?x <类型> <细菌培养与鉴定> . ?x <涉及症状> <传导性耳聋> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对传导性耳聋和外耳道癣两种症状有效？",
        "output": "select ?x where { ?x <涉及症状> <传导性耳聋> . ?x <涉及症状> <外耳道癣> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于副耳和嗌塞的症状，哪项检查是应该做的？",
        "output": "select ?x where { ?x <涉及症状> <副耳> . ?x <涉及症状> <嗌塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嗌塞和幻味发生时需要去做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <嗌塞> . ?x <涉及症状> <幻味> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现幻味和单侧鼻腔阻塞的症状，通过哪些检查可以检测病情？",
        "output": "select ?x where { ?x <涉及症状> <幻味> . ?x <涉及症状> <单侧鼻腔阻塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当感到单侧鼻腔阻塞而且耳闷时，要做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <单侧鼻腔阻塞> . ?x <涉及症状> <耳闷> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪项检查对耳闷和耳廓癣有作用？",
        "output": "select ?x where { ?x <涉及症状> <耳闷> . ?x <涉及症状> <耳廓癣> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于耳廓癣和耳痛这些症状，通过哪项检查可以检测？",
        "output": "select ?x where { ?x <涉及症状> <耳廓癣> . ?x <涉及症状> <耳痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感到耳痛咽痛，需要做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <耳痛> . ?x <涉及症状> <咽痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现咽痛且有蠕动感，这时候要去做怎样的检查？",
        "output": "select ?x where { ?x <涉及症状> <咽痛> . ?x <涉及症状> <蠕动感> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有蠕动感还打喷嚏适合去做哪种检查？",
        "output": "select ?x where { ?x <涉及症状> <蠕动感> . ?x <涉及症状> <打喷嚏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查对检测鼻溢液和咳痰有效？",
        "output": "select ?x where { ?x <涉及症状> <鼻溢液> . ?x <涉及症状> <咳痰> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪种检查能有效检测耳内流脓和听力减退的症状？",
        "output": "select ?x where { ?x <涉及症状> <耳内流脓> . ?x <涉及症状> <听力减退> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当听力减退而且血性耳漏时，适宜做怎样的检查？",
        "output": "select ?x where { ?x <涉及症状> <听力减退> . ?x <涉及症状> <血性耳漏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当患者出现血性耳漏以及耳溢液这些症状时，什么样的检查项目最适合做？",
        "output": "select ?x where { ?x <涉及症状> <血性耳漏> . ?x <涉及症状> <耳溢液> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查适合检测耳溢液和歪鼻症状？",
        "output": "select ?x where { ?x <涉及症状> <耳溢液> . ?x <涉及症状> <歪鼻> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现腮腺区肿大和咽部溃疡症状时，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <腮腺区肿大> . ?x <涉及症状> <咽部溃疡> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在检查项目中，哪一项适合检测咽部溃疡和搏动性耳鸣？",
        "output": "select ?x where { ?x <涉及症状> <咽部溃疡> . ?x <涉及症状> <搏动性耳鸣> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在症状中如搏动性耳鸣和发作性咳嗽，哪种检查能检测到病情？",
        "output": "select ?x where { ?x <涉及症状> <搏动性耳鸣> . ?x <涉及症状> <发作性咳嗽> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现发作性咳嗽以及咽部异物感现象时，需要做怎样的检查？",
        "output": "select ?x where { ?x <涉及症状> <发作性咳嗽> . ?x <涉及症状> <咽部异物感> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对检测咽部异物感和耳廓腹侧面局限性囊肿有效？",
        "output": "select ?x where { ?x <涉及症状> <咽部异物感> . ?x <涉及症状> <耳廓腹侧面局限性囊肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者有耳廓腹侧面局限性囊肿以及耳硬化症症状，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <耳廓腹侧面局限性囊肿> . ?x <涉及症状> <耳硬化症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有耳硬化症和耳骨外翻应该做哪个项目的检查？",
        "output": "select ?x where { ?x <涉及症状> <耳硬化症> . ?x <涉及症状> <耳骨外翻> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳骨外翻和传导性耳鸣的症状要通过什么检查测定？",
        "output": "select ?x where { ?x <涉及症状> <耳骨外翻> . ?x <涉及症状> <传导性耳鸣> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现传导性耳鸣以及耳廓红肿要做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <传导性耳鸣> . ?x <涉及症状> <耳廓红肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一项利于检测耳廓红肿还有怕冷的症状？",
        "output": "select ?x where { ?x <涉及症状> <耳廓红肿> . ?x <涉及症状> <怕冷> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病人怕冷且有耳冻伤，应该做怎样的检查？",
        "output": "select ?x where { ?x <涉及症状> <怕冷> . ?x <涉及症状> <耳冻伤> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查能测定耳冻伤还有耳痒的症状？",
        "output": "select ?x where { ?x <涉及症状> <耳冻伤> . ?x <涉及症状> <耳痒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者感到耳痒以及咽部有异物感适合做哪项检查？",
        "output": "select ?x where { ?x <涉及症状> <耳痒> . ?x <涉及症状> <咽部有异物感> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查项目能测定咽部有异物感还有菜花耳症状？",
        "output": "select ?x where { ?x <涉及症状> <咽部有异物感> . ?x <涉及症状> <菜花耳> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "菜花耳还有口腔痛需要做哪一个检查？",
        "output": "select ?x where { ?x <涉及症状> <菜花耳> . ?x <涉及症状> <口腔痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过什么检查对检测口腔痛和耳后红斑有效？",
        "output": "select ?x where { ?x <涉及症状> <口腔痛> . ?x <涉及症状> <耳后红斑> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出现耳后红斑和间歇性耳痛症状时，最好做哪项检查项目？",
        "output": "select ?x where { ?x <涉及症状> <耳后红斑> . ?x <涉及症状> <间歇性耳痛> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当中毒性休克综合征患者出现间歇性耳痛，该做哪项检查检测病情？",
        "output": "select ?x where { ?x <涉及症状> <间歇性耳痛> . ?x <涉及疾病> <中毒性休克综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪种检查可以检测中毒性休克综合征和小儿呼吸道合胞病毒肺炎这两种病？",
        "output": "select ?x where { ?x <涉及疾病> <中毒性休克综合征> . ?x <涉及疾病> <小儿呼吸道合胞病毒肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种指标项的检查能做到血气测定？",
        "output": "select ?x where { ?x <类型> <血气测定> . ?x <类型> <指标项> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过什么检查对测定严重急性呼吸综合征和休克型肺炎有效？",
        "output": "select ?x where { ?x <涉及疾病> <严重急性呼吸综合征> . ?x <涉及疾病> <休克型肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有休克型肺炎和重症急性呼吸综合征的病人要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <休克型肺炎> . ?x <涉及疾病> <重症急性呼吸综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当得了光气中毒和慢性呼吸衰竭疾病时，哪项检查是应该做的？",
        "output": "select ?x where { ?x <涉及疾病> <光气中毒> . ?x <涉及疾病> <慢性呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有肺泡蛋白沉着症和气胸时，哪一种检查是必要的？",
        "output": "select ?x where { ?x <涉及疾病> <肺泡蛋白沉着症> . ?x <涉及疾病> <气胸> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过什么检查对测定气胸和特发性间质性肺炎有效？",
        "output": "select ?x where { ?x <涉及疾病> <气胸> . ?x <涉及疾病> <特发性间质性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对特发性间质性肺炎和动脉硬化性血管病有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <特发性间质性肺炎> . ?x <涉及疾病> <动脉硬化性血管病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉硬化性血管病和中毒性肺炎患者适宜做哪项检查?",
        "output": "select ?x where { ?x <涉及疾病> <动脉硬化性血管病> . ?x <涉及疾病> <中毒性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有中毒性肺炎和老年人慢性阻塞性肺疾病的病人，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <中毒性肺炎> . ?x <涉及疾病> <老年人慢性阻塞性肺疾病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查对检测老年人慢性阻塞性肺疾病和新生儿呼吸暂停有作用？",
        "output": "select ?x where { ?x <涉及疾病> <老年人慢性阻塞性肺疾病> . ?x <涉及疾病> <新生儿呼吸暂停> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于新生儿呼吸暂停和先天性肺动静脉瘘疾病，应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿呼吸暂停> . ?x <涉及疾病> <先天性肺动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有老年人急性呼吸窘迫综合征还有肝肺综合征应该做哪种检查？",
        "output": "select ?x where { ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . ?x <涉及疾病> <肝肺综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查可以检测出肝肺综合征和急性呼吸衰竭？",
        "output": "select ?x where { ?x <涉及疾病> <肝肺综合征> . ?x <涉及疾病> <急性呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一项可以检测急性呼吸衰竭和支气管扩张症？",
        "output": "select ?x where { ?x <涉及疾病> <急性呼吸衰竭> . ?x <涉及疾病> <支气管扩张症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支气管扩张症和急性高原病患者应该做哪一项检查项目？",
        "output": "select ?x where { ?x <涉及疾病> <支气管扩张症> . ?x <涉及疾病> <急性高原病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有急性高原病和新生儿硬皮症需要进行哪项检查的工作？",
        "output": "select ?x where { ?x <涉及疾病> <急性高原病> . ?x <涉及疾病> <新生儿硬皮症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于新生儿硬皮症和迁延性肺嗜酸粒细胞浸润症患者，哪项检查是有用的？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿硬皮症> . ?x <涉及疾病> <迁延性肺嗜酸粒细胞浸润症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对测定迁延性肺嗜酸粒细胞浸润和动脉粥样硬化有效？",
        "output": "select ?x where { ?x <涉及疾病> <迁延性肺嗜酸粒细胞浸润症> . ?x <涉及疾病> <动脉粥样硬化> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了动脉粥样硬化和急性高山病，应该做哪一种检查？",
        "output": "select ?x where { ?x <涉及疾病> <动脉粥样硬化> . ?x <涉及疾病> <急性高山病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于原发性纤毛运动障碍和新生儿肺气漏疾病，有效的检查项目是什么？",
        "output": "select ?x where { ?x <涉及疾病> <原发性纤毛运动障碍> . ?x <涉及疾病> <新生儿肺气漏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查项目可以检测新生儿肺气漏和肺栓塞",
        "output": "select ?x where { ?x <涉及疾病> <新生儿肺气漏> . ?x <涉及疾病> <肺栓塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查适合检测肺栓塞和肺血栓栓塞症？",
        "output": "select ?x where { ?x <涉及疾病> <肺栓塞> . ?x <涉及疾病> <肺血栓栓塞症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺血栓栓塞症和慢性呼衰病患适宜去医院做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <肺血栓栓塞症> . ?x <涉及疾病> <慢性呼衰> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查可以有效测定脐带打结和小儿肺水肿疾病？",
        "output": "select ?x where { ?x <涉及疾病> <脐带打结> . ?x <涉及疾病> <小儿肺水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于小儿肺水肿和急性肾功能不全，要做哪种检查项目？",
        "output": "select ?x where { ?x <涉及疾病> <小儿肺水肿> . ?x <涉及疾病> <急性肾功能不全> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于检测急性肾功能不全和放射性肺炎有效的项目是什么？",
        "output": "select ?x where { ?x <涉及疾病> <急性肾功能不全> . ?x <涉及疾病> <放射性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一项对检测肺泡蛋白沉积症和HIV相关呼吸道感染有效？",
        "output": "select ?x where { ?x <涉及疾病> <肺泡蛋白沉积症> . ?x <涉及疾病> <HIV相关呼吸道感染> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查可以测定HIV相关呼吸道感染和动静脉瘘疾病？",
        "output": "select ?x where { ?x <涉及疾病> <HIV相关呼吸道感染> . ?x <涉及疾病> <动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有动静脉瘘和新生儿中枢性呼吸暂停综合征适宜做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <动静脉瘘> . ?x <涉及疾病> <新生儿中枢性呼吸暂停综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查对检测新生儿中枢性呼吸暂停综合征和小儿肥胖通气不良综合征有效？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿中枢性呼吸暂停综合征> . ?x <涉及疾病> <小儿肥胖通气不良综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有小儿肥胖通气不良综合征和五氯酚钠中毒该做哪种检查？",
        "output": "select ?x where { ?x <涉及疾病> <小儿肥胖通气不良综合征> . ?x <涉及疾病> <五氯酚钠中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病患五氯酚钠中毒而且新生儿体温过低，哪种检查项目是应该做的？",
        "output": "select ?x where { ?x <涉及疾病> <五氯酚钠中毒> . ?x <涉及疾病> <新生儿体温过低> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当先天性胸腹裂孔疝患者还有新生儿体温过低疾病，需要做哪种检查？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿体温过低> . ?x <涉及疾病> <先天性胸腹裂孔疝> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在血清非蛋白含氮化合物测定中，哪项检查适合检测紫绀这种症状？",
        "output": "select ?x where { ?x <类型> <血清非蛋白含氮化合物测定> . ?x <涉及症状> <紫绀> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查可以检测言语紊乱和感觉障碍的症状？",
        "output": "select ?x where { ?x <涉及症状> <言语紊乱> . ?x <涉及症状> <感觉障碍> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查项目适宜测定感觉障碍和腘动脉搏动减弱或消失的症状？",
        "output": "select ?x where { ?x <涉及症状> <感觉障碍> . ?x <涉及症状> <腘动脉搏动减弱或消失> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当出现腘动脉搏动减弱或消失和CO2潴留症状表现时，哪种检查是有效的？",
        "output": "select ?x where { ?x <涉及症状> <腘动脉搏动减弱或消失> . ?x <涉及症状> <CO2潴留> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查可以检测CO2潴留和呼吸异常？",
        "output": "select ?x where { ?x <涉及症状> <CO2潴留> . ?x <涉及症状> <呼吸异常> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在面对呼吸异常和视力障碍病症时，应该做什么检查？",
        "output": "select ?x where { ?x <涉及症状> <呼吸异常> . ?x <涉及症状> <视力障碍> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对检测视力障碍和妊娠期高血压有效？",
        "output": "select ?x where { ?x <涉及症状> <视力障碍> . ?x <涉及症状> <妊娠期高血压> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克型肺炎和光气中毒病患适宜做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <休克型肺炎> . ?x <涉及疾病> <光气中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有慢性呼吸衰竭和肺气肿疾病时，最适宜怎样的检查项目？",
        "output": "select ?x where { ?x <涉及疾病> <慢性呼吸衰竭> . ?x <涉及疾病> <肺气肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对检测肺气肿和妊娠合并肺栓塞有效？",
        "output": "select ?x where { ?x <涉及疾病> <肺气肿> . ?x <涉及疾病> <妊娠合并肺栓塞> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪项检查可以测定妊娠合并肺栓塞和年人急性呼吸窘迫综合征疾病？",
        "output": "select ?x where { ?x <涉及疾病> <妊娠合并肺栓塞> . ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有老年人急性呼吸窘迫综合征以及急性呼吸衰竭，应该检查什么？",
        "output": "select ?x where { ?x <涉及疾病> <老年人急性呼吸窘迫综合征> . ?x <涉及疾病> <急性呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对迁延性肺嗜酸粒细胞浸润症和新生儿肺气漏疾病的检测有效？",
        "output": "select ?x where { ?x <涉及疾病> <迁延性肺嗜酸粒细胞浸润症> . ?x <涉及疾病> <新生儿肺气漏> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有肺栓塞和脐带打结应该做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <肺栓塞> . ?x <涉及疾病> <脐带打结> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪一项检查可以测定放射性肺炎和动静脉瘘疾病？",
        "output": "select ?x where { ?x <涉及疾病> <放射性肺炎> . ?x <涉及疾病> <动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查可以检测出动静脉瘘和小儿肥胖通气不良综合征？",
        "output": "select ?x where { ?x <涉及疾病> <动静脉瘘> . ?x <涉及疾病> <小儿肥胖通气不良综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于五氯酚钠中毒和新生儿晚期代谢性酸中毒疾病，患者应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <五氯酚钠中毒> . ?x <涉及疾病> <新生儿晚期代谢性酸中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有新生儿晚期代谢性酸中毒和新生儿低体温，需要做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿晚期代谢性酸中毒> . ?x <涉及疾病> <新生儿低体温> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对于严重急性呼吸综合征患者检测氧分压低有效？",
        "output": "select ?x where { ?x <涉及症状> <氧分压低> . ?x <涉及疾病> <严重急性呼吸综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汉坦病毒肺综合征和严重急性呼吸综合征患者应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <严重急性呼吸综合征> . ?x <涉及疾病> <汉坦病毒肺综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个检查项目可以检测沙雷菌肺炎和肺组织细胞增生症疾病？",
        "output": "select ?x where { ?x <涉及疾病> <沙雷菌肺炎> . ?x <涉及疾病> <肺组织细胞增生症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于患有肺组织细胞增生症和急性呼吸窘迫综合症的病人来讲，需要做哪个项目的检查？",
        "output": "select ?x where { ?x <涉及疾病> <肺组织细胞增生症> . ?x <涉及疾病> <急性呼吸窘迫综合症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种医学检查对检测急性呼吸窘迫综合症和新生儿呼吸窘迫综合征有效？",
        "output": "select ?x where { ?x <涉及疾病> <急性呼吸窘迫综合症> . ?x <涉及疾病> <新生儿呼吸窘迫综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有新生儿窒息和慢性气道阻塞疾病，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿窒息> . ?x <涉及疾病> <慢性气道阻塞疾病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于尿毒症性肺炎和心源性休克，病人应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <尿毒症性肺炎> . ?x <涉及疾病> <心源性休克> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有心源性休克和老年人慢性阻塞性肺疾病，哪项检查是必要的？",
        "output": "select ?x where { ?x <涉及疾病> <心源性休克> . ?x <涉及疾病> <老年人慢性阻塞性肺疾病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有创伤性肺和新生儿呼吸暂停该通过什么检查进行检测？",
        "output": "select ?x where { ?x <涉及疾病> <创伤性肺> . ?x <涉及疾病> <新生儿呼吸暂停> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在患有新生儿呼吸暂停和慢性肺源性心脏病疾病的情况下，应该做哪些检查？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿呼吸暂停> . ?x <涉及疾病> <慢性肺源性心脏病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪些检查项目可以检测慢性肺源性心脏病和老年人肺气肿？",
        "output": "select ?x where { ?x <涉及疾病> <慢性肺源性心脏病> . ?x <涉及疾病> <老年人肺气肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于老年人肺气肿和先天性肺动静脉瘘，什么样的检查项目是有效的？",
        "output": "select ?x where { ?x <涉及疾病> <老年人肺气肿> . ?x <涉及疾病> <先天性肺动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与成人呼吸窘迫综合征相近的而且属于呼吸内科是什么疾病？",
        "output": "select ?x where { ?x <科室> <呼吸内科> . ?x <同义词> <成人呼吸窘迫综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在检查项目中，哪一种对检测疾病包括肝炎、巴多林氏腺癌以及肝脏炎症性疾病有效？",
        "output": "select ?x where { ?x <涉及疾病> <肝炎> . ?x <涉及疾病> <巴多林氏腺癌> . ?x <涉及疾病> <肝脏炎症性疾病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于疾病包括肝脏炎症性疾病、急性海绵窦栓塞性静脉炎以及眶骨膜下脓肿，做哪种检查项目有用？",
        "output": "select ?x where { ?x <涉及疾病> <肝脏炎症性疾病> . ?x <涉及疾病> <急性海绵窦栓塞性静脉炎> . ?x <涉及疾病> <眶骨膜下脓肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对检测急性海绵窦栓塞性静脉炎、眶骨膜下脓肿以及毛细胞白血病有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <急性海绵窦栓塞性静脉炎> . ?x <涉及疾病> <眶骨膜下脓肿> . ?x <涉及疾病> <毛细胞白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有眶骨膜下脓肿、毛细胞白血病以及外阴前庭大腺癌，这时候要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <眶骨膜下脓肿> . ?x <涉及疾病> <毛细胞白血病> . ?x <涉及疾病> <外阴前庭大腺癌> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一项检查可以检测出毛细胞白血病、外阴前庭大腺癌和急性重型肝炎？",
        "output": "select ?x where { ?x <涉及疾病> <毛细胞白血病> . ?x <涉及疾病> <外阴前庭大腺癌> . ?x <涉及疾病> <急性重型肝炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查对检测外阴前庭大腺癌、急性重型肝炎以及乳突炎有效？",
        "output": "select ?x where { ?x <涉及疾病> <外阴前庭大腺癌> . ?x <涉及疾病> <急性重型肝炎> . ?x <涉及疾病> <乳突炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查能检测出急性重型肝炎、乳突炎和妊娠合并白血病？",
        "output": "select ?x where { ?x <涉及疾病> <急性重型肝炎> . ?x <涉及疾病> <乳突炎> . ?x <涉及疾病> <妊娠合并白血病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于乳突炎、妊娠合并白血病和赖特综合征性巩膜炎这些疾病，做哪项检查可以得到测定？",
        "output": "select ?x where { ?x <涉及疾病> <乳突炎> . ?x <涉及疾病> <妊娠合并白血病> . ?x <涉及疾病> <赖特综合征性巩膜炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了妊娠合并白血病、赖特综合征性巩膜炎以及前庭大腺癌，应该做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <妊娠合并白血病> . ?x <涉及疾病> <赖特综合征性巩膜炎> . ?x <涉及疾病> <前庭大腺癌> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患者出现淋巴结肿大、咳嗽和脾肿大症状时，该做怎样的检查？",
        "output": "select ?x where { ?x <涉及症状> <淋巴结肿大> . ?x <涉及症状> <咳嗽> . ?x <涉及症状> <脾肿大> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项医学检查对测定脾肿大、盗汗和关节疼痛有效？",
        "output": "select ?x where { ?x <涉及症状> <脾肿大> . ?x <涉及症状> <盗汗> . ?x <涉及症状> <关节疼痛> . }"
    }
]