[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钟南山的队友属于哪个医疗队？",
        "output": "select ?x where { <钟南山> <队友> ?y. ?y <所属救援队> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气淋病会不会传染？",
        "output": "select ?x where { <气淋病> <传染性> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了畸形性脊柱炎应该去哪个科室看？",
        "output": "select ?x where { <畸形性脊柱炎>\t<医学专科> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了什么病会出现腹泻腹痛？",
        "output": "select ?x where { ?x <临床表现>\t\"腹泻腹痛\" . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由于外力使关节活动超出正常生理范围导致的疾病临床有什么表现？",
        "output": "select ?x where { ?y <常见病因> \"外力使关节活动超出正常生理范围\". ?y <临床表现> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吕逸涛导演过的一个大型晚会主题是什么？",
        "output": "select ?x where { ?y <导演> \"吕逸涛\". ?y <晚会主题> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "埃博拉病毒导致的那场疫情发生在哪一年？",
        "output": "select ?x where { ?y <涉及病毒> \"埃博拉病毒\". ?y <事发时间> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脱氧核苷酸病毒怎么繁殖？",
        "output": "select ?x where { ?y <又名> \"脱氧核苷酸病毒\". ?y <繁殖> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "HLA哪一年被发现的？",
        "output": "select ?x where { ?y <缩写> \"HLA\". ?y <发现时间> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新疆有哪些医院？",
        "output": "select ?x where { ?x <子类型> <新疆省医院>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "产后抑郁症所属的那个学科是几级的？",
        "output": "select ?x where { ?y <常见疾病> \"产后抑郁症\". ?y <学科级数> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "死于新冠病毒感染的都是哪里人？",
        "output": "select ?x where { ?y <死亡原因> <新型冠状病毒感染>. ?y <籍贯> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清瘟解毒口服液是处方药吗？",
        "output": "select ?x where { <清瘟解毒口服液> <是否处方药> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "草果主治的那种病有什么临床表现？",
        "output": "select ?x where { <草果> <主治> ?y. ?y <表现> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么病会表现为口干并且消瘦？",
        "output": "select ?x where { <口干> <涉及症状> ?x. <消瘦> <涉及症状> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么药归属到脾经？",
        "output": "select ?x where { ?x <归经> <脾经>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本有哪些公司经营化学产品？",
        "output": "select ?y where { ?y <总部地点> <日本_（日本国）>. ?y <经营范围> <化学>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《康熙大帝》的作者原名是啥？",
        "output": "select ?x where { <康熙大帝（全四册）> <作者> ?y. ?y <别名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《二月河文集》啥时候出版的？",
        "output": "select ?x where { <二月河文集（全套13卷）> <出版日期> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "二月河的居住地有什么称号？",
        "output": "select ?x where { <二月河> <现居地> ?y. ?y <别名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南阳地区的方言属于什么语言区？",
        "output": "select ?x where { <南阳_（河南省地级市）> <方言> ?y. ?y <所属> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么电影用中原官话对白并且得了百花奖最佳故事片奖？",
        "output": "select ?x where { ?x <对白语言> <中原官话>. ?x <主要奖项> \"百花奖最佳故事片奖\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "牛得草的师傅出生在哪？",
        "output": "select ?y where { ?x <师傅> <牛得草>. ?x <出生地> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 王艺红写过一本连载在起点上的小说叫什么名字？",
        "output": "select ?y where { ?x <作者> <王艺红>. ?x <连载网站> <起点_（网站名称）>. ?x <中文名> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《云深不知归处》连载的那个网站属于哪个公司？",
        "output": "select ?y where { <云深不知归处> <连载网站> ?x. ?x <所属公司> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "起点的创始人是男是女？",
        "output": "select ?y where { <起点_（网站名称）> <创始人> ?x. ?x <性别> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "法国数学家波莱尔毕业的学校有哪些院系？",
        "output": "select ?y where { <波莱尔_（法国数学家）> <毕业院校> ?x. ?x <主要院系> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "傅里叶级数的提出者是哪国人？",
        "output": "select ?y where { <傅里叶级数> <提出者> ?x. ?x <国籍> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "提出数论变换的那个人什么时候去世的？",
        "output": "select ?y where { <数论变换> <人物> ?x. ?x <逝世日期> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "经营信息和传媒的大公司有哪些？",
        "output": "select ?x where { ?x <经营范围> <信息>. ?x <经营范围> <传媒>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "真假ID的发行公司总部坐落于哪座城市？",
        "output": "select ?y where { <真假ID> <发行公司> ?x. ?x <总部地点> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纽约有多大？",
        "output": "select ?x where { <纽约_（美国第一大城市）> <面积> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纽约的公立大学有哪些？",
        "output": "select ?x where { <纽约_（美国第一大城市）> <名校> ?x. ?x <类别> <公立大学>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Westway Hotel and Hostel是几星级酒店？",
        "output": "select ?y where { ?x <英文名称> \"Westway Hotel and Hostel\". ?x <酒店星级> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉瓜迪亚机场周围的两星级酒店有哪些？",
        "output": "select ?x where { ?x <周围景观> <拉瓜迪亚机场>. ?x <酒店星级> \"2\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长岛市假日酒店所在的区电话区号是多少？",
        "output": "select ?y where { <长岛市假日酒店> <地理位置> ?x. ?x <电话区号> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于皇后区的演员有谁？",
        "output": "select ?x where { ?x <出生地> <皇后区>. ?x <职业> <演员_（职业）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《巴尔扎克葬词》的作者中文名是什么？",
        "output": "select ?y where { <巴尔扎克葬词> <作者> ?x. ?x <中文名> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雨果去世那年几岁？",
        "output": "select ?x where { <雨果_（法国作家）> <逝世年龄> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被后人称为“法兰西的莎士比亚”的那个人，都有什么作品？",
        "output": "select ?y where { ?y <作者> ?x. ?x <主要成就> \"被后人称为“法兰西的 莎士比亚”\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柳鸣九翻译过雨果的什么作品？",
        "output": "select ?y where { ?y <作者> <雨果_（法国作家）>. ?y <译者> <柳鸣九>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《雨果美文集》的翻译人写过什么书？",
        "output": "select ?y where { <雨果美文集> <译者> ?x. ?y <作者> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《子在川上》的作者什么时候出生的？",
        "output": "select ?y where { <子在川上> <作者> ?x. ?x <出生日期> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海天出版社出版过柳鸣九的什么书？",
        "output": "select ?x where { ?x <出版社> <海天出版社>. ?x <作者> <柳鸣九>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "H7N9型禽流感的发现日期？",
        "output": "select ?x where { <H7N9型禽流感>  <发现日期> ?x.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "H7N9型禽流感的类型包含哪些？",
        "output": "select ?x where { <H7N9型禽流感>  <类型> ?x.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李兰娟参与过哪些战役？",
        "output": "select ?x where { <李兰娟>  <参与战役> ?x.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李兰娟参与过战役的爆发地点？",
        "output": "select ?x where { <李兰娟>  <参与战役> ?y.?y<爆发地点>?x.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李兰娟的重要成果？",
        "output": "select ?x where { <李兰娟>  <重要成果> ?x.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年新型冠状病毒疫情的引发病毒？",
        "output": "select ?y where { <2020年新型冠状病毒疫情>  <引发病毒> ?y.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年新型冠状病毒疫情的引发病毒的命名组织？",
        "output": "select ?y where { <2020年新型冠状病毒疫情>  <引发病毒> ?x. ?x <命名组织> ?y.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年新型冠状病毒疫情的引发病毒的命名组织的总部？",
        "output": "select ?z where { <2020年新型冠状病毒疫情>  <引发病毒> ?x. ?x <命名组织> ?y.?y<总部>?z.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年新型冠状病毒疫情的引发病毒的命名组织的上级机构？",
        "output": "select ?z where { <2020年新型冠状病毒疫情>  <引发病毒> ?x. ?x <命名组织> ?y.?y<上级机构>?z.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年新型冠状病毒疫情的引发病毒的命名组织的成立时间？",
        "output": "select ?z where { <2020年新型冠状病毒疫情>  <引发病毒> ?x. ?x <命名组织> ?y.?y<成立时间>?z.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年新型冠状病毒疫情的引发病毒的命名组织的现任总领事？",
        "output": "select ?z where { <2020年新型冠状病毒疫情>  <引发病毒> ?x. ?x <命名组织> ?y.?y<现任总领事>?z.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年新型冠状病毒疫情的引发病毒的命名组织的组织机构？",
        "output": "select ?z where { <2020年新型冠状病毒疫情>  <引发病毒> ?x. ?x <命名组织> ?y.?y<组织机构>?z.} "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《H7N9禽流感病毒裂解佐剂(MF59)疫苗的长期免疫原性研究》的共同作者？",
        "output": "select ?x where { <《H7N9禽流感病毒裂解佐剂(MF59)疫苗的长期免疫原性研究》>  <共同作者> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪所学校的校歌创作于1952年？",
        "output": "SELECT ?x WHERE { ?x <校歌> ?y. ?y <创作年代> <1952年>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学的校歌的作者是谁？",
        "output": "SELECT ?x WHERE { <北京大学> <校歌> ?y. ?y <作者> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学的哪个机构的外文名为\"Center for Energy-Efficient Computing and Applications\"？",
        "output": "SELECT ?x WHERE { ?x <地区> <北京大学>. ?x <外文名> \"Center for Energy-Efficient Computing and Applications\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《青楼文化》的作者就业于哪所大学？",
        "output": "SELECT ?x WHERE { <青楼文化> <作者> ?y. ?y <职业> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《青楼文化》的作者毕业于哪所大学？",
        "output": "SELECT ?x WHERE { <青楼文化> <作者> ?y. ?y <毕业院校> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "于1964年9月22日出生于哈尔滨的是哪个作家？",
        "output": "SELECT ?x WHERE { ?x <出生日期> \"1964-09-22\". ?x <出生地> <哈尔滨_（黑龙江省省会）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "于1964年9月22日出生于黑龙江省的是哪个作家？",
        "output": "SELECT ?x WHERE { ?x <出生日期> \"1964-09-22\". ?x <出生地> <黑龙江_（最北和最东的省级行政区）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于1990年11月6日且为O型血的艺人是？",
        "output": "SELECT ?x WHERE { ?x <出生日期> \"1990-11-06\". ?x <血型> <O型>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "同时获得新浪娱乐15周年庆典杰出青年和搜狐时尚盛典亚洲时尚偶像奖的是？",
        "output": "SELECT ?x WHERE { ?x <主要成就> \"新浪娱乐15周年庆典 杰出青年\". ?x <主要成就> \"搜狐时尚盛典亚洲 时尚偶像奖\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "身高187厘米体重73公斤，代表作包括《有一个地方只有我们知道》的男艺人是？",
        "output": "SELECT ?x WHERE { ?x <身高> \"187cm\". ?x <体重> \"73kg\". ?x <代表作品> <有一个地方只有我们知道> } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得少儿歌曲大赛前十强，绰号为“菜包”的男艺人是？",
        "output": "SELECT ?x WHERE { ?x <主要成就> \"少儿歌曲大赛前十强\". ?x <别名> \"菜包\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由周杰伦和科比共同演唱的歌曲是？",
        "output": "SELECT ?x WHERE { ?x <歌曲原唱> <周杰伦>. ?x <歌曲原唱> <科比·布莱恩特>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "同时为歌手、导演、商人、制片人、音乐人的人是？",
        "output": "SELECT ?x WHERE { ?x <职业> <导演>. ?x <职业> <商人_（职业名）>. ?x <职业> <制片人_（影片制作人）>. ?x <职业> <音乐人_（职业）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演唱了《不能说的秘密》，并出演了《头文字D》的艺人是？",
        "output": "SELECT ?x WHERE { ?x <代表作品> <不能说的秘密_（周杰伦自编自导电影）>. ?x <代表作品> <头文字D_（2005年周杰伦主演电影）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绰号“小飞侠”和\"黑曼巴\"的是？",
        "output": "SELECT ?x WHERE { ?x <别名> \"小飞侠，\". ?x <别名> \"黑曼巴\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "球衣号码为24，妻子为瓦妮莎·布莱恩特的NBA球星为？",
        "output": "SELECT ?x WHERE { <NBA篮球> <主要角色> ?x. ?x <球衣号码> \"24\". ?x <妻子> <瓦妮莎·布莱恩特>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "1996年第1轮第13位被黄蜂队选中的NBA球星是？",
        "output": "SELECT ?x WHERE { <NBA篮球> <主要角色> ?x. ?x <nba选秀> \"1996年第1轮第13位被黄蜂队选中\" } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得了两届 NBA全明星赛最有价值球员奖和两届 NBA总冠军的NBA球星是？",
        "output": "SELECT ?x WHERE { <NBA篮球> <主要角色> ?x. ?x <主要奖项> \"两届 NBA全明星赛最有价值球员奖\". ?x <主要奖项> \"两届 NBA总冠军\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "效力于骑士队的2003年NBA选秀状元是？",
        "output": "SELECT ?x WHERE { ?x <所属运动队> <骑士_（NBA球队）>. ?x <重要事件> \"2003年NBA选秀状元\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发布专辑《十一月的萧邦》和《叶惠美》的歌手是？",
        "output": "SELECT ?x WHERE { ?x <职业> <音乐人_（职业）>. <十一月的萧邦> <专辑歌手> ?x. <叶惠美_（2003年周杰伦制作专辑）> <专辑歌手> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发布专辑《寻找周杰伦》和《叶惠美》的歌手是？",
        "output": "SELECT ?x WHERE { ?x <职业> <音乐人_（职业）>. <我很忙_（2007年周杰伦制作音乐专辑）> <专辑歌手> ?x. <寻找周杰伦_（周杰伦创作歌曲专辑）> <专辑歌手> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发布专辑《Jay》和《跨时代》的歌手是？",
        "output": "SELECT ?x WHERE { ?x <职业> <音乐人_（职业）>. <Jay_（周杰伦制作专辑）> <专辑歌手> ?x. <跨时代_（周杰伦创作专辑）> <专辑歌手> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发布专辑《依然范特西》和《12新作》的歌手是？",
        "output": "SELECT ?x WHERE { ?x <职业> <音乐人_（职业）>. <依然范特西> <专辑歌手> ?x. <12新作> <专辑歌手> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周杰伦的身高是？",
        "output": "SELECT ?x WHERE { <周杰伦> <身高> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周杰伦的别名是？",
        "output": "SELECT ?x WHERE { <周杰伦> <别名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周杰伦的星座是？",
        "output": "SELECT ?x WHERE { <周杰伦> <星座> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "512226798的作者是？",
        "output": "SELECT ?x WHERE { <512226798> <作者> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "流感裂解疫苗的规定组织是？",
        "output": "SELECT ?x WHERE { <流感裂解疫苗> <规定组织> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界卫生组织的简称是什么？",
        "output": "SELECT ?x WHERE { <世界卫生组织> <简称> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2019年武汉病毒性肺炎病例最早发现于哪里？",
        "output": "SELECT ?x WHERE { <2019年武汉病毒性肺炎病例> <最早发现地点> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2019年武汉病毒性肺炎病例最早发现时间是什么？",
        "output": "SELECT ?x WHERE { <2019年武汉病毒性肺炎病例> <最早发现时间> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉加油的捐助事由是什么？",
        "output": "SELECT ?x WHERE { <武汉加油（2020年新型冠状病毒疫情）> <捐助事由> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年武汉新型冠状病毒疫情最早发现于哪里？",
        "output": "SELECT ?x WHERE { <2020年新型冠状病毒疫情> <最早发现地点> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年武汉新型冠状病毒疫情最早发现时间是什么？",
        "output": "SELECT ?x WHERE { <2020年新型冠状病毒疫情> <最早发现时间> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界卫生组织的类型是？",
        "output": "SELECT ?x WHERE { <世界卫生组织> <类型> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界卫生组织的外文名是？",
        "output": "SELECT ?x WHERE { <世界卫生组织> <外文名> ?x } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "树袋熊生活在哪个国家？",
        "output": "select ?x where { ?x <代表动物> <树袋熊> . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "树袋熊生活的国家，还有哪些著名动物？",
        "output": "select ?y where { ?x <代表动物> <树袋熊> . ?x <代表动物> ?y . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "树袋熊生活的国家，主要宗教是什么？",
        "output": "select ?y where { ?x <代表动物> <树袋熊> . ?x <主要宗教> ?y . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和树袋熊生活的国家，拥有相同主要宗教的国家都有哪些？",
        "output": "select ?z where { ?x <代表动物> <树袋熊> . ?x <主要宗教> ?y . ?z <主要宗教> ?y } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界上最大的非政府机构是什么？",
        "output": "select ?x where { ?x <主要贡献> \"世界最大非政府\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界上最大的非政府机构，总部设在哪里？",
        "output": "select ?y where { ?x <主要贡献> \"世界最大非政府\". ?x <教会首都> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "希腊神话中有哪些主要神灵",
        "output": "select ?a where { <希腊神话_（西方神话体系之一）> <主要天神> ?a. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长颈鹿是哪一种动物的代表？",
        "output": "select ?a where { ?a <代表物种> <长颈鹿>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长颈鹿代表的物种，还有哪些动物？",
        "output": "select ?b where { ?a <代表物种> <长颈鹿>. ?a <代表物种> ?b. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国的麒麟圣兽，是哪一种动物？",
        "output": "select ?a where { ?a <别称>  <麒麟_（中国古代神兽）> . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国哪些地方还有麒麟圣兽？",
        "output": "select ?b where { ?a <别称>  <麒麟_（中国古代神兽）> . ?b <馆藏精品> ?a. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国有哪些城市与纽约气候类似？",
        "output": "select ?y where { <纽约_（美国第一大城市）> <气候条件> ?x. ?y <气候条件> ?x. ?y <所属地区> <中华人民共和国>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信奉天主教的国家都有哪些？",
        "output": "select ?y where { ?y <主要宗教> <天主教>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信奉天主教的国家，都有哪些气象特点？",
        "output": "select ?z where { ?y <主要宗教> <天主教>. ?y <气候条件> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\t英国的作曲家都有哪些？",
        "output": "select ?y where { ?y <国籍> <英国_（大不列颠及北爱尔兰联合王国）>. ?y <职业> <作曲家_（创作歌曲的专家）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南动物园有什么动物？",
        "output": "select ?y where { <济南动物园> <馆藏精品> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国动物园都有哪些动物？",
        "output": "select ?y where { ?x <所属国家> <中华人民共和国>. ?x <类别> <动物园_（饲养野生动物并对公众展出、教育的场所）>. ?x <馆藏精品> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们在中国的动物园里，能看到哪些猫科动物？",
        "output": "select ?y where { ?x <所属国家> <中华人民共和国>. ?x <类别> <动物园_（饲养野生动物并对公众展出、教育的场所）>. ?x <馆藏精品> ?y. ?y  <科> <猫科>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们在中国的动物园里，能看到哪些灵长动物？",
        "output": "select ?y where { ?x <所属国家> <中华人民共和国>. ?x <类别> <动物园_（饲养野生动物并对公众展出、教育的场所）>. ?x <馆藏精品> ?y. ?y  <目> <灵长目>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在中国的动物园中，有很多灵长类动物，属于猴科的有哪些？",
        "output": "select ?y where { ?x <所属国家> <中华人民共和国>. ?x <类别> <动物园_（饲养野生动物并对公众展出、教育的场所）>. ?x <馆藏精品> ?y. ?y  <科> <猴科>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纽约州长是谁？",
        "output": "select ?a where { <纽约州> <州长> ?a. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\t德州州长是谁？",
        "output": "select ?a where { <德州_（美国德克萨斯州的别称）> <州长> ?a. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德州有什么特产？",
        "output": "select ?a where { <德州_（山东省地级市）> <特产>  ?a. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "爆发于湖北省武汉市的疾病是由什么病毒引发？",
        "output": "select ?y where { ?x <引发病毒> ?y. ?x <最早发现地点> \"湖北省武汉市\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "引发武汉市肺炎爆发的病毒英文名是什么？",
        "output": "select ?z where { ?x <引发病毒> ?y. ?x <最早发现地点> \"湖北省武汉市\". ?y <外文名> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\t世界卫生组织总领事是谁？",
        "output": "select ?z where { <世界卫生组织> <现任总领事> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口罩有哪些类型？",
        "output": "select ?z where { ?z <类型> <口罩>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "防疫物品都有哪些？",
        "output": "select ?z where { ?z <类型> <物品>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "死于新型冠状病毒感染的都有哪些人？",
        "output": "select ?z where { ?z <死亡原因> <新型冠状病毒感染>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张文宏的同事都有哪些？",
        "output": "select ?z where { <张文宏> <同事> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和张文宏共同发表了论文工作的都有哪些人？",
        "output": "select ?z where { ?x <共同作者> <张文宏>. ?x <共同作者> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张文宏医生发表很多重要成果，但这些成果并非一个人的功劳，他的合作团队都有哪些成员？",
        "output": "select ?z where { <张文宏> <重要成果> ?x. ?x <共同作者> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奋斗在抗疫前线的女性工作者有哪些？",
        "output": "select ?x where { ?x <性别> <女>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "给新型冠状病毒命名的组织，成立于哪一年？",
        "output": "select ?a where { <2019新型冠状病毒> <命名组织> ?x. ?x <成立时间> ?a. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李兰娟院士有哪些重要成果？",
        "output": "select ?a where { <李兰娟> <重要成果> ?a. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和李兰娟共同发表了论文工作的都有哪些人？",
        "output": "select ?z where { ?x <共同作者> <李兰娟>. ?x <共同作者> ?z. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和张文宏合作的女性科学家有哪些？",
        "output": "select ?z where { ?x <共同作者> <张文宏>. ?x <共同作者> ?z. ?z <性别> <女>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\t李兰娟的队友都有谁？",
        "output": "select ?z where { ?z <队友> <李兰娟>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李兰娟的队友中，哪些杭州救援队？",
        "output": "select ?z where { ?z <队友> <李兰娟>. ?z <所属救援队> <树兰（杭州）医院紧急医疗队>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钟南山有哪些队友？",
        "output": "select ?x where { <钟南山> <队友> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《中国“一带一路”战略的政治经济学》一书的作者是哪个族的人？",
        "output": "SELECT ?族 WHERE { <中国“一带一路”战略的政治经济学>\t<作者>\t?作者. ?作者\t<民族>\t?族. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从1988年8月开始参加工作，著有《正义的眼睛》的人中文名叫什么？",
        "output": "SELECT ?中文名 WHERE { ?人\t<参加工作>\t\"1988年8月\". <正义的眼睛>\t<作者>\t?人. ?人\t<中文名>\t?中文名. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "质蓝素平台上出国哪款2D赛车游戏？",
        "output": "SELECT ?游戏 WHERE { ?游戏\t<游戏平台>\t<质蓝素>. ?游戏\t<游戏类型>\t<赛车>. ?游戏\t<游戏画面>\t<2D_（动画方式）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美洲虎XK120这款车是哪个厂商生产的？",
        "output": "SELECT ?x WHERE { <美洲虎XK120>\t<生产厂商>\t?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "捷豹C-XF的生产厂商是哪个国家的？",
        "output": "SELECT ?国家 WHERE { <捷豹C-XF>\t<品牌>\t?厂商. ?厂商\t<国别>\t?国家. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "于天津车衣裳合作，主要经营赛车的汽车品牌是哪家？",
        "output": "SELECT ?品牌 WHERE { <天津车衣裳>\t<合作>\t?品牌. ?品牌\t<经营范围>\t<赛车>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津车衣裳的合作伙伴的官网？",
        "output": "SELECT ?官网 WHERE { <天津车衣裳>\t<合作>\t?品牌. ?品牌\t<官网>\t?官网. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "捷豹公司是什么性质的公司？",
        "output": "SELECT ?公司 WHERE { <捷豹>\t<公司性质>\t?公司. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拥有英文名为Enzo Ferrari这名赛车手的意大利车队是哪支？",
        "output": "SELECT ?车队 WHERE { ?赛车手\t<外文名>\t\"Enzo Ferrari\". ?赛车手\t<所属运动队>\t?车队. ?车队\t<国别>\t<意大利_（意大利共和国）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "enzo跑车的生产厂商属于哪个集团？",
        "output": "SELECT ?集团 WHERE { <enzo_（法拉利跑车）>\t<品牌>\t?厂商. ?厂商\t<所属集团>\t?集团. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请给出生产法拉利456M的厂商官方网站",
        "output": "SELECT ?官方网站 WHERE { <法拉利456M>\t<生产厂商>\t?厂商. ?厂商\t<官网>\t?官方网站. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曾获7次世界冠军的F1车手别名是什么？",
        "output": "SELECT ?别名 WHERE { ?车手\t<重要事件>\t\"7次世界冠军\". ?车手\t<别名>\t?别名. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人称\"舒米\"的车手体重有多重？",
        "output": "SELECT ?体重 WHERE { ?车手\t<体重>\t?体重. ?车手\t<别名>\t\"舒米\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赫尔姆出了哪位车手曾获世界一级方程式七次车手总冠军？",
        "output": "SELECT ?车手 WHERE { ?车手\t<出生地>\t<赫尔姆>. ?车手\t<主要奖项>\t\"世界一级方程式赛车七次车手总冠军\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曾有哪个日耳曼人在在梅赛德斯奔驰队效力？",
        "output": "SELECT ?人 WHERE { ?人\t<民族>\t<日耳曼>. ?人\t<所属运动队>\t<梅赛德斯奔驰>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请告诉我刘易斯·汉密尔顿和大卫·库特哈德共同参加的比赛",
        "output": "SELECT ?比赛 WHERE { <大卫·库特哈德>\t<运动项目>\t?比赛. <刘易斯·汉密尔顿>\t<运动项目>\t?比赛. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"舒米\"的运动项目是啥呀？",
        "output": "SELECT ?运动项目 WHERE { ?舒米\t<别名>\t\"舒米\". ?舒米\t<运动项目>\t?运动项目. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "使用于世界一级方程式锦标赛，中文名为\"可调式尾翼\"的系统有什么作用？",
        "output": "SELECT ?作用 WHERE { ?可调式尾翼\t<相关项目>\t<世界一级方程式锦标赛>. ?可调式尾翼\t<中文名>\t\"可调式尾翼\". ?可调式尾翼\t<作用>\t?作用. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为\"观鸟\"的活动有什么意义？",
        "output": "SELECT ?意义 WHERE { ?观鸟\t<中文名>\t\"观鸟\". ?观鸟\t<意义>\t?意义. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"徕卡D-LUX4\"的牌子是哪个国家的？",
        "output": "SELECT ?国家 WHERE { ?徕卡DLUX4\t<中文名>\t\"徕卡D-LUX4\". ?徕卡DLUX4\t<品牌>\t?牌子. ?牌子\t<地区>\t?国家. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "镜头擦拭法适用于赤道仪的哪个部件？",
        "output": "SELECT ?部件 WHERE { <镜头擦拭法>\t<适用于>\t?部件. <赤道仪>\t<部件>\t?部件. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大家一般用什么来做直焦摄影呀？",
        "output": "SELECT ?什么 WHERE { ?直焦摄影\t<中文名>\t\"直焦摄影\". ?直焦摄影\t<工具>\t?什么. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "性无毒、无味，应用于望远镜的材料是什么？",
        "output": "SELECT ?材料 WHERE { ?材料\t<性能>\t<无毒>. ?材料\t<性能>\t<无味>. ?材料\t<应用领域>\t<望远镜>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉丁名为\"Sitta europaea levantina\"的物种属于哪个纲？",
        "output": "SELECT ?纲 WHERE { ?物种\t<拉丁学名>\t\"Sitta europaea levantina\". ?物种\t<纲>\t?纲. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些分布于北美地区的鸟种受世界自然保护联盟保护？",
        "output": "SELECT ?鸟种 WHERE { ?鸟种\t<保护级别>\t<世界自然保护联盟>. ?鸟种\t<分布区域>\t<北美地区>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"江苏省北阳市寒山区球王\"的偶像是谁？",
        "output": "SELECT ?偶像 WHERE { ?江苏省北阳市寒山区球王\t<地位>\t\"江苏省北阳市寒山区球王\". ?江苏省北阳市寒山区球王\t<偶像>\t?偶像. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "以乔·布莱恩特的儿子、阿伦·埃泽尔·艾弗森为代表人物的篮球场上位置是哪个？",
        "output": "SELECT ?位置 WHERE { ?乔·布莱恩特\t<中文名>\t\"乔·布莱恩特\". ?代表人物\t<父亲>\t?乔·布莱恩特. ?阿伦·埃泽尔·艾弗森\t<中文名>\t\"阿伦·埃泽尔·艾弗森\". ?位置\t<代表人物>\t?代表人物. ?位置\t<代表人物>\t?阿伦·埃泽尔·艾弗森. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"吹哨人\"李文亮医生因为什么去世？",
        "output": "SELECT ?什么 WHERE { <李文亮>\t<死亡原因>\t?什么. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "因感染新型冠状病毒于2020-02-07去世的医生有什么重要事迹？",
        "output": "SELECT ?事迹 WHERE { ?医生\t<死亡原因>\t<新型冠状病毒感染>. ?医生\t<死亡时间>\t<2020-02-07>. ?医生\t<事迹>\t?事迹. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开始于刚过民主共和国，被指死亡率\"高达50%至90%\"的疫情是什么？",
        "output": "SELECT ?疫情 WHERE { ?疫情\t<死亡率>\t\"高达50%至90%\". ?疫情\t<流行地区>\t\"刚果民主共和国\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪个人物和李霞、柏涛都是同事关系？",
        "output": "SELECT ?人物 WHERE { ?人物\t<类型>\t<人物>. ?人物\t<同事>\t<李霞>. ?人物\t<同事>\t<柏涛>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张定宇和王先广共同发表过哪些文章？",
        "output": "SELECT ?文章 WHERE { ?文章\t<共同作者>\t<张定宇>. ?文章\t<共同作者>\t<王先广>. ?文章\t<类型>\t<文章>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "那篇由张定宇、阮连国合著的文章在哪个期刊发表？",
        "output": "SELECT DISTINCT ?期刊 WHERE { ?文章\t<共同作者>\t<张定宇>. ?文章\t<共同作者>\t<阮连国>. ?期刊\t<发表>\t?文章. ?文章\t<类型>\t<文章>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陈蓉作为一作与刘婷发表过哪些文章？",
        "output": "SELECT ?文章 WHERE { ?文章\t<第一作者>\t<陈蓉>. ?文章\t<共同作者>\t<刘婷>. ?文章\t<类型>\t<文章>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "H9N2型禽流感有没有传染性呀？",
        "output": "SELECT ?传染性 WHERE { <H9N2型禽流感>\t<传染性>\t?传染性. } "
    }
]