[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在得了新生儿呼吸窘迫综合征、新生儿窒息和慢性气道阻塞疾病的情况下，应该去做哪种检查？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿呼吸窘迫综合征> . ?x <涉及疾病> <新生儿窒息> . ?x <涉及疾病> <慢性气道阻塞疾病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性气道阻塞疾病、尿毒症性肺炎以及心源性休克患者要做什么检查对检测病情有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <慢性气道阻塞疾病> . ?x <涉及疾病> <尿毒症性肺炎> . ?x <涉及疾病> <心源性休克> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对检测心源性休克、老年人慢性阻塞性肺疾病和创伤性肺有效？",
        "output": "select ?x where { ?x <涉及疾病> <心源性休克> . ?x <涉及疾病> <老年人慢性阻塞性肺疾病> . ?x <涉及疾病> <创伤性肺> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有老年人慢性阻塞性肺疾病、创伤性肺和新生儿呼吸暂停，要做哪项检查？",
        "output": "select ?x where { ?x <涉及疾病> <老年人慢性阻塞性肺疾病> . ?x <涉及疾病> <创伤性肺> . ?x <涉及疾病> <新生儿呼吸暂停> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪一种检查能检测出创伤性肺、新生儿呼吸暂停以及慢性肺源性心脏病？",
        "output": "select ?x where { ?x <涉及疾病> <创伤性肺> . ?x <涉及疾病> <新生儿呼吸暂停> . ?x <涉及疾病> <慢性肺源性心脏病> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查项目对检测新生儿呼吸暂停、慢性肺源性心脏病以及老年人肺气肿有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿呼吸暂停> . ?x <涉及疾病> <慢性肺源性心脏病> . ?x <涉及疾病> <老年人肺气肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "得了慢性肺源性心脏病、老年人肺气肿以及先天性肺动静脉瘘时，要做哪一项检查？",
        "output": "select ?x where { ?x <涉及疾病> <慢性肺源性心脏病> . ?x <涉及疾病> <老年人肺气肿> . ?x <涉及疾病> <先天性肺动静脉瘘> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学检查中，哪一种可以检测老年人肺气肿、先天性肺动静脉瘘和急性肺血栓栓塞症？",
        "output": "select ?x where { ?x <涉及疾病> <老年人肺气肿> . ?x <涉及疾病> <先天性肺动静脉瘘> . ?x <涉及疾病> <急性肺血栓栓塞症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在检测先天性肺动静脉瘘、急性肺血栓栓塞症和老年人呼吸性酸中毒时，哪项检查比较有效？",
        "output": "select ?x where { ?x <涉及疾病> <先天性肺动静脉瘘> . ?x <涉及疾病> <急性肺血栓栓塞症> . ?x <涉及疾病> <老年人呼吸性酸中毒> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查能对急性肺血栓栓塞症、老年人呼吸性酸中毒和老年人呼吸衰竭做出检测？",
        "output": "select ?x where { ?x <涉及疾病> <急性肺血栓栓塞症> . ?x <涉及疾病> <老年人呼吸性酸中毒> . ?x <涉及疾病> <老年人呼吸衰竭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么检查能检测老年人呼吸性酸中毒、老年人呼吸衰竭和小儿小颌畸形综合征这些疾病？",
        "output": "select ?x where { ?x <涉及疾病> <老年人呼吸性酸中毒> . ?x <涉及疾病> <老年人呼吸衰竭> . ?x <涉及疾病> <小儿小颌畸形综合征> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查对检测老年人呼吸衰竭、小儿小颌畸形综合征以及新生儿低血钙有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <老年人呼吸衰竭> . ?x <涉及疾病> <小儿小颌畸形综合征> . ?x <涉及疾病> <新生儿低血钙> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿低血钙、低气压所致红细胞增多和慢性呼衰要检查哪一项？",
        "output": "select ?x where { ?x <涉及疾病> <新生儿低血钙> . ?x <涉及疾病> <低气压所致红细胞增多> . ?x <涉及疾病> <慢性呼衰> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪项检查对检测低气压所致红细胞增多、慢性呼衰和儿童阻塞性睡眠呼吸暂停有作用？",
        "output": "select ?x where { ?x <涉及疾病> <低气压所致红细胞增多> . ?x <涉及疾病> <慢性呼衰> . ?x <涉及疾病> <儿童阻塞性睡眠呼吸暂停> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目可以检测慢性呼衰、儿童阻塞性睡眠呼吸暂停和胸膜腔积气？",
        "output": "select ?x where { ?x <涉及疾病> <慢性呼衰> . ?x <涉及疾病> <儿童阻塞性睡眠呼吸暂停> . ?x <涉及疾病> <胸膜腔积气> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "当患有疾病包括儿童阻塞性睡眠呼吸暂停、胸膜腔积气和小儿肺水肿时，哪项检查是有必要的？",
        "output": "select ?x where { ?x <涉及疾病> <儿童阻塞性睡眠呼吸暂停> . ?x <涉及疾病> <胸膜腔积气> . ?x <涉及疾病> <小儿肺水肿> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "通过哪项检查能检测出胸膜腔积气、小儿肺水肿以及小儿癫痫？",
        "output": "select ?x where { ?x <涉及疾病> <胸膜腔积气> . ?x <涉及疾病> <小儿肺水肿> . ?x <涉及疾病> <小儿癫痫> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "检查什么能检测出小儿癫痫、妊娠合并红细胞增多症和小儿巨细胞病毒肺炎等疾病？",
        "output": "select ?x where { ?x <涉及疾病> <小儿癫痫> . ?x <涉及疾病> <妊娠合并红细胞增多症> . ?x <涉及疾病> <小儿巨细胞病毒肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪一种检查对于检测妊娠合并红细胞增多症、小儿巨细胞病毒肺炎以及小儿特发性间质性肺炎有帮助？",
        "output": "select ?x where { ?x <涉及疾病> <妊娠合并红细胞增多症> . ?x <涉及疾病> <小儿巨细胞病毒肺炎> . ?x <涉及疾病> <小儿特发性间质性肺炎> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种检查能有效检测出小儿特发性间质性肺炎、糖尿病足以及胰腺纤维囊泡症？",
        "output": "select ?x where { ?x <涉及疾病> <小儿特发性间质性肺炎> . ?x <涉及疾病> <糖尿病足> . ?x <涉及疾病> <胰腺纤维囊泡症> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与小儿巨细胞病毒病、小儿先天性肺囊肿以及小儿多源性房性心动过速有关的检查项目是什么？",
        "output": "select ?x where { ?x <涉及疾病> <小儿巨细胞病毒病> . ?x <涉及疾病> <小儿先天性肺囊肿> . ?x <涉及疾病> <小儿多源性房性心动过速> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有小儿先天性肺囊肿、小儿多源性房性心动过速以及急性肾功能不全等疾病时，应该做哪一种检查？",
        "output": "select ?x where { ?x <涉及疾病> <小儿先天性肺囊肿> . ?x <涉及疾病> <小儿多源性房性心动过速> . ?x <涉及疾病> <急性肾功能不全> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎样的检查项目能对小儿多源性房性心动过速、急性肾功能不全以及动静脉血管瘤做出检测？",
        "output": "select ?x where { ?x <涉及疾病> <小儿多源性房性心动过速> . ?x <涉及疾病> <急性肾功能不全> . ?x <涉及疾病> <动静脉血管瘤> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南省博物馆中的长沙马王堆汉墓陈列什么时候对外开放？",
        "output": "select ?x where { <湖南省博物馆> <娱乐项目名称> <长沙马王堆汉墓陈列>. <长沙马王堆汉墓陈列> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州国大雷迪森广场酒店内有专职行李员吗？",
        "output": "select ?x where { <杭州国大雷迪森广场酒店> <是否有专职行李员> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园中的乐寿堂是什么？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <乐寿堂>. <乐寿堂> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日坛宾馆附近的哪个景点可以免费提供婴儿车使用呢？",
        "output": "select ?y  where { <日坛宾馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有婴儿车租赁> <有免费婴儿车租赁>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥森公园附近5km内最贵的酒店是哪一家？",
        "output": "select ?y  where { <奥林匹克森林公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY desc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "石梅湾艾美度假酒店的是哪个品牌旗下的？",
        "output": "select ?x where { <石梅湾艾美度假酒店> <酒店品牌名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑州的如意湖景区什么时间营业？",
        "output": "select ?x where { <如意湖景区> <城市> <郑州> . <如意湖景区> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绍兴饭店吃饭每人需要准备多少钱？",
        "output": "select ?x where { <绍兴饭店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛幻光之城星空艺术馆（台东旗舰店）内有自助讲解机吗？",
        "output": "select ?x where { <青岛幻光之城星空艺术馆（台东旗舰店）> <是否有自助讲解机> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京丽晶酒店的房型最多几个人住",
        "output": "select (max(?x) as ?max_x) where { <北京丽晶酒店> <房型名称> ?y. ?y <容纳人数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中关村皇冠假日酒店的价格是多少？",
        "output": "select ?y where {  <北京中关村皇冠假日酒店> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如果去游玩南京独角兽星空艺术馆旗舰店，有什么推荐的交通路线吗？",
        "output": "select ?x where { <南京独角兽星空艺术馆旗舰店> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚游玩结束三亚红色娘子军演艺公园，请问三亚国光豪生度假酒店在什么方位啊？应该往哪个方向走才能回去休息？",
        "output": "select ?x where { <三亚国光豪生度假酒店> <位于> ?cvt.  ?cvt <实体名称> <三亚红色娘子军演艺公园>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北海公园附近五公里内还有哪些景点",
        "output": "select ?x where { <北海公园> <附近> ?cvt. ?cvt <距离值> \"5\"^^<http://www.w3.org/2001/XMLSchema#float>. ?cvt <实体名称> ?x. ?x <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州失恋博物馆周围有没有能办宴席的酒店？",
        "output": "select ?y where { <广州失恋博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有婚宴服务> <提供婚宴服务,可能收费>. ?y <类型> <酒店>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫多久可以逛完？",
        "output": "select ?x where { <故宫博物院（故宫）> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津独角兽星空艺术馆附近可以给车充电的酒店",
        "output": "select ?y where { <天津独角兽星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有充电车位> <有充电车位>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "余姚阳明温泉山庄能用支付宝吗？",
        "output": "select ?x where { <余姚阳明温泉山庄> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院的平均价格是多少？",
        "output": "select ?x where { <故宫博物院（故宫）> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在北京属于威斯汀的酒店都有什么？",
        "output": "select ?x where { ?x <城市> <北京> . ?x <酒店品牌名称> <威斯汀> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金茂三亚亚龙湾丽思卡尔顿酒店价格",
        "output": "select ?z where { <金茂三亚亚龙湾丽思卡尔顿酒店> <平均价格> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新街口那边南京爱情博物展附近的酒店可帮忙洗衣服的酒店有哪些？",
        "output": "select ?y  where { <南京爱情博物展（新街口总店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有洗衣服务> <有洗衣服务>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波万豪酒店位于哪所城市？",
        "output": "select ?x where { <宁波万豪酒店> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京中心大酒店距离南京金陵状元楼大酒店多少公里？",
        "output": "select ?t where { <南京中心大酒店> <附近> ?cvt. ?cvt <实体名称> <南京金陵状元楼大酒店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南索菲特银座大饭店附近2km有玩的吗？",
        "output": "select ?y where { <济南索菲特银座大饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <济南>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九天温泉酒店在哪所城市？",
        "output": "select ?x where { <思南九天温泉酒店> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在宝石山附近1公里, 且城市在杭州的景点都有什么？",
        "output": "select ?y where { <宝石山> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <杭州>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新昌尊蓝山居，原称绿城雷迪森大酒店有没有WIFI？",
        "output": "select ?x where { <新昌尊蓝山居（原绿城雷迪森大酒店）> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什市的噶尔老城适合游玩几个小时？",
        "output": "select ?x where { <喀什噶尔老城> <城市> <喀什市> . <喀什噶尔老城> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州万豪酒店酒店最早几点可以入住？",
        "output": "select ?x where { <苏州万豪酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园在哪呀？详细地址能发一下吗？",
        "output": "select ?x where { <天坛公园> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院的交通信息如何？",
        "output": "select ?x where { <南京博物院> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "桂林香格里拉大酒店内有行李寄存服务吗？",
        "output": "select ?x where { <桂林香格里拉大酒店> <是否有行李寄存> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚阳光大酒店上午可以入住吗？",
        "output": "select ?x where {  <三亚阳光大酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长春香格里拉大酒店的最晚退房时间是几点？",
        "output": "select ?x where { <长春香格里拉大酒店> <酒店退房时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南华天大酒店房间能加床吗？",
        "output": "select ?x where { <湖南华天大酒店> <是否有能加床> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金茂三亚亚龙湾丽思卡尔顿酒店的酒店什么时候能入住？",
        "output": "select ?x where { <金茂三亚亚龙湾丽思卡尔顿酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州森泊幻想岛什么时候对外开放？",
        "output": "select ?x where { <森泊幻想岛> <城市> <杭州> . <森泊幻想岛> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安天域凯莱大饭店中国风轻奢客房的门禁类型是什么？",
        "output": "select ?g where { <西安天域凯莱大饭店>     <房型名称>      <国风轻奢客房>. <国风轻奢客房>  <门禁类型> ?g. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "去南京恋爱博物馆一般需要多少钱吗？",
        "output": "select ?x where { <南京恋爱博物馆> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南九天温泉酒店的官方门票是多少钱？",
        "output": "select ?x where { <思南九天温泉酒店> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫附近5km内便宜的酒店是多少钱？",
        "output": "select ?price  where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY asc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五缘湾万嘀帆船出海俱乐部是免费的吗？",
        "output": "select ?x where { <五缘湾万嘀帆船出海俱乐部> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在重庆隶属于世纪金源的酒店都有？",
        "output": "select ?x where { ?x <城市> <重庆> . ?x <酒店品牌名称> <世纪金源> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院有多贵？",
        "output": "select ?x where { <国家大剧院> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问下午什么时候可以入住广州中国大酒店？",
        "output": "select ?time where { <广州中国大酒店> <酒店入住开始时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在大连, 且距离新世界酒店附近2公里且价格低于600元的饭店包括哪些？",
        "output": "select ?y where { <大连新世界酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <大连>. ?y <平均价格> ?price. ?y <类型> <酒店>. filter(?price < 600) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国家大剧院什么季节去都行吗？",
        "output": "select ?x where { <国家大剧院> <城市> <北京> . <国家大剧院> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈阳科学宫的详细地址提供一下呗？",
        "output": "select ?x where { <沈阳科学宫> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "常熟金海华丽嘉酒店的地址？",
        "output": "select ?x where { <常熟金海华丽嘉酒店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园中的排云门什么时候营业？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <排云门>. <排云门> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黎城县的壶山温泉适合游玩几个小时？",
        "output": "select ?x where { <壶山温泉> <城市> <黎城县> . <壶山温泉> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州景点有收费停车场、在维景国际酒店附近求推荐",
        "output": "select ?y  where { <杭州维景国际大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有停车场> <有收费停车场>. ?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的浙江世贸君澜大饭店附近2公里都有哪些景点？",
        "output": "select ?y where { <浙江世贸君澜大饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <杭州>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "温州滨海酒店对入住人的年龄有限制条件吗？",
        "output": "select ?x where { <温州滨海大酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的索菲特西湖大酒店附近2公里景点的营业时间是多少？",
        "output": "select ?x where { <杭州索菲特西湖大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> \"2\"^^<http://www.w3.org/2001/XMLSchema#float>. ?y <城市> <杭州>. ?y <营业时间> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "5A的九寨沟风景区官网是多少？",
        "output": "select ?x where { <九寨沟风景区> <景点的等级A> \"5A\" . <九寨沟风景区> <景点官方网站> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "开元名都大酒店在哪个城市？",
        "output": "select ?x where { <开封开元名都大酒店> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏州香格里拉大酒店附近5公里的酒店推荐哪些？",
        "output": "select ?y where { <苏州香格里拉大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <苏州>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京故宫博物院（故宫）附近2公里还有哪些好玩的？",
        "output": "select ?y where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <北京>. ?y <类型> <景点>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南昌力高皇冠假日酒店内有酒吧吗？",
        "output": "select ?x where { <南昌力高皇冠假日酒店> <是否有酒吧> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津的梵高艺术馆有哪些优惠信息？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泉州酒店的wifi情况如何？",
        "output": "select ?x where { <泉州酒店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "入住云阳两江假日酒店对年龄有限制吗？",
        "output": "select ?x where { <云阳两江假日酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的奥林匹克森林公园联系电话是多少？",
        "output": "select ?x where { <奥林匹克森林公园> <城市> <北京> . <奥林匹克森林公园> <电话> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚银泰阳光度假酒店几点可以开始办入住？",
        "output": "select ?x where { <三亚银泰阳光度假酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纳木错国家风景区的详细地址？",
        "output": "select ?x where { <纳木错国家风景区> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家地理探险家中心的详细地址在哪？",
        "output": "select ?x where { <国家地理探险家中心> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纳木错国家风景区内有商店吗？",
        "output": "select ?x where { <纳木错国家风景区> <是否有商店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波开元名都品牌下的酒店都有哪些？",
        "output": "select ?x where { ?x <城市> <宁波> . ?x <酒店品牌名称> <开元名都> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凤凰中心的优惠政策有哪些？",
        "output": "select ?x where { <凤凰中心> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嘉善县酒店品牌名称为君亭的酒店都有啥？",
        "output": "select ?x where { ?x <城市> <嘉善县> . ?x <酒店品牌名称> <君亭> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "自贡中铁檀木林酒店内有多功能厅那？",
        "output": "select ?x where { <自贡中铁檀木林酒店> <是否有多功能厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景点等级为5A的孤山公园在哪所城市？",
        "output": "select ?x where { <孤山公园> <景点的等级A> \"5A\" . <孤山公园> <城市> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贵州天怡豪生大酒店内有高尔夫球场吗？",
        "output": "select ?x where { <贵州天怡豪生大酒店> <是否有高尔夫球场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京中心大酒店附近2公里的景点有哪些？",
        "output": "select ?y where { <南京中心大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> \"2\"^^<http://www.w3.org/2001/XMLSchema#float>. ?y <城市> <南京>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "綦江县哪些景点可以玩一天以上",
        "output": "select ?x where { ?x <城市> <綦江县>. ?x <建议游玩时长> \"1-2天\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩距离魔都星空艺术馆几千米？",
        "output": "select ?t where { <外滩> <附近> ?cvt. ?cvt <实体名称> <魔都星空艺术馆>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安梦幻星空抖乐园（钟楼旗舰店）距离它最近的酒店有多远？",
        "output": "select ?distance  where { <西安梦幻星空抖乐园（钟楼旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安天域凯莱大饭店中的天域套间有电竞设施吗？",
        "output": "select ?g where { <西安天域凯莱大饭店> <房型名称> <天域套间>. <天域套间> <电竞设施> ?g. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅里雪山国家公园是什么级别的景点？",
        "output": "select ?x where { <梅里雪山国家公园> <景点的等级A> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喀什市的喀什噶尔老城的营业时间是什么时候？",
        "output": "select ?x where { <喀什噶尔老城> <城市> <喀什市> . <喀什噶尔老城> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玉龙纳西族自治县的玉龙雪山蓝月谷游玩几个小时可以全部参观一遍？",
        "output": "select ?x where { <玉龙雪山蓝月谷> <城市> <玉龙纳西族自治县> . <玉龙雪山蓝月谷> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑州的如意湖景区的平均价格是多少？",
        "output": "select ?x where { <如意湖景区> <城市> <郑州> . <如意湖景区> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在大连, 且距离新世界酒店附近2公里的饭店包括哪些？",
        "output": "select ?y where { <大连新世界酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <大连>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有西湖景点的联系方式吗？",
        "output": "select ?x where { <西湖风景名胜区（西湖）> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泰合索菲特大饭店在哪所城市？",
        "output": "select ?x where { <成都泰合索菲特大饭店> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "森泊幻想岛有哪些项目对于1.4米以下的儿童需要陪护呢？",
        "output": "select ?y where { <森泊幻想岛> <娱乐项目名称> ?y. ?y <类型> <项目>. ?y <项目限制（一般指身高年龄限制）> \"需要成人陪同;1.4米以下儿童须由成人监护游玩\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长沙有几个4A级别的景点？",
        "output": "select (count(?x) as ?count_city) where {      ?x <城市> <长沙>.     ?x <景点的等级A> \"4A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中奥马哥孛罗大酒店内有咖啡厅吗？",
        "output": "select ?x where { <北京中奥马哥孛罗大酒店> <是否有咖啡厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩有母婴室吗？",
        "output": "select ?x where { <外滩> <是否有母婴室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区是免费景点吗？",
        "output": "select ?x where {  <九寨沟风景区> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天河城那边的天津梵高星空艺术馆啥时候对外开放？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何去清华大学艺术博物馆？有推荐的路线吗？",
        "output": "select ?x where { <清华大学艺术博物馆> <交通信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉萨瑞吉度假酒店附近有哺乳室的景点",
        "output": "select ?y  where { <沈阳皇朝万豪酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有母婴室> ?z.?y <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园附近有能洗衣服的酒店吗？",
        "output": "select ?y where { <景山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有洗衣服务> <有洗衣服务>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香港美利酒店内有专职行李员吗？",
        "output": "select ?x where { <香港美利酒店> <是否有专职行李员> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "时空魔方艺术馆中的吐纳流光1是什么？",
        "output": "select ?x where { <时空魔方艺术馆（中山路旗舰店）> <娱乐项目名称> <吐纳流光1>. <吐纳流光1> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "惠州金海湾喜来登度假酒店的早餐价格是多少？",
        "output": "select ?x where { <惠州金海湾喜来登度假酒店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京独角兽星空艺术馆旗舰店中冰雪奇缘项目的开放时间？",
        "output": "select ?x where { <南京独角兽星空艺术馆旗舰店> <娱乐项目名称> <冰雪奇缘>. <冰雪奇缘> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在千岛湖,且酒店品牌名称为开元度假村的酒店都有啥？",
        "output": "select ?x where { ?x <城市> <千岛湖> . ?x <酒店品牌名称> <开元度假村> . ?x <类型> <酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院中的贞度门对游客有什么限制条件吗？",
        "output": "select ?x where { <故宫博物院（故宫）> <娱乐项目名称> <贞度门>. <贞度门> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "沈阳梵高星空艺术馆到科学宫几公里？",
        "output": "select ?t where { <沈阳梵高星空艺术馆（益田假日世界店）> <附近> ?cvt. ?cvt <实体名称> <沈阳科学宫>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "拉萨包括哪些AAAAA级别的景点？",
        "output": "select ?x where { ?x <城市> <拉萨>. ?x <景点的等级A> \"5A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我刚到武汉锦江国际大酒店，我朋友在附近的武汉新世界酒店，请问我往哪个方向走可以到达我朋友那儿啊？",
        "output": "select ?x where {  <武汉新世界酒店> <位于> ?cvt.  ?cvt <实体名称> <武汉锦江国际大酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东莞梵高星空艺术馆内有母婴室吗？",
        "output": "select ?x where { <东莞梵高星空艺术馆> <是否有母婴室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫附近两公里内最便宜的酒店是多少钱？",
        "output": "select ?price  where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 2). } ORDER BY asc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青海宾馆的最早入住时间是？",
        "output": "select ?x where { <青海宾馆> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南省博物馆的平均价格是多少？",
        "output": "select ?x where { <湖南省博物馆> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "想去萤火虫星空艺术馆（钟楼旗舰店）玩，请问有推荐的路线吗？",
        "output": "select ?x where { <萤火虫星空艺术馆（钟楼旗舰店）> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "离神玉艺术馆距离最近的酒店有多远？",
        "output": "select ?distance  where { <神玉艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院附近有充电车位的酒店",
        "output": "select ?y where { <国家大剧院> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有充电车位> <有充电车位>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京的景山公园适合游玩几个小时？",
        "output": "select ?x where { <景山公园> <城市> <北京> . <景山公园> <建议游玩时长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园的联系方式是什么？",
        "output": "select ?x where { <天坛公园> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津滨海喜来登酒店有多贵？",
        "output": "select ?x where { <天津滨海喜来登酒店> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王府半岛酒店可以打乒乓球吗",
        "output": "select ?x where { <王府半岛酒店> <是否有乒乓球室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫附近的哪个酒店可以提供会议室使用？",
        "output": "select ?y  where { <布达拉宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有会议室> <有会议室>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "品牌为瑞士的酒店在昆山都有哪些家？",
        "output": "select ?x where { ?x <城市> <昆山> . ?x <酒店品牌名称> <瑞士酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚逛完故宫，请问到嘉里大酒店得多远呀？",
        "output": "select ?t where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> <北京嘉里大酒店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海河在哪所城市？",
        "output": "select ?x where { <海河> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波南苑饭店的几点能吃饭？",
        "output": "select ?x where { <宁波南苑饭店> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海河的平均价格是多少？",
        "output": "select ?x where { <海河> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京的永银钱币博物馆详细位置在哪？",
        "output": "select ?x where { <永银钱币博物馆> <城市> <南京> . <永银钱币博物馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "台山君海悦凤凰酒店什么时候能办理入住？",
        "output": "select ?x where { <台山君海悦凤凰酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么才能去思南九天温泉酒店？有推荐的路线吗？",
        "output": "select ?x where { <思南九天温泉酒店> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南九天温泉酒店的老人/小孩有什么优惠政策？",
        "output": "select ?x where { <思南九天温泉酒店> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "富阳国际贸易中心大酒店对客人的年龄有限制吗？",
        "output": "select ?x where { <富阳国际贸易中心大酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京爱情博物展里面的夕阳剪影项目的简短描述是？",
        "output": "select ?x where { <南京爱情博物展（新街口总店）> <娱乐项目名称> <夕阳剪影>. <夕阳剪影> <项目短描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥林匹克森林公园的网址是什么？",
        "output": "select ?x where { <奥林匹克森林公园> <景点官方网站> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京千禧大酒店内有游泳池吗？",
        "output": "select ?x where { <北京千禧大酒店> <是否有游泳池> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南九天温泉酒店的营业时间是什么时候？",
        "output": "select ?x where { <思南九天温泉酒店> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玉龙雪山蓝月谷联系电话是多少？",
        "output": "select ?x where { <玉龙雪山蓝月谷> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南苑饭店的停车场免费吗",
        "output": "select ?x where { <宁波南苑饭店> <是否有停车收费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问财富国际酒店下午几点退房？",
        "output": "select ?time where { <财富国际酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州的独角兽星空艺术馆的平均价格是多少？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <城市> <广州> . <广州独角兽星空艺术馆> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚红色娘子军演艺公园最佳游玩时间是什么时候？",
        "output": "select ?x where { <三亚红色娘子军演艺公园> <最佳游玩时间> ?x . }"
    }
]