[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海贼王里出身水之七岛的是谁？",
        "output": "select ?x where { ?x <登场作品> <海贼王_（尾田荣一郎创作的漫画作品）>. ?x <原居住地> \"水之七岛\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "纪录片舌尖上的中国的导演毕业于哪个学校？",
        "output": "select ?x where { <舌尖上的中国_（2012年陈晓卿执导纪录片）> <导演> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李白都写过哪些诗名中含\"吟\"七言古诗？",
        "output": "select ?x where { ?x <作者> ?y . ?y <本名> \"李白\" . ?x <作品名称> ?z . filter regex(?z, \"吟\") . ?x <文学体裁> <七言古诗> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影钢铁侠的导演都有哪些代表作品？",
        "output": "select ?x where { <Ironman_（美国2008年小罗伯特·唐尼主演电影）> <导演> ?y. ?y <代表作品> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天蝎座的守护神的妻子是谁？",
        "output": "select ?y where { <天蝎座_（占星学）> <守护神> ?x. ?x <配偶> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安徽省会的邮政编码是多少？",
        "output": "select ?y where { <安徽> <省会> ?x . ?x <邮政区码> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著有长篇小说白鹿原的作者有哪些成就？",
        "output": "select ?y where { <白鹿原_（陈忠实长篇小说）> <作者> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北大现任校长有哪些主要成就？",
        "output": "select ?y where { <北京大学> <现任校长> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "身为宦官的齐国公的历史功绩是什么?？",
        "output": "select ?x where { ?y <封爵> <齐国公>. ?y <职业> <宦官>. ?y <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "创立于中国北京的\"MI\"公司的口号是什么？",
        "output": "select ?y where { ?x <外文名称> \"MI\". ?x <公司口号> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你知道守望先锋里的角色的外国名字吗？",
        "output": "select ?y where { <守望先锋_（2016年暴雪娱乐发行的团队射击游戏）> <主要角色> ?x . ?x <外文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朱茵和张智霖合作的电视剧是哪部？",
        "output": "select ?x where { ?x <主演> <朱茵_（中国香港女演员）>. ?x <主演> <张智霖>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英文为\"LA MER\"的品牌是哪个国家的？",
        "output": "select ?y where { ?x <外文名> \"LA MER\". ?x <国别> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "导演李安和演员希斯·莱杰合作的电影是哪一部？",
        "output": "select ?x where { ?x <导演> <李安_（华人导演）>. ?x <主演> <希斯·莱杰>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《随想录》的作者其原名是？",
        "output": "select ?x where { <随想录> <作者> ?y. ?y <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《时间简史》的作者是哪个国家的？",
        "output": "select ?y where { <时间简史_（斯蒂芬·霍金著作）> <作者> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "韩愈写过什么论说文？",
        "output": "select ?x where { <韩愈> <主要作品> ?x. ?x <文学体裁> <论说文>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小迪是哪个经纪公司的？",
        "output": "select ?x where { ?y <别名> \"小迪、胖迪、热巴\". ?y <经纪公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "卖报歌的谱曲者祖籍在哪里？",
        "output": "select ?z where { ?x <中文名称> \"卖报歌\" . ?x <谱曲> ?y . ?y <祖籍> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "俄罗斯的首都是何时建城的？",
        "output": "select ?x where { <俄罗斯_（俄罗斯联邦）> <首都> ?y. ?y <建城时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《白日焰火》的导演有哪些代表作品？",
        "output": "select ?x where { <白日焰火> <导演> ?y. ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问歌手刘德华的妻子出生于哪个国家？",
        "output": "select ?y where { <刘德华_（中国香港男演员、歌手、词作人）> <妻子> ?x. ?x <国籍> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "EXO-M里的中国成员是？",
        "output": "select ?x where { ?x <国籍> <中华人民共和国>. ?x <所属组合> <EXO-M>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "网络动画秦时明月的原作者的英文名是啥？",
        "output": "select ?y where { <秦时明月_（沈乐平执导TV/网络动画系列）> <原作> ?x. ?x <外文名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孙燕姿的出生地的国歌时什么？",
        "output": "select ?x where { <孙燕姿> <出生地> ?y. ?y <国歌> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欧盟国家中官方语言是英语的国家是？",
        "output": "select ?x where { <欧盟_（欧洲经济、政治共同体）> <成员国> ?x. ?x <官方语言> <英语_（语言）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洋毛子说的是哪儿的人啊？",
        "output": "select ?x where { <洋毛子> <特指> ?y. ?y <主要分布> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲《青花瓷》所属专辑有哪些歌曲？",
        "output": "select ?x where { <青花瓷_（周杰伦方文山创作歌曲）> <所属专辑> ?y. ?x <所属专辑> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和杨幂同星座的演员？",
        "output": "select ?x where { <杨幂> <星座> ?y. ?x <职业> <演员_（职业）>. ?x <星座> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别名孙祥钟的演员的助理是谁？",
        "output": "select ?x where { ?y <别名> \"孙祥钟\". ?y <助理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发明地动仪的中国天文学家担任过什么官职？",
        "output": "select ?y where { ?x <主要成就> \"发明地动仪\". ?x <主要成就> \"开创中国天文\". ?x <官职> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "pku的现任校长是谁？",
        "output": "select ?x where { ?y <简称> <pku_（北京大学的英文缩写）>. ?y <现任校长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海贼王里吹牛成性的家伙的外号是什么？",
        "output": "select ?y where { ?x <登场作品> <海贼王_（尾田荣一郎创作的漫画作品）>. ?x <性格> <吹牛_（汉语词语）>. ?x <其他名称> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《半生缘》的作者其出生日期是？",
        "output": "select ?x where { <半生缘_（张爱玲作品）> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为扫帚星的天体，它有怎么样的轨道倾角？",
        "output": "select ?x where { ?y <别称> <扫帚星>. ?y <轨道倾角> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成龙儿子的职业是什么？",
        "output": "select ?x where { <成龙_（中国香港演员、导演）> <儿子> ?y. ?y <职业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张一山和杨紫合作过的作品有哪些？",
        "output": "select ?x where { ?x <主演> <张一山_（中国内地演员）>. ?x <主演> <杨紫>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "那位普瓦捷大学毕业的法国著名哲学家做出了什么突出贡献？",
        "output": "select ?y where { ?x <毕业院校> <普瓦捷大学>. ?x <国籍> <法国_（法兰西共和国）>. ?x <职业> <哲学家_（基础含义）>. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凯撒的祖国的官方语言是什么？",
        "output": "select ?y where { <凯撒_（凯撒）> <国籍> ?x. ?x <官方语言> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海泽王里三种霸气都会的有谁？",
        "output": "select ?x where { ?x <登场作品> <海贼王_（尾田荣一郎创作的漫画作品）>. ?x <霸气种类> \"见闻色\". ?x <霸气种类> \"武装色\". ?x <霸气种类> \"霸王色\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学出了哪些翻译家",
        "output": "select ?x where { ?x <职业> <翻译家> . ?x <毕业院校> <清华大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "主演天地英雄里的河北演员是什么星座？",
        "output": "select ?x where { <红高粱_（1987年张艺谋执导电影）> <主演> ?y. ?y <出生地> <河北_（中国省级行政区）>. ?y <星座> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金庸小说《天龙八部》中，萧远山的冤家擅长什么武功？",
        "output": "select ?z where { <萧远山> <冤家> ?x. ?y <中文名> ?x. ?y <武功> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万万没想到的在线播放平台的官网网址是什么？",
        "output": "select ?z where { ?x <中文名> \"万万没想到\" . ?x <在线播放平台> ?y . ?y <官网> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国有哪些篮球运动员？",
        "output": "select ?x where { ?x <运动项目> <篮球_（球类运动）>. ?x <国籍> <美国_（美利坚合众国）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们会在哪个民俗节日里耍龙灯？",
        "output": "select ?x where { ?x <类别> <民俗>. ?x <节日活动> <耍龙灯>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "写有菩提十书的作家信仰什么宗教？",
        "output": "select ?y where { ?x <代表作品> <菩提十书>. ?x <信仰> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影朝花夕拾的编剧是哪里人？",
        "output": "select ?y where { <朝花夕拾_（1987年方中信主演香港电影）> <编剧> ?x. ?x <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "五岳各有哪些特色？",
        "output": "select ?y where { <五岳_（中国五岳）> ?x ?y. filter(regex(str(?x), \"特色\")). }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李敖组建的性质为认同中华人民共和的政党是哪一个？",
        "output": "select ?x where { ?x <提出组建者> \"李敖\". ?x <党性质> \"认同中华人民共和国的政党\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "董卿主持的正在播出的节目是？",
        "output": "select ?x where { ?x <主持人> <董卿>. ?x <播出状态> \"播出中\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汽车的动力的工作原理是什么？",
        "output": "select ?y where { <汽车> <动力> ?x. ?x <工作原理> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "龙珠主角的招牌招式有什么？",
        "output": "select ?x ?y where { ?x <登场作品> <七龙珠_（漫画《龙珠》改编制作动画）> . ?x <常用招式> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿塞拜疆所属洲的别称是什么？",
        "output": "select ?x where { <阿塞拜疆> <所属洲> ?y. ?y <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "地处华南地区，气候是亚热带季风且部分当地人讲客家话的地级市是？",
        "output": "select ?x where { ?x <气候条件> <亚热带季风气候>. ?x <方言> <客家语>. ?x <行政区类别> <地级市>. ?x <所属地区> <华南地区>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "SARS是一种烈性传染病的英文名字，请问这种病的中文名字叫什么？",
        "output": "select ?y where { ?x <中文名> ?y. ?x <外文名> \"SARS\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华毕业的国家主席都有谁？",
        "output": "select ?x where { <中华人民共和国> <国家领袖> ?x. ?x <毕业院校> <清华大学>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高圆圆和贾静雯共同主演了哪部电视剧？",
        "output": "select ?x where { ?x <主演> <高圆圆>. ?x <主演> <贾静雯>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基因载体的组成是什么？",
        "output": "select ?y where { <基因> <载体> ?x. ?x <组成> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "加拿大的国花长度为多少？",
        "output": "select ?z where { ?x <中文名称> \"加拿大\" . ?x <国花> ?y . ?y <长度> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和钢铁侠有相同能力的人都有谁？",
        "output": "select distinct ?x where { <史塔克_（美国动漫及电影钢铁侠中的人物）> <主要能力> ?y. ?x <主要能力> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四书五经都包括什么？",
        "output": "select ?y where { ?x <中文名> \"四书五经\" . { ?x <四书> ?y . } union{ ?x <五经> ?y . } . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信奉伊斯兰教的中央集权制国家？",
        "output": "select ?x where { ?x <主要宗教> <伊斯兰教>. ?x <国家结构> \"中央集权制\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "直升机有哪些应用？",
        "output": "select ?y where { ?x <中文名> \"直升机\" . ?x <应用领域> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "环太平洋的导演的出生地是哪？",
        "output": "select ?x where { <环太平洋_（美国2013年吉尔莫·德尔·托罗执导的科幻电影）> <导演> ?y. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些思想家信仰共产主义？",
        "output": "select ?x where { ?x <信仰> <共产主义>. ?x <职业> <思想家_（词语）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陵寝是惠陵的人的主要成就是？",
        "output": "select ?y where { ?x <陵寝> <惠陵_（汉昭烈帝刘备陵寝）>. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国历史上当选时最年轻的总统的毕业院校是什么时候创立的？",
        "output": "select ?z where { ?x <主要成就> \"美国历史上当选时最年轻的总统\". ?x <毕业院校> ?y. ?y <创办时间> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"超人主义\"的提出人的代表作品有哪些？",
        "output": "select ?y where { <超人主义> <提出者> ?x. ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出版书籍《宋史新探》的出版社是何时成立的？",
        "output": "select ?x where { <宋史新探> <出版社> ?y. ?y <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王宝强和徐峥共同主演过哪些作品？",
        "output": "select ?x where { ?x <主演> ?y . ?x <主演> ?z . ?y <中文名> \"王宝强\" . ?z <中文名> \"徐峥\" . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《悲惨世界》的作者的主要成就是？",
        "output": "select ?x where { <悲惨世界_（法国作家雨果创作长篇小说）> <作者> ?y. ?y <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "听说咖啡是一个国家的国花，你知道是哪个国家吗？",
        "output": "select ?x where { ?x <国花> <咖啡_（世界三大饮料之一）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冰与火之歌中有些人物？",
        "output": "select ?y where { ?y <登场作品> <冰与火之歌_（乔治·R·R·马丁所著小说）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "世界上海拔最低的地方是？",
        "output": "select ?x where { ?x <世界之最> \"世界海拔最低处\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哥本哈根是哪个国家的首都？",
        "output": "select ?x where { ?x <首都> <哥本哈根_（丹麦王国首都）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿尔贝二世亲王是哪个国家的国王？",
        "output": "select ?x where { ?x <国家领袖> <阿尔贝二世亲王>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《假如给我三天光明》是哪位作家的作品？",
        "output": "select ?x where { ?x <代表作品> <假如给我三天光明>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲演员的mv导演是谁？",
        "output": "select ?x where { <演员_（薛之谦歌曲）> <mv导演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水浒传是什么体裁的作品？",
        "output": "select ?x where { <水浒传_（中国古典长篇小说，四大名著之一）> <文学体裁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "儒家学派的代表人物有哪些？",
        "output": "select ?x where { <儒家_（信奉孔子学说的学派）> <代表人物> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "嘉明镇的气候条件是怎样的？",
        "output": "select ?x where { <嘉明镇> <气候条件> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西班牙城市圣地亚哥的外文名称是？",
        "output": "select ?x where { <圣地亚哥_（西班牙城市）> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "齐鲁大地被用来指代我国的哪个省？",
        "output": "select ?x where { ?x <别名> \"齐鲁、\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《辛德勒的名单》的导演是谁？",
        "output": "select ?x where { <辛德勒的名单> <导演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海贼里百兽凯多在漫画、动画里第一次正式出现是什么时候？",
        "output": "select ?y where { <百兽_（《海贼王》虚构人物）> <初登场> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "白雪公主和七个小矮人的故事最早在哪个国家出版？",
        "output": "select ?x where { <白雪公主_（欧洲大陆流传童话故事）> <最早出版> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧《爱情公寓》是何时上映的？",
        "output": "select ?x where { <爱情公寓_（韦正导演的都市爱情情景喜剧）> <上映时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肯德基有多少员工？",
        "output": "select ?x where { <肯德基> <员工数> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "侯仁之先生最突出的成就是什么？",
        "output": "select ?x where { <侯仁之> <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "变形金刚是什么时候上映的？",
        "output": "select ?x where { <变形金刚_（2007年派拉蒙影业真人版电影）> <上映时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "辽宁舰舰长是谁？",
        "output": "select ?x where { <辽宁号航空母舰> <舰长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蝙蝠侠加入了哪些组织？",
        "output": "select ?x where { <蝙蝠侠_（美国DC漫画旗下超级英雄）> <所属团队> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "彩虹西餐厅的人均消费是多少？",
        "output": "select ?x where { <彩虹西餐厅> <人均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《夏洛特烦恼》是何时上映的？",
        "output": "select ?x where { <夏洛特烦恼_（开心麻花2015年同名舞台剧改编的电影）> <上映时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "克苏鲁属于哪个群体？",
        "output": "select ?y where { <克苏鲁_（克苏鲁的呼唤神话小说里面的邪灵角色）> <所属> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "迈克尔·杰克逊在什么时间去世的？",
        "output": "select ?x where { <迈克尔·杰克逊> <逝世日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汽车的外文名是什么？",
        "output": "select ?x where { <汽车> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧《请回答1988》是哪个国家制作的？",
        "output": "select ?x where { <请回答1988> <制片地区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "川西荆芥的拉丁学名是什么？",
        "output": "select ?x where { <川西荆芥> <拉丁学名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "姜夔的去世时间是什么？",
        "output": "select ?x where { <姜夔> <去世时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘慈欣代表作？",
        "output": "select ?x where { <刘慈欣> <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "臭氧层有什么作用？",
        "output": "select ?x where { <臭氧层> <影响及作用> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影速度与激情的拍摄地点有？",
        "output": "select ?x where { <速度与激情_（美国赛车动作主题系列电影）> <拍摄地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉大学的现任校长是谁？",
        "output": "select ?x where { <武汉大学> <现任校长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蔡元培毕业于哪里？",
        "output": "select ?x where { <蔡元培> <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员刘昊然的本名叫什么？",
        "output": "select ?y where { <刘昊然> <别名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诸葛亮的别名是什么？",
        "output": "select ?x where { <诸葛亮_（三国时期蜀汉丞相）> <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肯德基的母公司是哪家公司？",
        "output": "select ?x where { <肯德基> <母公司> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于湖南的石鼓书院推荐玩多久啊？",
        "output": "select ?x where { <石鼓书院> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赵本山是属什么的？",
        "output": "select ?x where { <赵本山> <生肖> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧冰与火之歌是哪个公司出品？",
        "output": "select ?y where { <冰与火之歌_（美国HBO电视台制作的电视剧）> <出品公司> ?y.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "澳大利亚著名企业有哪些？",
        "output": "select ?x where { <澳大利亚> <著名企业> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "琵琶演奏有哪些流派？",
        "output": "select ?x where { <琵琶_（乐器）> <流派> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "紫荆花的拉丁学名是什么？",
        "output": "select ?x where { <紫荆花_（豆科植物）> <拉丁学名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些地区的道路是靠左行驶的？",
        "output": "select ?x where { ?x <道路通行> \"靠左驾驶\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "火药是哪个朝代的科技？",
        "output": "select ?x where { ?x <科技成就> \"火药\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《怦然心动》的主要演员？",
        "output": "select ?x where { <怦然心动_（美国2010年罗伯·莱纳执导电影）> <主演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蝙蝠侠是哪国人？",
        "output": "select ?x where { <蝙蝠侠_（美国DC漫画旗下超级英雄）> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "摩根大通有多少资产？",
        "output": "select ?x where { <摩根大通> <总资产> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"琴棋书画\"具体指什么内容？",
        "output": "select ?x where { <琴棋书画_（成语）> <内容> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "麦当劳的口号是什么？",
        "output": "select ?x where { <麦当劳> <公司口号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "姜夔有哪些主要作品？",
        "output": "select ?x where { <姜夔> <主要作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学位于哪个区？",
        "output": "select ?x where { <清华大学> <所属地区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我想知道演员霍思燕的生日？",
        "output": "select ?y where { <霍思燕> <出生日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冰箱的英文名是什么？",
        "output": "select ?x where { <冰箱_（保持恒定低温的一种制冷设备）> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血友病有哪些症状？",
        "output": "select ?x where { <血友病_（医疗百科）> <常见症状> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华大学的地址是哪里？",
        "output": "select ?x where { <清华大学> <学校地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "番茄的双名法命名？",
        "output": "select ?x where { <番茄_（茄科茄属植物）> <拉丁学名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苏轼的代表作？",
        "output": "select ?x where { <苏轼_（北宋文学家）> <主要作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"信言不美，美言不信\"是谁说过的话？",
        "output": "select ?x where { <信言不美，美言不信> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你知道冥王星的密度吗？",
        "output": "select ?x where { <冥王星_（太阳系中的一个天体）> <平均密度> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《海贼王》是哪位漫画师的作品？",
        "output": "select ?x where { <海贼王_（尾田荣一郎创作的漫画作品）> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电脑游戏《红色警戒》的制作商是谁？",
        "output": "select ?x where { <红色警戒_（《命令与征服》系列的即时战略游戏）> <开发商> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "玉兰这种植物多分布于哪？",
        "output": "select ?x where { <玉兰_（木兰科木兰属植物）> <分布区域> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "一天喝多少牛奶最合适呀？",
        "output": "select ?x where { <牛奶_（饮品）> <最佳日用量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲布列瑟农的原唱是谁？",
        "output": "select ?x where { <布列瑟农> <歌曲原唱> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陈奕迅什么时候出生的？",
        "output": "select ?x where { <陈奕迅> <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京大学的现任校长是谁？",
        "output": "select ?x where { <南京大学> <现任校长> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外号叫小胖、小樊的是哪位乒乓球运动员？",
        "output": "select ?x where { ?x <别名> \"小胖、小樊\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光合作用是在哪个部位起作用的？",
        "output": "select ?x where { <光合作用> <作用部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学的校庆日？",
        "output": "select ?x where { <北京大学> <校庆日> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张继科有个绰号叫什么来着？",
        "output": "select ?x where { <张继科> <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"烟花三月下扬州\"中的扬州市又称为？",
        "output": "select ?x where { <扬州_（江苏省省辖市）> <别名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在挪威人们主要信仰什么教？",
        "output": "select ?x where { <挪威> <主要宗教> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张继科是什么项目的运动员？",
        "output": "select ?x where { <张继科> <运动项目> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杜康酒用什么原料酿造？",
        "output": "select ?x where { <杜康酒> <主要原料> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汽车是哪一年发明的？",
        "output": "select ?x where { <汽车> <发明日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张靓颖是什么星座的？",
        "output": "select ?x where { <张靓颖> <星座> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "罗荣桓的妻子是谁？",
        "output": "select ?x where { ?x <配偶> <罗荣桓> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆市的电话区号是多少？",
        "output": "select ?x where { <重庆_（中华人民共和国直辖市）> <电话区号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"红豆生南国\"这句话来源于哪首诗？",
        "output": "select ?x where { <红豆生南国_（王维的诗《相思》）> <作品名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北邮是什么类型的大学？",
        "output": "select ?x where { <北京邮电大学> <学校类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中大发展的目标是什么？",
        "output": "select ?x where { <中山大学_（中国广东省高校）> <发展定位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "书籍<高官反腐录>的价格是多少？",
        "output": "select ?x where { <高官反腐录> <定价> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在哪个网站能看动画片神厨小福贵？",
        "output": "select ?x where { <神厨小福贵> <网络播放> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皇马的主场是哪？",
        "output": "select ?x where { <皇家马德里_（皇家马德里足球俱乐部）> <主场馆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天狼星和地球距离是多少？",
        "output": "select ?x where { <天狼_（大犬座α星）> <距地距离> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大耳朵图图一共有多少集呀？",
        "output": "select ?x where { <大耳朵图图> <集数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "猎户座中最亮的星星是那颗？",
        "output": "select ?x where { <猎户座_（天文学概念）> <最亮星> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京在哪里？",
        "output": "select ?x where { <北京_（中华人民共和国首都）> <所属地区> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "曾三次获得花滑世锦赛女单冠军的亚洲选手是？",
        "output": "select ?x where { ?x <重要事件> \"亚洲第一个三次获此殊荣的女单\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "秦始皇的功绩有什么？",
        "output": "select ?x where { <秦始皇_（中国首位皇帝）> <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "姜夔的主要成就是什么？",
        "output": "select ?x where { <姜夔> <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "灯影牛肉是什么菜系的菜？",
        "output": "select ?x where { <灯影牛肉> <分类> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "导演雷德利·斯科特是哪个国家的？",
        "output": "select ?x where { <雷德利·斯科特> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "迈克尔·杰克逊的经纪公司是哪一个？",
        "output": "select ?x where { <迈克尔·杰克逊> <经纪公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "林清玄何时出生？",
        "output": "select ?x where { <林清玄> <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汉武帝在位时做过什么让他名留青史？",
        "output": "select ?x where { <汉武帝_（汉朝皇帝）> <主要成就> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "品牌哈森成立于哪一年？",
        "output": "select ?x where { <哈森_（皮鞋品牌）> <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口红的成分？",
        "output": "select ?x where { <口红_（美容修饰类化妆品）> <成分> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员曾安琪身高是多少？",
        "output": "select ?x where { <曾安琪> <身高> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "帕瓦罗蒂全名叫什么？",
        "output": "select ?x where { <帕瓦罗蒂_（意大利著名歌手）> <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "书画家郑板桥在哪里出生？",
        "output": "select ?y where { <郑板桥_（清代书画家、文学家）> <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "F-22战斗机是哪一年开始服役的？",
        "output": "select ?x where { <F-22战斗机> <服役时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可口可乐竞争对手是？",
        "output": "select ?y where { <可口可乐> <竞争对手> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京语言大学的校长是谁？",
        "output": "select ?x where { <北京语言大学> <现任校长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长江三峡是指哪三峡？",
        "output": "select ?x where { <三峡_（长江三峡简称）> <组成> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小明想去安徽玩，你能为他推荐几个景点吗？",
        "output": "select ?x where { <安徽> <著名景点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "请问有多少人居住在伯罗奔尼撒半岛？",
        "output": "select ?x where { <伯罗奔尼撒半岛> <人口> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德意志帝国海军的外文名？",
        "output": "select ?x where { <德意志帝国海军> <外文名> ?x. }"
    }
]