[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体寒冷凝集试验有什么样的特别提示需要注意？",
        "output": "select ?x where { <肺炎支原体寒冷凝集试验> <提示> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规检查时会有哪些不良反应？",
        "output": "select ?x where { <血常规> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规有怎样的适应症？",
        "output": "select ?x where { <血常规> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规的参考值范围是什么？",
        "output": "select ?x where { <血常规> <参考值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淋巴细胞计数会有怎样的不良反应？",
        "output": "select ?x where { <淋巴细胞计数> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淋巴细胞计数的检查有何临床意义？",
        "output": "select ?x where { <淋巴细胞计数> <临床意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "D-二聚体的外文名字叫什么？",
        "output": "select ?x where { <D-二聚体> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌红蛋白这一检查的适应症是什么？",
        "output": "select ?x where { <肌红蛋白> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌红蛋白有什么样的临床意义？",
        "output": "select ?x where { <肌红蛋白> <临床意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌红蛋白检查有怎样的参考值？",
        "output": "select ?x where { <肌红蛋白> <参考值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌钙蛋白的测定有没有什么不良反应？",
        "output": "select ?x where { <肌钙蛋白> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "测定肌钙蛋白有怎样的临床意义？",
        "output": "select ?x where { <肌钙蛋白> <临床意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳、鼻、咽拭子细菌培养会有哪些不良反应？",
        "output": "select ?x where { <耳、鼻、咽拭子细菌培养> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳、鼻、咽拭子细菌培养的适应症是什么？",
        "output": "select ?x where { <耳、鼻、咽拭子细菌培养> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血氧分压会对哪些人有不良反应？",
        "output": "select ?x where { <动脉血氧分压> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "氧分压会引发什么不良反应？",
        "output": "select ?x where { <氧分压> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "氧分压的适应症是什么？",
        "output": "select ?x where { <氧分压> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "氧分压对于不同人群参考值有哪些？",
        "output": "select ?x where { <氧分压> <参考值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿常规有没有不良反应？",
        "output": "select ?x where { <尿常规> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿常规这一检查有哪些注意事项？",
        "output": "select ?x where { <尿常规> <注意事项> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿常规有怎样的适应症？",
        "output": "select ?x where { <尿常规> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿常规检查的参考值是什么？",
        "output": "select ?x where { <尿常规> <参考值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血气分析会伴随不良反应吗？",
        "output": "select ?x where { <动脉血气分析> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血气分析有哪些注意事项？",
        "output": "select ?x where { <动脉血气分析> <注意事项> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心肌酶的详细过程是怎样的？",
        "output": "select ?x where { <心肌酶> <详细过程> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "体温有什么样的适应症？",
        "output": "select ?x where { <体温> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征有什么治疗方法？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <治疗方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于急性呼吸窘迫综合征如何预防？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征有哪些临床表现？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征的ICD10编码是多少？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征有什么诊断依据？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有急性呼吸窘迫综合征要如何进行药物治疗？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <药物治疗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克的发病部位在哪？",
        "output": "select ?x where { <休克> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克会有哪些并发症？",
        "output": "select ?x where { <休克> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克的ICD10编码是多少？",
        "output": "select ?x where { <休克> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克有怎样的发病机制？",
        "output": "select ?x where { <休克> <发病机制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克的高发人群在哪个年龄？",
        "output": "select ?x where { <休克> <高发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "该怎么预防冠状病毒感染？",
        "output": "select ?x where { <冠状病毒感染> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染患者有哪些临床表现？",
        "output": "select ?x where { <冠状病毒感染> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染的并发症有哪些？",
        "output": "select ?x where { <冠状病毒感染> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染的ICD10编码是多少？",
        "output": "select ?x where { <冠状病毒感染> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染有怎样的发病机制？",
        "output": "select ?x where { <冠状病毒感染> <发病机制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染的高发人群是什么？",
        "output": "select ?x where { <冠状病毒感染> <高发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎的常见病因有什么？",
        "output": "select ?x where { <皮肌炎> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎的发病部位在哪？",
        "output": "select ?x where { <皮肌炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有皮肌炎有怎样的治疗方法？",
        "output": "select ?x where { <皮肌炎> <治疗方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防皮肌炎？",
        "output": "select ?x where { <皮肌炎> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎患者有哪些临床表现？",
        "output": "select ?x where { <皮肌炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有皮肌炎有哪些饮食禁忌？",
        "output": "select ?x where { <皮肌炎> <饮食禁忌> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎会伴随什么并发症？",
        "output": "select ?x where { <皮肌炎> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎的ICD10编码是什么？",
        "output": "select ?x where { <皮肌炎> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有皮肌炎该如何进行药物治疗？",
        "output": "select ?x where { <皮肌炎> <药物治疗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有皮肌炎的高发人群是什么？",
        "output": "select ?x where { <皮肌炎> <高发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎的外文名字是什么？",
        "output": "select ?x where { <衣原体肺炎> <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎的发病部位在哪？",
        "output": "select ?x where { <衣原体肺炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "该怎么预防衣原体肺炎？",
        "output": "select ?x where { <衣原体肺炎> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有衣原体肺炎有哪些临床表现？",
        "output": "select ?x where { <衣原体肺炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎会伴随什么样的并发症？",
        "output": "select ?x where { <衣原体肺炎> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎的ICD10编码是多少？",
        "output": "select ?x where { <衣原体肺炎> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎该如何诊断？",
        "output": "select ?x where { <衣原体肺炎> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何通过药物治疗衣原体肺炎？",
        "output": "select ?x where { <衣原体肺炎> <药物治疗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎的高发人群是什么？",
        "output": "select ?x where { <衣原体肺炎> <高发人群> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎该怎么进行随访工作？",
        "output": "select ?x where { <衣原体肺炎> <随访> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管炎有什么别称？",
        "output": "select ?x where { <血管炎> <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管炎患者有哪些临床表现？",
        "output": "select ?x where { <血管炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性肺炎是否有它的传播途径？",
        "output": "select ?x where { <病毒性肺炎> <传播途径> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性肺炎的MeSH编号是多少？",
        "output": "select ?x where { <病毒性肺炎> <MeSH> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性肺炎的ICD10编码是什么？",
        "output": "select ?x where { <病毒性肺炎> <ICD10> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性肺炎的eMedicine是什么？",
        "output": "select ?x where { <病毒性肺炎> <eMedicine> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从医学专科角度看，病毒性肺炎属于什么？",
        "output": "select ?x where { <病毒性肺炎> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌性肺炎的ICD10编码是什么？",
        "output": "select ?x where { <细菌性肺炎> <ICD10> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌性肺炎的ICD9CM编码是多少？",
        "output": "select ?x where { <细菌性肺炎> <ICD9CM> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学专科领域中，细菌性肺炎属于什么疾病？",
        "output": "select ?x where { <细菌性肺炎> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "社区获得性肺炎的发病部位在哪？",
        "output": "select ?x where { <社区获得性肺炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于社区获得性肺炎有哪些治疗方法？",
        "output": "select ?x where { <社区获得性肺炎> <治疗方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何预防社区获得性肺炎？",
        "output": "select ?x where { <社区获得性肺炎> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有社区获得性肺炎会有怎样的临床表现？",
        "output": "select ?x where { <社区获得性肺炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "社区获得性肺炎常见的并发症会有哪些？",
        "output": "select ?x where { <社区获得性肺炎> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "社区获得性肺炎的ICD10编码是多少？",
        "output": "select ?x where { <社区获得性肺炎> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "社区获得性肺炎患者如何进行药物治疗？",
        "output": "select ?x where { <社区获得性肺炎> <药物治疗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "关于社区获得性肺炎这一疾病，如何对此进行随访工作？",
        "output": "select ?x where { <社区获得性肺炎> <随访> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液有没有传染性？",
        "output": "select ?x where { <胸腔积液> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液的发病部位在哪？",
        "output": "select ?x where { <胸腔积液> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液有怎样的治疗方法？",
        "output": "select ?x where { <胸腔积液> <治疗方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "预防胸腔积液是为了预防什么？",
        "output": "select ?x where { <胸腔积液> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液患者有哪些临床表现？",
        "output": "select ?x where { <胸腔积液> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液会有哪些并发症？",
        "output": "select ?x where { <胸腔积液> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液会有怎样的预后表现？",
        "output": "select ?x where { <胸腔积液> <预后> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液的ICD10编码是多少？",
        "output": "select ?x where { <胸腔积液> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液可以诊断吗？",
        "output": "select ?x where { <胸腔积液> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "对于胸腔积液应该如何进行药物治疗？",
        "output": "select ?x where { <胸腔积液> <药物治疗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么预防细菌感染？",
        "output": "select ?x where { <细菌感染> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌感染会伴随怎样的并发症？",
        "output": "select ?x where { <细菌感染> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌感染患者预后效果如何？",
        "output": "select ?x where { <细菌感染> <预后> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如何诊断是否为细菌感染？",
        "output": "select ?x where { <细菌感染> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素不敏感综合征是如何预防的？",
        "output": "select ?x where { <糖皮质激素不敏感综合征> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素不敏感综合征会引发什么并发症？",
        "output": "select ?x where { <糖皮质激素不敏感综合征> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素不敏感综合征是怎么诊断的？",
        "output": "select ?x where { <糖皮质激素不敏感综合征> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素不敏感综合征随访工作需要注意什么？",
        "output": "select ?x where { <糖皮质激素不敏感综合征> <随访> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素性青光眼有怎样的治疗方法？",
        "output": "select ?x where { <糖皮质激素性青光眼> <治疗方法> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么预防糖皮质激素性青光眼？",
        "output": "select ?x where { <糖皮质激素性青光眼> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素性青光眼的ICD10编码是什么？",
        "output": "select ?x where { <糖皮质激素性青光眼> <ICD10编码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素性青光眼有怎样的发病机制？",
        "output": "select ?x where { <糖皮质激素性青光眼> <发病机制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素性青光眼是怎么诊断的？",
        "output": "select ?x where { <糖皮质激素性青光眼> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "患有糖皮质激素性青光眼该怎么进行药物治疗？",
        "output": "select ?x where { <糖皮质激素性青光眼> <药物治疗> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "怎么诊断急性发热性嗜中性皮肤病？",
        "output": "select ?x where { <急性发热性嗜中性皮肤病> <诊断> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "经行发热有没有传染性？",
        "output": "select ?x where { <经行发热> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "经行发热的发病部位在哪里？",
        "output": "select ?x where { <经行发热> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "破伤风的发病部位在哪儿？",
        "output": "select ?x where { <破伤风> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "破伤风的ICD10编码是多少？",
        "output": "select ?x where { <破伤风> <ICD10> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "破伤风的ICD9CM编码是多少？",
        "output": "select ?x where { <破伤风> <ICD9CM> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "破伤风的eMedicine是什么？",
        "output": "select ?x where { <破伤风> <eMedicine> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从医学专科角度讲，破伤风属于什么科？",
        "output": "select ?x where { <破伤风> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "破伤风的DiseasesDB的编号是多少？",
        "output": "select ?x where { <破伤风> <DiseasesDB> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "破伤风的MedlinePlus编号是什么？",
        "output": "select ?x where { <破伤风> <MedlinePlus> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病有没有传染性？",
        "output": "select ?x where { <结核病> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病的发病部位在哪里？",
        "output": "select ?x where { <结核病> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病的MeSH编码是多少？",
        "output": "select ?x where { <结核病> <MeSH> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病的ICD10编码是什么？",
        "output": "select ?x where { <结核病> <ICD10> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病的ICD9CM编码是多少？",
        "output": "select ?x where { <结核病> <ICD9CM> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病的eMedicine是什么？",
        "output": "select ?x where { <结核病> <eMedicine> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从医学专科上来讲，结核病属于什么科？",
        "output": "select ?x where { <结核病> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病的DiseasesDB编码是什么？",
        "output": "select ?x where { <结核病> <DiseasesDB> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病的MedlinePlus编码是多少？",
        "output": "select ?x where { <结核病> <MedlinePlus> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "结核病中OMIM的编码是什么？",
        "output": "select ?x where { <结核病> <OMIM> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑动脉硬化症发病部位在哪？",
        "output": "select ?x where { <脑动脉硬化症> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑动脉硬化症患者有怎样的临床表现？",
        "output": "select ?x where { <脑动脉硬化症> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学专科中，脑动脉硬化症属于什么科？",
        "output": "select ?x where { <脑动脉硬化症> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泌尿道感染中MeSH编码是什么？",
        "output": "select ?x where { <泌尿道感染> <MeSH> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泌尿道感染中ICD10编码是什么？",
        "output": "select ?x where { <泌尿道感染> <ICD10> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泌尿道感染中ICD9CM编码是多少？",
        "output": "select ?x where { <泌尿道感染> <ICD9CM> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泌尿道感染的eMedicine是什么？",
        "output": "select ?x where { <泌尿道感染> <eMedicine> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泌尿道感染在医学专科中属于什么科？",
        "output": "select ?x where { <泌尿道感染> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泌尿道感染中的DiseasesDB编码是什么？",
        "output": "select ?x where { <泌尿道感染> <DiseasesDB> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泌尿道感染的MedlinePlus编码是多少？",
        "output": "select ?x where { <泌尿道感染> <MedlinePlus> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性乙型肝炎有没有传染性？",
        "output": "select ?x where { <慢性乙型肝炎> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性乙型肝炎的英文名称是什么？",
        "output": "select ?x where { <慢性乙型肝炎> <英文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性乙型肝炎在医学专科中属于什么科？",
        "output": "select ?x where { <慢性乙型肝炎> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血小板增多症有没有传染性？",
        "output": "select ?x where { <血小板增多症> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血小板增多症的常见病因有哪些？",
        "output": "select ?x where { <血小板增多症> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血小板增多症会有哪些临床表现？",
        "output": "select ?x where { <血小板增多症> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血小板增多症在医学专科中属于什么科？",
        "output": "select ?x where { <血小板增多症> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈椎病患者有哪些临床表现？",
        "output": "select ?x where { <颈椎病> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈椎病在医学专科中属于什么科？",
        "output": "select ?x where { <颈椎病> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "骨髓炎有没有传染性？",
        "output": "select ?x where { <骨髓炎> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霉菌性阴道炎有没有传染性？",
        "output": "select ?x where { <霉菌性阴道炎> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿肺炎有没有传染性？",
        "output": "select ?x where { <新生儿肺炎> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿肺炎的发病部位在哪儿？",
        "output": "select ?x where { <新生儿肺炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿肺炎患者有哪些临床表现？",
        "output": "select ?x where { <新生儿肺炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿肺炎在医学专科中属于什么？",
        "output": "select ?x where { <新生儿肺炎> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "滴虫性阴道炎的别称是什么？",
        "output": "select ?x where { <滴虫性阴道炎> <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "滴虫性阴道炎有没有传染性？",
        "output": "select ?x where { <滴虫性阴道炎> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痛性抽搐有没有传染性？",
        "output": "select ?x where { <痛性抽搐> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有雀斑的人有何临床表现？",
        "output": "select ?x where { <雀斑> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肾衰竭有没有传染性？",
        "output": "select ?x where { <肾衰竭> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肾衰竭患者会有怎样的临床表现？",
        "output": "select ?x where { <肾衰竭> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "会厌炎有没有传染性？",
        "output": "select ?x where { <会厌炎> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "会厌炎的发病部位在哪儿？",
        "output": "select ?x where { <会厌炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "会厌炎患者有怎样的临床表现？",
        "output": "select ?x where { <会厌炎> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝内胆管结石有没有传染性？",
        "output": "select ?x where { <肝内胆管结石> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝内胆管结石的发病部位在哪？",
        "output": "select ?x where { <肝内胆管结石> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝内胆管结石患者会有哪些临床表现？",
        "output": "select ?x where { <肝内胆管结石> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡的发病部位在哪儿？",
        "output": "select ?x where { <口腔溃疡> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡的eMedicine怎样的？",
        "output": "select ?x where { <口腔溃疡> <eMedicine> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在医学专科中口腔溃疡属于什么科？",
        "output": "select ?x where { <口腔溃疡> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "口腔溃疡的MedlinePlus编号是多少？",
        "output": "select ?x where { <口腔溃疡> <MedlinePlus> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三叉神经痛有没有传染性？",
        "output": "select ?x where { <三叉神经痛> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "类风湿关节炎有没有传染性？",
        "output": "select ?x where { <类风湿关节炎> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "类风湿关节炎发病部位在哪里？",
        "output": "select ?x where { <类风湿关节炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "类风湿关节炎的病因是什么？",
        "output": "select ?x where { <类风湿关节炎> <病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多囊肾有没有传染性？",
        "output": "select ?x where { <多囊肾> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多囊肾还有哪些名称？",
        "output": "select ?x where { <多囊肾> <名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多囊肾发病部位在哪？",
        "output": "select ?x where { <多囊肾> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多囊肾患者会有什么临床表现？",
        "output": "select ?x where { <多囊肾> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多囊肾在医学专科中属于哪个科？",
        "output": "select ?x where { <多囊肾> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "消化性溃疡有什么别称？",
        "output": "select ?x where { <消化性溃疡> <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "消化性溃疡的发病部位在哪？",
        "output": "select ?x where { <消化性溃疡> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "内痔的发病部位在哪？",
        "output": "select ?x where { <内痔> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "内痔在医学专科中属于哪个科？",
        "output": "select ?x where { <内痔> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸入性肺炎的发病部位在哪？",
        "output": "select ?x where { <吸入性肺炎> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸入性肺炎会带来什么样的并发症？",
        "output": "select ?x where { <吸入性肺炎> <并发症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸入性肺炎的盛行率是多少？",
        "output": "select ?x where { <吸入性肺炎> <盛行率> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸入性肺炎患者要吃什么药物？",
        "output": "select ?x where { <吸入性肺炎> <药物> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝衰竭的主要症状有哪些？",
        "output": "select ?x where { <肝衰竭> <主要症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝衰竭的发病部位在哪？",
        "output": "select ?x where { <肝衰竭> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "先天愚型患者有哪些临床表现？",
        "output": "select ?x where { <先天愚型> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从医学专科上讲，先天愚型属于什么科？",
        "output": "select ?x where { <先天愚型> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "增龄性黄斑变性发病部位在哪？",
        "output": "select ?x where { <增龄性黄斑变性> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "增龄性黄斑变性有怎样的临床表现？",
        "output": "select ?x where { <增龄性黄斑变性> <临床表现> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从医学专科上讲，增龄性黄斑变性属于什么科？",
        "output": "select ?x where { <增龄性黄斑变性> <医学专科> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈动脉狭窄有没有传染性？",
        "output": "select ?x where { <颈动脉狭窄> <传染性> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颈动脉狭窄的发病部位在哪？",
        "output": "select ?x where { <颈动脉狭窄> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胆囊结石的发病部位在哪？",
        "output": "select ?x where { <胆囊结石> <发病部位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胆囊结石病的病因是怎样的？",
        "output": "select ?x where { <胆囊结石> <病因> ?x. }"
    }
]