[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福州隶属于威斯汀的酒店有哪些？",
        "output": "select ?x where { ?x <城市> <福州> . ?x <酒店品牌名称> <威斯汀> . ?x <类型> <酒店>}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在长沙距离湖南华天大酒店5公里以内的景点有哪些？",
        "output": "select ?y where { <湖南华天大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <长沙>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津的空中之翼飞行跳伞俱乐部门票价格多少钱？",
        "output": "select ?x where { <空中之翼航空飞行跳伞俱乐部> <城市> <天津> . <空中之翼航空飞行跳伞俱乐部> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "去颐和园观看清晏舫有什么政策要求吗？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <清晏舫>. <清晏舫> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店梦外滩影视公园的具体在哪儿？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "抚州荣誉国际酒店有熨衣服的服务吗？",
        "output": "select ?x where { <抚州荣誉国际酒店> <是否有熨衣服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南华天大酒店在哪所城市？",
        "output": "select ?x where { <湖南华天大酒店> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟卧龙海是什么样子的？",
        "output": "select ?x where { <九寨沟风景区> <娱乐项目名称> <卧龙海>. <卧龙海> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东营蓝海国际大饭店在哪所城市？",
        "output": "select ?x where { <东营蓝海国际大饭店> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "距离湖南省博物馆最近的那家酒店叫什么？",
        "output": "select ?y  where { <湖南省博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神玉艺术馆比较近的有洗衣服务的酒店",
        "output": "select ?y  where { <神玉艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有洗衣服务> <有洗衣服务>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "森泊幻想岛的联系电话是多少？",
        "output": "select ?x where { <森泊幻想岛> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "济南索菲特银座大饭店附近5公里的景点包括？",
        "output": "select ?y where { <济南索菲特银座大饭店> <附近> ?x . ?x <实体名称> ?y . ?x <距离值> ?d . ?y <类型> <景点> . filter(?d < 5) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南昌锦峰大酒店的支付方式有哪些？",
        "output": "select ?x where { <南昌锦峰大酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "听说南京爱情博物展（新街口总店）是全年收费的，请问该景点有什么优待政策吗？",
        "output": "select ?x where { <南京爱情博物展（新街口总店）> <是否免费> \"全年收费\" . <南京爱情博物展（新街口总店）> <优待政策> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在南京有几个金陵连锁旗下的酒店？",
        "output": "select (count(?x) as ?count_city) where {  ?x <城市> <南京> .  ?x <酒店品牌名称> <金陵连锁> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店梦外滩影视主题公园的官方门票价格是多少？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆的巅峰乐园几天可以游玩结束？",
        "output": "select ?x where { <重庆·巅峰乐园> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚玩完沈阳科学宫，请问步行5公里能走到的景点都有什么？",
        "output": "select ?y where { <沈阳科学宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无锡金陵大饭店的支付方式包括哪些？",
        "output": "select ?x where { <无锡金陵大饭店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "绍兴国际大酒店内有高尔夫球场吗？",
        "output": "select ?x where { <绍兴国际大酒店> <是否有高尔夫球场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "三亚的国光豪生度假酒店支持哪些支付方式？",
        "output": "select ?x where { <三亚国光豪生度假酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫博物院有什么优惠政策？",
        "output": "select ?x where { <故宫博物院（故宫）> <优待政策> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "空中之翼航空飞行跳伞俱乐部什么时候营业？",
        "output": "select ?x where { <空中之翼航空飞行跳伞俱乐部> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鹏润国际大酒店都有什么早餐？",
        "output": "select ?x where { <鹏润国际大酒店> <早餐类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁海金海开元名都大酒店早餐多少钱呢？",
        "output": "select ?x where { <宁海金海开元名都大酒店> <早餐价格> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海河附近有充电车位的酒店",
        "output": "select ?y where { <海河> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有充电车位> <有充电车位>. ?y <类型> <酒店>.  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "惠州金海湾喜来登度假酒店有网吗？",
        "output": "select ?x where { <惠州金海湾喜来登度假酒店> <wifi情况> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津独角兽星空艺术馆中超级万花筒有什么限制吗？",
        "output": "select ?x where { <天津独角兽星空艺术馆> <娱乐项目名称> <超级万花筒>. <超级万花筒> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区有哪些优待政策？",
        "output": "select ?x where { <九寨沟风景区> <城市> <九寨沟县> . <九寨沟风景区> <优待政策> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我想去美丽的泉城济南游玩，准备去等级为5A的景点看看，请问方便搜一下这些景点的联系方式吗？",
        "output": "select ?x where { ?y <城市> <济南> . ?y <景点的等级A> \"5A\" . ?y <电话> ?x .  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京独角兽星空艺术馆旗舰店中万花幻境项目什么时候对外开放啊？",
        "output": "select ?x where { <南京独角兽星空艺术馆旗舰店> <娱乐项目名称> <万花幻境>. <万花幻境> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "带了老人，在羊卓雍措能玩哪些没限制的项目呢？",
        "output": "select ?y where { <羊卓雍措> <娱乐项目名称> ?y. ?y <项目限制（一般指身高年龄限制）> \"无限制\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国宾酒店附近2公里都有什么酒店？",
        "output": "select ?y where { <北京国宾酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆·巅峰乐园的联系电话是多少？",
        "output": "select ?x where { <重庆·巅峰乐园> <电话> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凯玄国际大酒店内有接机服务吗？",
        "output": "select ?x where { <凯玄国际大酒店> <是否有接机服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无锡金陵大饭店的早餐价格多少钱？",
        "output": "select ?x where { <无锡金陵大饭店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆巅峰乐园门票多少？",
        "output": "select ?x where { <重庆·巅峰乐园> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都新东方千禧大酒店电话是什么？",
        "output": "select ?x where { <成都新东方千禧大酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江杭州国际大酒店附近2公里景点的营业时间是多少？",
        "output": "select ?x where { <浙江国际大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?d. ?y <城市> <杭州>. ?y <营业时间> ?x. filter(?d<=2)}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店梦外滩影视主题公园收门票吗？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京神玉馆在什么地方？",
        "output": "select ?x where { <神玉艺术馆> <城市> <北京> . <神玉艺术馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "永银钱币博物馆在南京爱情博物展（新街口总店）的什么方向？",
        "output": "select ?x where { <永银钱币博物馆> <位于> ?cvt.  ?cvt <实体名称> <南京爱情博物展（新街口总店）>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京颐和园的淡季和旺季分别是什么时候？",
        "output": "select ?x where { <颐和园> <城市> <北京> . <颐和园> <淡季旺季> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江南国大酒店在杭州西湖的什么方位？",
        "output": "select ?x where { <浙江南国大酒店> <位于> ?cvt.  ?cvt <实体名称> <西湖风景名胜区（西湖）>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全年免费的济南护城河在什么地方？",
        "output": "select ?x where { <济南护城河> <是否免费> \"全年免费\" . <济南护城河> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "明天就要去故宫了，请问一下其中的青铜器馆是什么样的啊？",
        "output": "select ?x where { <故宫博物院（故宫）> <娱乐项目名称> <青铜器馆>. <青铜器馆> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津海河沿线有哪些酒店",
        "output": "select ?x where { <海河> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本溪富虹国际饭店的入住年龄限制都有哪些？",
        "output": "select ?x where { <本溪富虹国际饭店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在南京，永银钱币博物馆附近5公里低于五十块钱的景点有什么？",
        "output": "select ?y where { <永银钱币博物馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <南京>. ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 50) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中山路时空魔方艺术馆位于晋江宝辉大酒店的方位？",
        "output": "select ?x where { <时空魔方艺术馆（中山路旗舰店）> <位于> ?cvt.  ?cvt <实体名称> <晋江宝辉大酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雍和宫附近哪个酒店能唱歌？",
        "output": "select ?y where { <雍和宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有KTV> <有KTV>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长沙的梅溪湖国际文化艺术中心艺术馆《流动的永恒》展平均价格是多少？",
        "output": "select ?x where { <梅溪湖国际文化艺术中心艺术馆《流动的永恒》展> <城市> <长沙> . <梅溪湖国际文化艺术中心艺术馆《流动的永恒》展> <平均价格> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳富苑皇冠假日套房酒店的酒店入住开始时间？",
        "output": "select ?x where { <深圳富苑皇冠假日套房酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金茂三亚亚龙湾丽思卡尔顿酒店的联系方式是多少？",
        "output": "select ?x where { <金茂三亚亚龙湾丽思卡尔顿酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波哪些酒店有三人间的房型",
        "output": "select distinct ?x where { ?x <城市> <宁波>. ?x <房型名称> ?y. ?x <类型> <酒店>. ?y <容纳人数> ?number. filter(?number = 3) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州国大雷迪森广场酒店附近5公里的酒店还有哪些？",
        "output": "select ?y where { <杭州国大雷迪森广场酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东莞梵高星空艺术馆是否免费？",
        "output": "select ?x where { <东莞梵高星空艺术馆> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院门票多少钱？",
        "output": "select ?x where { <南京博物院> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安建国饭店有房间能住3个人吗？",
        "output": "select ?y where { <西安建国饭店> <房型名称> ?y. ?y <容纳人数> ?number. filter(?number = 3) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在北京西苑饭店附近5公里, 且同一个城市的酒店都有哪些？",
        "output": "select ?y where { <北京西苑饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大庆市博物馆中关于东北第四纪哺乳动物的描述？",
        "output": "select ?x where { <大庆市博物馆> <娱乐项目名称> <东北第四纪哺乳动物>. <东北第四纪哺乳动物> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥林匹克森林公园的玩儿几个小时合适？",
        "output": "select ?x where { <奥林匹克森林公园> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区中珍珠滩瀑布的项目营业时间？",
        "output": "select ?x where { <九寨沟风景区> <娱乐项目名称> <珍珠滩瀑布>. <珍珠滩瀑布> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "求有无烟楼层的酒店，孤山公园附近的",
        "output": "select ?y  where { <孤山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有无烟楼层> ?z. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "隶属于喜来登的酒店在江阴有哪几家？",
        "output": "select ?x where { ?x <城市> <江阴> . ?x <酒店品牌名称> <喜来登> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孤山公园什么时候营业？",
        "output": "select ?x where { <孤山公园> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳阳光酒店5公里内还有什么酒店？",
        "output": "select ?y where { <深圳阳光酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）和孤山公园相隔几公里？",
        "output": "select ?t where { <杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）> <附近> ?cvt. ?cvt <实体名称> <孤山公园>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成都家园国际酒店什么时候能入住？",
        "output": "select ?x where { <成都家园国际酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "柳巷那里的猫咪博物馆能停车吗？",
        "output": "select ?x where { <猫咪博物馆（柳巷旗舰店）> <是否有停车场> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日坛宾馆的酒店几点可以入住？",
        "output": "select ?x where { <日坛宾馆> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "求南京恋爱博物馆周围能免费停车的酒店",
        "output": "select ?x where { <南京恋爱博物馆> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <是否有停车场> <有免费停车场>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩附近有哪些酒店？",
        "output": "select ?y where { <外滩> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京国际饭店附近5公里的景点都有哪些？",
        "output": "select ?y where { <北京国际饭店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中山路的时空魔方艺术馆的地址发一下？",
        "output": "select ?x where { <时空魔方艺术馆（中山路旗舰店）> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "魔都星空艺术馆附近有可以在室内免费游泳的酒店吗？",
        "output": "select ?y where { <魔都星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有游泳池> <室内泳池免费>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在宁波南苑环球酒店附近5公的酒店有哪些推荐？",
        "output": "select ?y where { <宁波南苑环球酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <类型> <酒店>. }"
    }
]