[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "代谢性酸中毒属于什么？",
        "output": "select ?x where { <代谢性酸中毒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "代谢性酸中毒涉及哪些症状？",
        "output": "select ?x where { <代谢性酸中毒> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "代谢性酸中毒与哪些疾病有关？",
        "output": "select ?x where { <代谢性酸中毒> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低氧血症属于什么？",
        "output": "select ?x where { <低氧血症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低氧血症涉及哪些症状？",
        "output": "select ?x where { <低氧血症> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低氧血症与哪些疾病有关？",
        "output": "select ?x where { <低氧血症> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸窘迫综合征属于什么？",
        "output": "select ?x where { <呼吸窘迫综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凝血功能障碍属于什么？",
        "output": "select ?x where { <凝血功能障碍> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凝血功能障碍涉及什么症状？",
        "output": "select ?x where { <凝血功能障碍> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凝血功能障碍与哪些疾病有关？",
        "output": "select ?x where { <凝血功能障碍> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低热属于什么？",
        "output": "select ?x where { <低热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低热涉及哪些症状？",
        "output": "select ?x where { <低热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低热与哪些疾病有关？",
        "output": "select ?x where { <低热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高热属于什么？",
        "output": "select ?x where { <高热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高热涉及哪些症状？",
        "output": "select ?x where { <高热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高热与哪些疾病有关？",
        "output": "select ?x where { <高热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭属于什么？",
        "output": "select ?x where { <呼吸衰竭> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭涉及哪些症状？",
        "output": "select ?x where { <呼吸衰竭> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "呼吸衰竭与哪些疾病有关？",
        "output": "select ?x where { <呼吸衰竭> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺实变属于什么？",
        "output": "select ?x where { <肺实变> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺实变涉及哪些症状？",
        "output": "select ?x where { <肺实变> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺实变与哪些疾病有关？",
        "output": "select ?x where { <肺实变> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不明原因发热属于什么？",
        "output": "select ?x where { <不明原因发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不明原因发热涉及什么检查项目？",
        "output": "select ?x where { <不明原因发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不明原因发热涉及哪些症状？",
        "output": "select ?x where { <不明原因发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不明原因发热与哪些疾病有关？",
        "output": "select ?x where { <不明原因发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽属于什么？",
        "output": "select ?x where { <咳嗽> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽涉及什么检查项目？",
        "output": "select ?x where { <咳嗽> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽涉及哪些症状？",
        "output": "select ?x where { <咳嗽> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽与什么疾病有关？",
        "output": "select ?x where { <咳嗽> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "倦怠属于什么？",
        "output": "select ?x where { <倦怠> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脘痞属于什么？",
        "output": "select ?x where { <脘痞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脘痞涉及哪些症状？",
        "output": "select ?x where { <脘痞> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咽干属于什么？",
        "output": "select ?x where { <咽干> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "便秘属于什么？",
        "output": "select ?x where { <便秘> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "便秘涉及哪些症状？",
        "output": "select ?x where { <便秘> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "便秘与什么疾病有关？",
        "output": "select ?x where { <便秘> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "喘憋属于什么？",
        "output": "select ?x where { <喘憋> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄痰属于什么？",
        "output": "select ?x where { <黄痰> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹胀属于什么？",
        "output": "select ?x where { <腹胀> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹胀涉及哪些症状？",
        "output": "select ?x where { <腹胀> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气促属于什么？",
        "output": "select ?x where { <气促> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气喘属于什么？",
        "output": "select ?x where { <气喘> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气喘涉及哪些症状？",
        "output": "select ?x where { <气喘> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气喘与什么疾病有关？",
        "output": "select ?x where { <气喘> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "身热属于什么？",
        "output": "select ?x where { <身热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苔黄腻属于什么？",
        "output": "select ?x where { <苔黄腻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "苔黄腻涉及哪些症状？",
        "output": "select ?x where { <苔黄腻> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "烦躁属于什么？",
        "output": "select ?x where { <烦躁> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气短属于什么？",
        "output": "select ?x where { <气短> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气短涉及哪些症状？",
        "output": "select ?x where { <气短> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "气短与什么疾病有关？",
        "output": "select ?x where { <气短> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无力属于什么？",
        "output": "select ?x where { <无力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无力涉及哪些症状？",
        "output": "select ?x where { <无力> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "无力与什么疾病有关？",
        "output": "select ?x where { <无力> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长期使用糖皮质激素导致的损害属于什么？",
        "output": "select ?x where { <长期使用糖皮质激素导致的损害> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长期使用糖皮质激素导致的损害涉及哪些症状？",
        "output": "select ?x where { <长期使用糖皮质激素导致的损害> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长期使用糖皮质激素导致的损害与什么疾病有关？",
        "output": "select ?x where { <长期使用糖皮质激素导致的损害> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "癌性发热属于什么？",
        "output": "select ?x where { <癌性发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "癌性发热涉及什么检查？",
        "output": "select ?x where { <癌性发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "癌性发热涉及哪些症状？",
        "output": "select ?x where { <癌性发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "癌性发热与什么疾病有关？",
        "output": "select ?x where { <癌性发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不规则发热属于什么？",
        "output": "select ?x where { <不规则发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻前庭发热、干燥、痒以及触痛属于什么？",
        "output": "select ?x where { <鼻前庭发热、干燥、痒以及触痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "产后发热属于什么？",
        "output": "select ?x where { <产后发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "产后发热涉及什么检查？",
        "output": "select ?x where { <产后发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "产后发热涉及哪些症状？",
        "output": "select ?x where { <产后发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "产后发热与什么疾病有关？",
        "output": "select ?x where { <产后发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴关节肿痛属于什么？",
        "output": "select ?x where { <发热伴关节肿痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴关节肿痛涉及哪些症状？",
        "output": "select ?x where { <发热伴关节肿痛> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴关节肿痛与什么疾病有关？",
        "output": "select ?x where { <发热伴关节肿痛> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴出血属于什么？",
        "output": "select ?x where { <发热伴出血> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴出血涉及哪些症状？",
        "output": "select ?x where { <发热伴出血> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴出血与什么疾病有关？",
        "output": "select ?x where { <发热伴出血> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴咳嗽、咯痰、胸痛属于什么？",
        "output": "select ?x where { <发热伴咳嗽、咯痰、胸痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴咳嗽、咯痰、胸痛涉及哪些症状？",
        "output": "select ?x where { <发热伴咳嗽、咯痰、胸痛> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴咳嗽、咯痰、胸痛与什么疾病有关？",
        "output": "select ?x where { <发热伴咳嗽、咯痰、胸痛> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴寒战属于什么？",
        "output": "select ?x where { <发热伴寒战> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴寒战涉及哪些症状？",
        "output": "select ?x where { <发热伴寒战> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴寒战与什么疾病有关？",
        "output": "select ?x where { <发热伴寒战> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴有皮疹属于什么？",
        "output": "select ?x where { <发热伴有皮疹> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴有皮疹涉及哪些症状？",
        "output": "select ?x where { <发热伴有皮疹> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴有皮疹与什么疾病有关？",
        "output": "select ?x where { <发热伴有皮疹> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴有腹痛、腹泻、恶心、呕吐属于什么？",
        "output": "select ?x where { <发热伴有腹痛、腹泻、恶心、呕吐> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴有腹痛、腹泻、恶心、呕吐涉及哪些症状？",
        "output": "select ?x where { <发热伴有腹痛、腹泻、恶心、呕吐> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴淋巴结肿大、并伴触痛属于什么？",
        "output": "select ?x where { <发热伴淋巴结肿大、并伴触痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴淋巴结肿大、并伴触痛涉及哪些症状？",
        "output": "select ?x where { <发热伴淋巴结肿大、并伴触痛> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴淋巴结肿大、并伴触痛与什么疾病有关？",
        "output": "select ?x where { <发热伴淋巴结肿大、并伴触痛> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴眼睛充血属于什么？",
        "output": "select ?x where { <发热伴眼睛充血> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴眼睛充血涉及哪些症状？",
        "output": "select ?x where { <发热伴眼睛充血> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴眼睛充血与什么疾病有关？",
        "output": "select ?x where { <发热伴眼睛充血> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹痛，发热及黄疸属于什么？",
        "output": "select ?x where { <腹痛，发热及黄疸> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹痛，发热及黄疸涉及哪些症状？",
        "output": "select ?x where { <腹痛，发热及黄疸> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹痛，发热及黄疸与什么疾病有关？",
        "output": "select ?x where { <腹痛，发热及黄疸> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性发热属于什么？",
        "output": "select ?x where { <非感染性发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性发热涉及什么检查项目？",
        "output": "select ?x where { <非感染性发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性发热涉及哪些症状？",
        "output": "select ?x where { <非感染性发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性发热与什么疾病有关？",
        "output": "select ?x where { <非感染性发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咯血伴发热属于什么？",
        "output": "select ?x where { <咯血伴发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咯血伴发热涉及哪些症状？",
        "output": "select ?x where { <咯血伴发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咯血伴发热与什么疾病有关？",
        "output": "select ?x where { <咯血伴发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感染性发热属于什么？",
        "output": "select ?x where { <感染性发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感染性发热要检查什么？",
        "output": "select ?x where { <感染性发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感染性发热涉及哪些症状？",
        "output": "select ?x where { <感染性发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "感染性发热与什么疾病有关？",
        "output": "select ?x where { <感染性发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全身过敏和发热皮疹关节痛属于什么？",
        "output": "select ?x where { <全身过敏和发热皮疹关节痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全身过敏和发热皮疹关节痛要检查什么？",
        "output": "select ?x where { <全身过敏和发热皮疹关节痛> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全身过敏和发热皮疹关节痛涉及哪些症状？",
        "output": "select ?x where { <全身过敏和发热皮疹关节痛> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全身过敏和发热皮疹关节痛与什么疾病有关？",
        "output": "select ?x where { <全身过敏和发热皮疹关节痛> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "术后发热属于什么？",
        "output": "select ?x where { <术后发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "术后发热要检查什么？",
        "output": "select ?x where { <术后发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "术后发热涉及哪些症状？",
        "output": "select ?x where { <术后发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "术后发热与什么疾病有关？",
        "output": "select ?x where { <术后发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中枢性发热属于什么？",
        "output": "select ?x where { <中枢性发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中枢性发热要检查什么？",
        "output": "select ?x where { <中枢性发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中枢性发热涉及哪些症状？",
        "output": "select ?x where { <中枢性发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周期性畏寒发热出汗热退症状属于什么？",
        "output": "select ?x where { <周期性畏寒发热出汗热退症状> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周期性畏寒发热出汗热退症状涉及哪些症状？",
        "output": "select ?x where { <周期性畏寒发热出汗热退症状> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周期性畏寒发热出汗热退症状与什么疾病有关？",
        "output": "select ?x where { <周期性畏寒发热出汗热退症状> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿发热属于什么？",
        "output": "select ?x where { <小儿发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿发热涉及哪些症状？",
        "output": "select ?x where { <小儿发热> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿发热与什么疾病有关？",
        "output": "select ?x where { <小儿发热> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长期发热属于什么？",
        "output": "select ?x where { <长期发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "足心发热属于什么？",
        "output": "select ?x where { <足心发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "足心发热要检查什么？",
        "output": "select ?x where { <足心发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凛寒发热属于什么？",
        "output": "select ?x where { <凛寒发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "凛寒发热要检查什么？",
        "output": "select ?x where { <凛寒发热> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "麻疹，发热出疹性疾病等属于什么？",
        "output": "select ?x where { <麻疹，发热出疹性疾病等> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发热伴血小板减少属于什么？",
        "output": "select ?x where { <发热伴血小板减少> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "风湿热、肾炎、一般发热属于什么？",
        "output": "select ?x where { <风湿热、肾炎、一般发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宫缩乏力属于什么？",
        "output": "select ?x where { <宫缩乏力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宫缩乏力涉及哪些症状？",
        "output": "select ?x where { <宫缩乏力> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宫缩乏力与什么疾病有关？",
        "output": "select ?x where { <宫缩乏力> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "疲倦乏力属于什么？",
        "output": "select ?x where { <疲倦乏力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢乏力属于什么？",
        "output": "select ?x where { <下肢乏力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢肿胀和乏力属于什么？",
        "output": "select ?x where { <下肢肿胀和乏力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢肿胀和乏力涉及哪些症状？",
        "output": "select ?x where { <下肢肿胀和乏力> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "下肢肿胀和乏力与什么疾病有关？",
        "output": "select ?x where { <下肢肿胀和乏力> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肢体乏力属于什么？",
        "output": "select ?x where { <肢体乏力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孕妇乏力属于什么？",
        "output": "select ?x where { <孕妇乏力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刺激性干咳属于什么？",
        "output": "select ?x where { <刺激性干咳> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿干咳属于什么？",
        "output": "select ?x where { <小儿干咳> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿干咳涉及哪些症状？",
        "output": "select ?x where { <小儿干咳> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿干咳与什么疾病有关？",
        "output": "select ?x where { <小儿干咳> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸困难属于什么？",
        "output": "select ?x where { <急性呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸困难涉及哪些症状？",
        "output": "select ?x where { <急性呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸困难与什么疾病有关?",
        "output": "select ?x where { <急性呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽伴呼吸困难属于什么？",
        "output": "select ?x where { <咳嗽伴呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽伴呼吸困难涉及哪些症状？",
        "output": "select ?x where { <咳嗽伴呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "咳嗽伴呼吸困难与什么疾病有关?",
        "output": "select ?x where { <咳嗽伴呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "发作性呼吸困难属于什么？",
        "output": "select ?x where { <发作性呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺源性呼吸困难属于什么？",
        "output": "select ?x where { <肺源性呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺源性呼吸困难涉及哪些症状？",
        "output": "select ?x where { <肺源性呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺源性呼吸困难与什么疾病有关?",
        "output": "select ?x where { <肺源性呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "劳力性呼吸困难属于什么？",
        "output": "select ?x where { <劳力性呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "劳力性呼吸困难涉及哪些症状？",
        "output": "select ?x where { <劳力性呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "劳力性呼吸困难与什么疾病有关?",
        "output": "select ?x where { <劳力性呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平卧呼吸困难属于什么？",
        "output": "select ?x where { <平卧呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平卧呼吸困难涉及哪些症状？",
        "output": "select ?x where { <平卧呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "平卧呼吸困难与什么疾病有关?",
        "output": "select ?x where { <平卧呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水肿伴呼吸困难、紫绀属于什么？",
        "output": "select ?x where { <水肿伴呼吸困难、紫绀> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水肿伴呼吸困难、紫绀涉及哪些症状？",
        "output": "select ?x where { <水肿伴呼吸困难、紫绀> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水肿伴呼吸困难、紫绀与什么疾病有关?",
        "output": "select ?x where { <水肿伴呼吸困难、紫绀> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "吸气性呼吸困难属于什么？",
        "output": "select ?x where { <吸气性呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心源性呼吸困难属于什么？",
        "output": "select ?x where { <心源性呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心源性呼吸困难涉及哪些症状？",
        "output": "select ?x where { <心源性呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心源性呼吸困难与什么疾病有关?",
        "output": "select ?x where { <心源性呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸痛伴呼吸困难属于什么？",
        "output": "select ?x where { <胸痛伴呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸痛伴呼吸困难涉及哪些症状？",
        "output": "select ?x where { <胸痛伴呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸痛伴呼吸困难与什么疾病有关?",
        "output": "select ?x where { <胸痛伴呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阵发性夜间呼吸困难属于什么？",
        "output": "select ?x where { <阵发性夜间呼吸困难> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阵发性夜间呼吸困难涉及哪些症状？",
        "output": "select ?x where { <阵发性夜间呼吸困难> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阵发性夜间呼吸困难与什么疾病有关?",
        "output": "select ?x where { <阵发性夜间呼吸困难> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞及反射性头痛属于什么？",
        "output": "select ?x where { <鼻塞及反射性头痛> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞及反射性头痛涉及哪些症状？",
        "output": "select ?x where { <鼻塞及反射性头痛> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞及反射性头痛与什么疾病有关?",
        "output": "select ?x where { <鼻塞及反射性头痛> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞排出脓性或血性分泌物属于什么？",
        "output": "select ?x where { <鼻塞排出脓性或血性分泌物> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻塞排出脓性或血性分泌物会涉及哪些症状？",
        "output": "select ?x where { <鼻塞排出脓性或血性分泌物> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "侧卧时位于下侧鼻腔出现鼻塞属于什么？",
        "output": "select ?x where { <侧卧时位于下侧鼻腔出现鼻塞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "侧卧时位于下侧鼻腔出现鼻塞与什么疾病有关?",
        "output": "select ?x where { <侧卧时位于下侧鼻腔出现鼻塞> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在进行肺炎衣原体核酸检测时有哪些注意事项？",
        "output": "select ?x where { <肺炎衣原体核酸检测> <注意事项> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体核酸检测会有什么样的适应症?",
        "output": "select ?x where { <肺炎衣原体核酸检测> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿液肺炎链球菌抗原检测试验具有哪些适应症？",
        "output": "select ?x where { <尿液肺炎链球菌抗原检测试验> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体补体结合试验会有哪些不良反应？",
        "output": "select ?x where { <肺炎支原体补体结合试验> <不良反应> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体补体结合试验的注意事项是什么？",
        "output": "select ?x where { <肺炎支原体补体结合试验> <注意事项> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体补体结合试验有什么临床意义？",
        "output": "select ?x where { <肺炎支原体补体结合试验> <临床意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体补体结合试验的参考值是什么？",
        "output": "select ?x where { <肺炎支原体补体结合试验> <参考值> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎克雷伯杆菌抗体测定时的注意事项有哪些？",
        "output": "select ?x where { <肺炎克雷伯杆菌抗体测定> <注意事项> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎克雷伯杆菌抗体测定有哪些临床意义？",
        "output": "select ?x where { <肺炎克雷伯杆菌抗体测定> <临床意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体抗体测定有什么临床意义？",
        "output": "select ?x where { <肺炎支原体抗体测定> <临床意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "针对肺炎支原体抗体测定有哪些标本要求？",
        "output": "select ?x where { <肺炎支原体抗体测定> <标本要求> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎球菌抗原检测有哪些适应症？",
        "output": "select ?x where { <肺炎球菌抗原检测> <适应症> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体抗体测定有何临床意义？",
        "output": "select ?x where { <肺炎衣原体抗体测定> <临床意义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体抗体测定有什么标本要求？",
        "output": "select ?x where { <肺炎衣原体抗体测定> <标本要求> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体寒冷凝集试验会伴随什么样的不良反应？",
        "output": "select ?x where { <肺炎支原体寒冷凝集试验> <不良反应> ?x. }"
    }
]