[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波梵高星空艺术馆大概能玩多久",
        "output": "select ?x where { <宁波梵高星空艺术馆（天一广场旗舰店）> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区的诺日朗群海什么时间可以去？",
        "output": "select ?x where { <九寨沟风景区> <娱乐项目名称> <诺日朗群海>. <诺日朗群海> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江阴黄佳喜来登酒店能给电动汽车充电吗？",
        "output": "select ?x where { <江阴黄嘉喜来登酒店> <是否有充电车位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海有哪些带免费游泳池的酒店",
        "output": "select ?x where { ?x <城市> <上海>. ?x <类型> <酒店>. ?x <是否有游泳池> <室内泳池免费>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津独角兽星空艺术馆有母婴室吗？",
        "output": "select ?x where { <天津独角兽星空艺术馆> <是否有母婴室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天津梵高星空艺术馆周围5km的景点？",
        "output": "select ?y where { <天津梵高星空艺术馆（天河城旗舰店）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <天津>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在北京的凤凰中心门票多少钱？",
        "output": "select ?x where { <凤凰中心> <城市> <北京> . <凤凰中心> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅州客天下国际大酒店几点可以办入住？",
        "output": "select ?x where { <梅州客天下国际大酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "不可思议星空解压馆是免费的吗？",
        "output": "select ?x where { <不可思议星空解压馆> <是否免费> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在武汉其距离武汉锦江国际大酒店附近5公里的酒店还有哪些？想换个地方住。",
        "output": "select ?y where { <武汉锦江国际大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <武汉>. ?y <类型> <酒店>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宏源国际饭店的联系方式是多少？",
        "output": "select ?x where { <宏源国际饭店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波梵高星空艺术馆门票多少钱？",
        "output": "select ?x where { <宁波梵高星空艺术馆（天一广场旗舰店）> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赣州锦江国际酒店有没有不让抽烟的楼层啊？",
        "output": "select ?x where { <赣州锦江国际酒店> <是否有无烟楼层> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆合川华地王朝大酒店的就餐时间是几点？",
        "output": "select ?x where { <重庆合川华地王朝大酒店> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "儿童可以独立入住浙江国际大酒店吗",
        "output": "select ?x where { <浙江国际大酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园中南湖岛项目5岁可以玩吗？",
        "output": "select ?x where { <颐和园> <娱乐项目名称> <南湖岛>. <南湖岛> <项目限制（一般指身高年龄限制）> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "还有100块钱，还可以去北京雍和宫附近5公里的哪些景点玩？",
        "output": "select ?y where { <雍和宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 100) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在北京东方君悦大酒店住宿，请问其附近5公里的景点都有什么？",
        "output": "select ?y where { <北京东方君悦大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院在哪所城市？",
        "output": "select ?x where { <国家大剧院> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京有几个马哥孛罗旗下的酒店你知道吗？",
        "output": "select (count(?x) as ?count_city) where {  ?x <城市> <北京> .  ?x <酒店品牌名称> <马哥孛罗酒店> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "永银钱币博物馆听说是全年收费的，它有什么优惠政策？",
        "output": "select ?x where { <永银钱币博物馆> <是否免费> \"全年收费\" . <永银钱币博物馆> <景点简介-优惠信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "如意湖景区的地址在哪？",
        "output": "select ?x where { <如意湖景区> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京昆仑饭店里面可以泡温泉吗？",
        "output": "select ?x where { <北京昆仑饭店> <是否有温泉> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "昆明中维翠湖宾馆的酒店什么时候能入住？",
        "output": "select ?x where { <昆明中维翠湖宾馆> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "去广州旅游，请问广州中国大酒店附近2公里的景点都有啥呀？",
        "output": "select ?x where { <广州中国大酒店> <附近> ?cvt . ?cvt <实体名称> ?x . ?cvt <距离值> ?distance . filter(?distance <= 2.0) ?x <城市> <广州> . ?x <类型> <景点> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "离故宫最近的酒店是哪一个？",
        "output": "select ?y  where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. } ORDER BY ASC(?distance) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布尔津县有哪几个5A级别的景点？",
        "output": "select ?x where {      ?x <城市> <布尔津县>.     ?x <景点的等级A> \"5A\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "山西丽华大酒店内有健身房吗？",
        "output": "select ?x where { <山西丽华大酒店> <是否有健身房> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "估计多少钱可以入住厦门鼓浪湾酒店吗？",
        "output": "select ?x where { <厦门鼓浪湾酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南九天温泉酒店内能吃饭吗？",
        "output": "select ?x where { <思南九天温泉酒店> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州维景国际大酒店几点可以办理入住？",
        "output": "select ?x where { <杭州维景国际大酒店> <酒店入住开始时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "峨眉山世纪阳光大酒店的支付方式有哪些？",
        "output": "select ?x where { <峨眉山世纪阳光大酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在上海，星空艺术馆附近1公里都有什么景点？",
        "output": "select ?y where { <魔都星空艺术馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 1). ?y <城市> <上海>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京金融街威斯汀大酒店附近5公里的景点包括哪些？",
        "output": "select ?y where { <北京金融街威斯汀大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州国大雷迪森广场酒店附近5公里的均价高于一千块钱的酒店还有哪些？",
        "output": "select ?y where { <杭州国大雷迪森广场酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?price > 1000) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京距离北海公园附近5公里的酒店？",
        "output": "select ?y where { <北海公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安阳光国际大酒店什么时候可以接机呢？",
        "output": "select ?x where { <西安阳光国际大酒店> <是否有接机服务-营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安威斯汀大酒店内有接送服务吗？",
        "output": "select ?x where { <西安威斯汀大酒店> <是否有接送服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "全年收费的九寨沟风景区的交通信息如何？可以推荐一下相关乘车路线吗？",
        "output": "select ?x where { <九寨沟风景区> <是否免费> \"全年收费\" . <九寨沟风景区> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江世贸君澜大饭店的早餐类型包括什么？",
        "output": "select ?x where { <浙江世贸君澜大饭店> <早餐类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从首都宾馆到故宫有多远？",
        "output": "select ?t where { <首都宾馆（原首都大酒店）> <附近> ?cvt. ?cvt <实体名称> <故宫博物院（故宫）>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京金陵状元楼大酒店附近2公里的景点中价格低于50的都有哪些？",
        "output": "select ?y where { <南京金陵状元楼大酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <南京>. ?y <类型> <景点>. ?y <平均价格> ?price. filter(?price < 50) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州西湖星空魔幻城成人票多少钱？",
        "output": "select ?x where { <杭州西湖星空魔幻城（星空艺术馆品牌旗舰店）> <官方门票数据> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "丽江泸沽湖景区的优待政策是什么？",
        "output": "select ?x where { <丽江泸沽湖景区> <优待政策> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州星河湾酒店内可以游泳吗？",
        "output": "select ?x where { <广州星河湾酒店> <是否有游泳池> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景点等级为4A的大庆市博物馆的营业时间是什么时候？",
        "output": "select ?x where { <大庆市博物馆> <景点的等级A> \"4A\" . <大庆市博物馆> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梵高星空艺术馆（天河城旗舰店）在哪所城市？",
        "output": "select ?x where { <天津梵高星空艺术馆（天河城旗舰店）> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波南苑环球酒店的早餐价格多少钱？",
        "output": "select ?y where { <宁波南苑环球酒店> <城市> <宁波>. <宁波南苑环球酒店> <早餐价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛附近5km内便宜的酒店是多少钱？",
        "output": "select ?price  where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. ?y <类型> <酒店>. ?y <平均价格> ?price. filter(?distance <= 5). } ORDER BY asc(?price) LIMIT 1"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥林匹克公园附近哪些酒店可以办婚宴",
        "output": "select ?x where { <奥林匹克森林公园> <附近> ?cvt. ?cvt <实体名称> ?x. ?x <是否有婚宴服务> <提供婚宴服务,可能收费>. ?x <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京新世纪日航饭店在哪？",
        "output": "select ?x where { <北京新世纪日航饭店> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园内有免费上网服务吗？",
        "output": "select ?x where { <景山公园> <是否有wifi服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刚到南京出差，现在在独角兽星空艺术馆旗舰店，请问离我们2千米的景点中都有哪些价格低于50块钱？",
        "output": "select ?y where { <南京独角兽星空艺术馆旗舰店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 2). ?y <城市> <南京>. ?y <类型> <景点>. ?y <平均价格> ?price filter(?price < 50) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "艺圃可以携带自拍杆吗？",
        "output": "select ?x where { <艺圃> <是否有携带自拍杆> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "横店梦外滩影视主题公园能租婴儿车吗？",
        "output": "select ?x where { <横店梦外滩影视主题公园> <是否有婴儿车租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "梅里雪山国家公园什么时候最好玩？",
        "output": "select ?x where { <梅里雪山国家公园> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州星河湾酒店对年龄有啥限制么",
        "output": "select ?x where { <广州星河湾酒店> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些城市有香格里拉酒店",
        "output": "select distinct ?x where { ?y <酒店品牌名称> <香格里拉酒店>. ?y <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日坛宾馆的就餐时间？",
        "output": "select ?x where { <日坛宾馆> <就餐时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "景山公园玩几个小时合适？",
        "output": "select ?x where { <景山公园> <建议游玩时长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉马哥孛罗酒店附近5km的景点有哪些？",
        "output": "select ?y where { <武汉马哥孛罗酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <武汉>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "昆明佳华广场酒店在哪所城市？",
        "output": "select ?x where { <昆明佳华广场酒店> <城市> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园在北海公园的什么方位？",
        "output": "select ?x where {  <颐和园> <位于> ?cvt.  ?cvt <实体名称> <北海公园>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泉州酒店哪些房型是大床单间啊？",
        "output": "select ?y where { <泉州酒店> <房型名称> ?y. ?y <房型类别> \"大床间（单间）\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁海的开元名都的酒店都有啥？",
        "output": "select ?x where { ?x <城市> <宁海> . ?x <酒店品牌名称> <开元名都> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清水湾的戒浪不冲浪俱乐部内有酒店吗？",
        "output": "select ?x where { <戒浪不冲浪俱乐部（清水湾店）> <是否有酒店> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫到长富宫饭店直线距离有多远呀？",
        "output": "select ?t where { <故宫博物院（故宫）> <附近> ?cvt. ?cvt <实体名称> <长富宫饭店>. ?cvt <距离值> ?t.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京瑞吉酒店在东方君悦大酒店的什么方位？",
        "output": "select ?x where { <北京瑞吉酒店> <位于> ?cvt.  ?cvt <实体名称> <北京东方君悦大酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉距离不可思议星空解压馆附近5公里的酒店有哪些？",
        "output": "select ?y where { <不可思议星空解压馆> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5.0) ?y <城市> <武汉>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "紫金山探险公园内可以租到轮椅吗？",
        "output": "select ?x where { <紫金山探险公园> <是否有轮椅租赁> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安威斯汀大酒店有什么支付方式？",
        "output": "select ?x where { <西安威斯汀大酒店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "带多少钱可以住禅泉度假酒店？",
        "output": "select ?x where { <禅泉度假酒店> <平均价格> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洛迦山有吃饭的地方吗？",
        "output": "select ?x where { <洛迦山> <是否有餐厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京昆仑饭店里面有ATM吗？",
        "output": "select ?x where { <北京昆仑饭店> <是否有自动提款机> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宁波开元名都大酒店内有穿梭机场班车服务吗？",
        "output": "select ?x where { <宁波开元名都大酒店> <是否有穿梭机场班车服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京中航泊悦酒店的平均价格是多少？",
        "output": "select ?x where { <北京中航泊悦酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广州独角兽星空艺术馆是否免费？",
        "output": "select ?x where { <广州独角兽星空艺术馆> <城市> <广州> . <广州独角兽星空艺术馆> <是否免费> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "森泊幻想岛的详细地理位置在哪？",
        "output": "select ?x where { <森泊幻想岛> <地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在北京，离希尔顿酒店5公里内的景点包括哪些？",
        "output": "select ?y where { <北京希尔顿酒店> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <北京>. ?y <类型> <景点>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南省博物馆官方网址是什么？",
        "output": "select ?x where {  <湖南省博物馆> <景点官方网站> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江门逸豪酒店内有壁球室吗？",
        "output": "select ?x where { <江门逸豪酒店> <是否有壁球室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "思南县的九天温泉酒店多少钱一晚上？",
        "output": "select ?x where { <思南九天温泉酒店> <城市> <思南县> . <思南九天温泉酒店> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钟楼的萤火虫星空艺术馆的最佳游玩时间？",
        "output": "select ?x where { <萤火虫星空艺术馆（钟楼旗舰店）> <最佳游玩时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州的西湖要多少钱？",
        "output": "select ?y where {  <西湖风景名胜区（西湖）> <平均价格> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "地窝堡机场的乌鲁木齐天缘酒店的平均价格是多少？",
        "output": "select ?x where { <乌鲁木齐天缘酒店（地窝堡机场店）> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杭州包含几个价格低于20块钱5A级别的景点？",
        "output": "select (count(?x) as ?count_city) where { ?x <城市> <杭州>. ?x <景点的等级A> \"5A\". ?x <平均价格> ?price. filter(?price < 20). ?x <类型> <景点> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "城市在烟台隶属于喜来登的酒店？",
        "output": "select ?x where { ?x <城市> <烟台> . ?x <酒店品牌名称> <喜来登> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以简单介绍一下九寨沟风景区吗？",
        "output": "select ?x where { <九寨沟风景区> <景点简介-优惠信息> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园在国家大剧院的哪个方向啊？",
        "output": "select ?x where { <天坛公园> <位于> ?cvt.  ?cvt <实体名称> <国家大剧院>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "青岛幻光之城星空艺术馆（台东旗舰店）的彩虹跑迷宫的几点关门？",
        "output": "select ?x where { <青岛幻光之城星空艺术馆（台东旗舰店）> <娱乐项目名称> <彩虹跑迷宫>. <彩虹跑迷宫> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天坛公园附近有哪些可以提供收费接站服务的酒店呢？",
        "output": "select ?y  where { <天坛公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有接站服务> <有接站服务（收费）>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布达拉宫附近有禁烟楼层的酒店",
        "output": "select ?y where { <布达拉宫> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有无烟楼层> ?z. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京饭店有哪些房型",
        "output": "select ?x where { <北京饭店> <房型名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "雍和宫东碑亭的项目营业时间？",
        "output": "select ?x where { <雍和宫> <娱乐项目名称> <东碑亭>. <东碑亭> <项目营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布尔津县的喀纳斯景区联系电话是多少？",
        "output": "select ?x where { <喀纳斯景区> <城市> <布尔津县> . <喀纳斯景区> <电话> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园位于北京天伦王朝酒店的哪个方向？",
        "output": "select ?x where { <颐和园> <位于> ?cvt.  ?cvt <实体名称> <北京天伦王朝酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著名的苏州博物馆的详细地址是多少？",
        "output": "select ?x where { <苏州博物馆> <城市> <苏州> . <苏州博物馆> <地址> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神玉艺术馆在北京嘉里大酒店的什么方向？",
        "output": "select ?x where { <神玉艺术馆> <位于> ?cvt.  ?cvt <实体名称> <北京嘉里大酒店>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "澳门鹭环海天度假酒店的联系电话是多少？",
        "output": "select ?x where { <澳门鹭环海天度假酒店> <电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京博物院什么时候营业？",
        "output": "select ?x where { <南京博物院> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟风景区是什么价格？",
        "output": "select ?x where { <九寨沟风景区> <是否免费> \"全年收费\" . <九寨沟风景区> <官方门票数据> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "九寨沟县有哪些AAAAA景点？",
        "output": "select ?x where { ?x <城市> <九寨沟县> . ?x <景点的等级A> \"5A\" . ?x <类型> <景点>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大连新世界酒店哪些房型可以住2个人",
        "output": "select distinct ?x where { <大连新世界酒店> <房型名称> ?x. ?x <容纳人数> \"2.0\"^^<http://www.w3.org/2001/XMLSchema#float>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南京金丝利喜来登酒店要多少钱？",
        "output": "select ?x where { <南京金丝利喜来登酒店> <平均价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "国家大剧院的营业时间？",
        "output": "select ?x where { <国家大剧院> <营业时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京昆仑饭店里面约人喝咖啡方便嘛？",
        "output": "select ?x where { <北京昆仑饭店> <是否有咖啡厅> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "去杭州出差，准备去孤山公园消遣一下子，它附近5公里的还有哪些酒店？",
        "output": "select ?y where { <孤山公园> <附近> ?cvt. ?cvt <实体名称> ?y. ?cvt <距离值> ?distance. filter(?distance <= 5). ?y <城市> <杭州>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖南省博物馆是4A的景点哦，附近的交通信息怎么样啊？可以推荐一下相关路线吗？",
        "output": "select ?x where { <湖南省博物馆> <景点的等级A> \"4A\" . <湖南省博物馆> <交通信息> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "外滩什么时候营业？",
        "output": "select ?x where { <外滩> <营业时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "神玉艺术馆中神玉神州行公益展览有介绍吗？",
        "output": "select ?x where { <神玉艺术馆> <娱乐项目名称> <神玉神州行公益展览>. <神玉神州行公益展览> <项目描述> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "等级为5A的布达拉宫据说很好看，什么季节适合去游玩？",
        "output": "select ?x where { <布达拉宫> <景点的等级A> \"5A\" . <布达拉宫> <最佳游玩时间> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "常州环球恐龙城维景国际大酒店能接送机吗？",
        "output": "select ?x where { <常州环球恐龙城维景国际大酒店> <是否有接机服务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京都信苑饭店的早餐包括什么类型？",
        "output": "select ?x where { <京都信苑饭店> <早餐类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本溪富虹国际饭店支持哪些支付方式？",
        "output": "select ?x where { <本溪富虹国际饭店> <支付方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "瑞海姆田园度假村对入住人年龄有限制吗？",
        "output": "select ?x where { <瑞海姆田园度假村> <入住年龄限制> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "东莞豪门大饭店的早餐价格是多少？",
        "output": "select ?x where { <东莞豪门大饭店> <早餐价格> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我们现在在北京的首都宾馆，行走3公里的能到达的景点都有哪些？",
        "output": "select ?x where { <首都宾馆（原首都大酒店）> <附近> ?cvt. ?cvt <实体名称> ?x. ?cvt <距离值>  ?d. ?x <类型> <景点>. filter(?d<=3) }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大唐不夜城附近有哪些可以提供付费接站服务的酒店呢？",
        "output": "select ?y  where { <大唐不夜城> <附近> ?cvt. ?cvt <实体名称> ?y. ?y <是否有接站服务> <有接站服务（收费）>. ?y <类型> <酒店>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孤山公园是几A级景点？",
        "output": "select ?x where { <孤山公园> <景点的等级A> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在乌鲁木齐西北石油酒店的退房时间？",
        "output": "select ?time where { <乌鲁木齐西北石油酒店> <酒店退房时间> ?time. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "从北海公园到神玉艺术馆，应该往哪个方向走？",
        "output": "select ?x where { <神玉艺术馆> <位于> ?cvt.  ?cvt <实体名称> <北海公园>.  ?cvt <方向> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孔丘出生于哪里？",
        "output": "select ?y where { ?x <本名> \"孔丘\". ?x <出生地> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京杭大运河流经哪些港口？",
        "output": "select ?x where { <京杭大运河> <主要港口> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《牡丹亭》又叫做什么？",
        "output": "select ?x where { <牡丹亭_（明朝剧作家汤显祖代表作）> <作品别名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "猪八戒原名是是什么？",
        "output": "select ?x where { <猪八戒_（中国神话小说《西游记》的角色）> <原名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "南宋名将岳飞的谥号为？",
        "output": "select ?x where { <岳飞_（南宋抗金名将、民族英雄）> <谥号> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张仪的师父是谁？",
        "output": "select ?x where { <张仪_（战国时期纵横家、外交家和谋略家）> <师承> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉大学是由谁创立的？",
        "output": "select ?x where { <武汉大学> <创始人> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "村上春树的哪部作品出版于2007年7月？",
        "output": "select ?x where { ?x  <作者> <村上春树_（日本著名作家）>. ?x <出版时间> \"2007-07\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "村上春树是哪个民族的？",
        "output": "select ?x where { <村上春树_（日本著名作家）> <民族> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周杰伦毕业于哪里？",
        "output": "select ?x where { <周杰伦> <毕业院校> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯的法人英文名字是什么？",
        "output": "select ?x where { <腾讯> <法定代表人> ?y. ?y <外文名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "英文名字是\" Pony\"的玩家是哪个国家的人？",
        "output": "select ?x where { ?y <外文名> \"Pony\". ?y <国籍> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得NBA最有价值球员奖（2008）的球员有多高？",
        "output": "select ?x where { ?y <主要奖项> \"NBA最有价值球员奖（2008）\". ?y <身高> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科比的爸爸的工作是什么？",
        "output": "select ?x where { <科比·布莱恩特> <父亲> ?y. ?y <职业> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "权力的游戏第六季的编剧是谁？",
        "output": "select ?x where { <权力的游戏第六季> <编剧> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 丘吉尔什么时候去世的？",
        "output": "select ?x where { <丘吉尔> <逝世日期> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德国在哪个洲？",
        "output": "select ?x where {<德国_（德意志联邦共和国）> <所属洲> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "德国主要信仰什么宗教？",
        "output": "select ?x where { <德国_（德意志联邦共和国）> <主要宗教> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张敬轩签了哪个经纪公司？",
        "output": "select ?x where { <张敬轩> <经纪公司>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌手那英是什么星座？",
        "output": "select ?x where { <那英> <星座> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《红豆》是谁填词的？",
        "output": "select ?x where { <红豆_（王菲演唱歌曲）> <填词> ?x . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "诗人李白的祖籍的车牌代码是什么？",
        "output": "select ?x where { <李白_（唐朝著名诗人）> <祖籍>  ?y. ?y <车牌代码> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《春日行》是哪个朝代的诗人创作的？",
        "output": "select ?x where { <春日行> <作者>  ?y. ?y <所处时代> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "作《帝京篇》的古人的年号是什么？",
        "output": "select ?x where { <帝京篇_（李世民作唐诗）> <作者>  ?y. ?y <年号> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "9·11事件有多少人受伤？",
        "output": "select ?x where { <9·11事件> <受伤> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "本·拉登最知名的罪行发生在哪里？",
        "output": "select ?x where { <本·拉登> <主要罪行>  ?y. ?y <地点> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 2019新型冠状病毒是什么时候命名的？",
        "output": "select ?x where { <2019新型冠状病毒> <命名时间>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 2019新型冠状病毒的英文名字是什么？",
        "output": "select ?x where { <2019新型冠状病毒> <外文名>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 2019新型冠状病毒是由什么组织命名的？",
        "output": "select ?x where { <2019新型冠状病毒> <命名组织>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 世界卫生组织的总部在哪里？",
        "output": "select ?x where { <世界卫生组织> <总部>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 世界卫生组织的官网是什么？",
        "output": "select ?x where { <世界卫生组织> <官网>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 世界卫生组织有多少个成员国？",
        "output": "select ?x where { <世界卫生组织> <成员国>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 世界卫生组织是什么时候成立的？",
        "output": "select ?x where { <世界卫生组织> <成立时间>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 世界卫生组织的现任总领事是谁？",
        "output": "select ?x where { <世界卫生组织> <现任总领事>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 世界卫生组织有哪些组织机构？",
        "output": "select ?x where { <世界卫生组织> <组织机构>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 世界卫生组织的上级机构是什么？",
        "output": "select ?x where { <世界卫生组织> <上级机构>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 流感裂解疫苗有什么作用？",
        "output": "select ?x where { <流感裂解疫苗> <用途>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 2019冠状病毒病最初是在哪里爆发的？",
        "output": "select ?x where { <2019冠状病毒病（COVID-19）> <首次爆发疫区>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 2019冠状病毒病感染部位是哪里？",
        "output": "select ?x where { <2019冠状病毒病（COVID-19）> <感染>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 2019冠状病毒病感染属于哪个科目？",
        "output": "select ?x where { <2019冠状病毒病（COVID-19）> <所属科目>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 有发热症状需要去哪个科室看病？",
        "output": "select ?x where { <发热> <就诊科室>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 过敏性鼻炎有哪些症状？",
        "output": "select ?x where { <过敏性鼻炎> <常见症状>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 过敏性鼻炎可以怎么预防？",
        "output": "select ?x where { <过敏性鼻炎> <预防>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 过敏性鼻炎多发于哪些人群？",
        "output": "select ?x where { <过敏性鼻炎> <多发群体>  ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国医药集团有限公司一共有多少员工？",
        "output": "select ?x where { <中国医药集团有限公司> <员工数>?x . } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "儿童挑食的症状有哪些？",
        "output": "select ?x where { <儿童偏食> <涉及症状> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李兰娟院士毕业的学校在哪个城市？",
        "output": "select ?x where { <李兰娟> <毕业院校> ?y. ?y <所在城市> ?x. } "
    }
]