[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江大华技术股份有限公司的英文名称？",
        "output": "select ?x where { <浙江大华技术股份有限公司> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿里巴巴的法人代表是谁",
        "output": "select ?x where { <阿里巴巴> <法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿里巴巴的法人代表参股了多少家公司",
        "output": "select ?x where { <阿里巴巴> <法人> ?y. ?y <参股公司数> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券总部在哪个城市",
        "output": "select ?x where { <华泰证券> <总部地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券在杭州的营业部叫什么名字？",
        "output": "select ?x where { <华泰证券> <营业部> ?x. ?x <位置> <杭州> }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券前十大股东是谁",
        "output": "select ?x where { <华泰证券> <十大股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券在哪上市的",
        "output": "select ?x where { <华泰证券> <上市地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券在A股上市时间？",
        "output": "select ?x where { <华泰证券> <上市时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券的全资子公司有哪些？",
        "output": "select ?x where { <华泰证券> <全资子公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券控股了哪些公司？",
        "output": "select ?x where { <华泰证券> <控股公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券参股了哪些公司？",
        "output": "select ?x where { <华泰证券> <参股公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券董事长是谁？",
        "output": "select ?x where { <光大证券> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的十大股东都有谁？",
        "output": "select ?x where { <光大证券> <十大股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的股票代码是什么？",
        "output": "select ?x where { <光大证券> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的主营业务是什么？",
        "output": "select ?x where { <光大证券> <主营业务> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的董事会秘书？",
        "output": "select ?x where { <光大证券> <公司董秘> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的法人代表？",
        "output": "select ?x where { <光大证券> <法人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的中文全称是什么？",
        "output": "select ?x where { <光大证券> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的外文全称是什么？",
        "output": "select ?x where { <光大证券> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的办公地址在哪？",
        "output": "select ?x where { <光大证券> <总部地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的注册资本是多少？",
        "output": "select ?x where { <光大证券> <注册资本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的总经理是谁？",
        "output": "select ?x where { <光大证券> <总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券的员工人数？",
        "output": "select ?x where { <光大证券> <员工人数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券属于哪个行业？",
        "output": "select ?x where { <光大证券> <行业类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "申万行业有多少个行业类别",
        "output": "select ?x where { <申万行业> <类别数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "申万行业分类类别？",
        "output": "select ?x where { <申万行业> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "招商证券开户方式",
        "output": "select ?x where { <招商证券> <开户方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证券交易方式？",
        "output": "select ?x where { <证券> <交易方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "招商证券的客服电话？",
        "output": "select ?x where { <招商证券> <客服电话> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么是证券投资基金",
        "output": "select ?x where { <证券投资基金> <释义> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金涉及哪些当事人?",
        "output": "select ?x where { <基金> <关联方> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金可分为哪几类？",
        "output": "select ?x where { <基金> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "LOF的全称是什么？",
        "output": "select ?x where { <LOF> <基金名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "基金交易实行三大原则?",
        "output": "select ?x where { <基金> <交易三原则> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "专户业务的投资范围是什么？",
        "output": "select ?x where { <专户> <投资范围> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "养老金的覆盖范围有哪些？",
        "output": "select ?x where { <养老金> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天弘基金的股东？",
        "output": "select ?x where { <天弘基金> <股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险可以分成什么类型？",
        "output": "select ?x where { <保险> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "人身保险可划分为哪几类？",
        "output": "select ?x where { <人身保险> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "一般的企业财产保险可分为哪几类？",
        "output": "select ?x where { <企业财产保险> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以将信用保险分为哪几类？",
        "output": "select ?x where { <信用保险> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "责任保险种类？",
        "output": "select ?x where { <责任保险> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险中介组成？",
        "output": "select ?x where { <保险中介> <构成成分> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保险资格考试包括哪几类？",
        "output": "select ?x where { <保险法> <构成成分> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "再保险可以分成什么类别？",
        "output": "select ?x where { <再保险> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券曾用名？",
        "output": "select ?x where { <海通证券> <曾用名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券所属行业",
        "output": "select ?x where { <海通证券> <所属行业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券的董事长是谁？",
        "output": "select ?x where { <海通证券> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券的注册资本是多少？",
        "output": "select ?x where { <海通证券> <注册资本> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券的总经理是谁？",
        "output": "select ?x where { <海通证券> <总经理> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券的董秘是谁？",
        "output": "select ?x where { <海通证券> <公司董秘> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金期货的交易代码",
        "output": "select ?x where { <黄金期货> <交易代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金期货的交割方式",
        "output": "select ?x where { <黄金期货> <交割方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金期货在哪里交易",
        "output": "select ?x where { <黄金期货> <交易地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金期货的交易单位",
        "output": "select ?x where { <黄金期货> <交易单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黄金期货的报价单位",
        "output": "select ?x where { <黄金期货> <报价单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国有几个股票交易所",
        "output": "select ?x where { <美国> <证券交易所数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国有哪几个股票交易所",
        "output": "select ?x where { <美国> <证券交易所> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国证券交易所纽约证券交易所的简称是什么",
        "output": "select ?x where { <纽约证券交易所> <简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国证券交易所全美证券交易所的简称是什么",
        "output": "select ?x where { <全美证券交易所> <简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国证券交易所纳斯达克证券交易所的简称是什么",
        "output": "select ?x where { <纳斯达克证券交易所> <简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿里巴巴股票代码",
        "output": "select ?x where { <阿里巴巴> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支付宝的母公司是谁？",
        "output": "select ?x where { <支付宝> <母公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金融期货有哪些？",
        "output": "select ?x where { <金融期货> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "环球主要的期货交易所？",
        "output": "select ?x where { <环球交易所> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚太指数有哪些？",
        "output": "select ?x where { <亚太指数> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美洲指数有哪些？",
        "output": "select ?x where { <美洲指数> <类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上证指数的代码是多少",
        "output": "select ?x where { <上证指数> <代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司股票代码是多少？",
        "output": "select ?x where { <小米科技有限责任公司> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米公司什么时候上市的？",
        "output": "select ?x where { <小米公司> <上市时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米公司在哪里上市的？",
        "output": "select ?x where { <小米公司> <上市地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司营业期限是多少？",
        "output": "select ?x where { <小米科技有限责任公司> <营业期限> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司注册地址是多少？",
        "output": "select ?x where { <小米科技有限责任公司> <注册地址> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司公司的公司类型？",
        "output": "select ?x where { <小米科技有限责任公司> <公司类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司所属行业？",
        "output": "select ?x where { <小米科技有限责任公司> <所属行业> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司登记机关？",
        "output": "select ?x where { <小米科技有限责任公司> <登记机关> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司英文名称？",
        "output": "select ?x where { <小米科技有限责任公司> <外文名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司A轮融资是什么时候",
        "output": "select ?x where { <小米科技有限责任公司> <A轮融资时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司IPO上市前经历了几轮融资",
        "output": "select ?x where { <小米科技有限责任公司> <融资次数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技有限责任公司有哪些产品",
        "output": "select ?x where { <小米科技有限责任公司> <产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "奥美医疗的股票代码是多少？",
        "output": "select ?x where { <奥美医疗> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西安银行的股票代码是多少？",
        "output": "select ?x where { <西安银行> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华阳国际的股票代码是多少？",
        "output": "select ?x where { <华阳国际> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "威派格的股票代码是多少？",
        "output": "select ?x where { <威派格> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "七彩化学的股票代码是多少？",
        "output": "select ?x where { <七彩化学> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "立华股份的股票代码是多少？",
        "output": "select ?x where { <立华股份> <股票代码> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福莱特的全称是什么？",
        "output": "select ?x where { <福莱特> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒铭达的全称是什么？",
        "output": "select ?x where { <恒铭达> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "威尔药业的全称是什么？",
        "output": "select ?x where { <威尔药业> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华致酒行的全称是什么？",
        "output": "select ?x where { <华致酒行> <公司名称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动力煤的交易单位是多少？",
        "output": "select ?x where { <动力煤> <交易单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动力煤的报价单位？",
        "output": "select ?x where { <动力煤> <报价单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动力煤的最小变动价位？",
        "output": "select ?x where { <动力煤> <最小变动单位> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银监会全称？",
        "output": "select ?x where { <银监会> <全称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保监会全称？",
        "output": "select ?x where { <保监会> <全称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "证监会领导都有谁？",
        "output": "select ?x where { <证监会> <领导> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "银监会主席是谁",
        "output": "select ?x where { <银监会> <领导> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万达董事长是谁",
        "output": "select ?x where { <万达> <董事长> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万达集团创建于哪一年？",
        "output": "select ?x where { <万达集团> <创建时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百度上市时间",
        "output": "select ?x where { <百度> <上市时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百度在哪里上市的？",
        "output": "select ?x where { <百度> <上市地点> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "欢聚时代旗下有哪些产品？",
        "output": "select ?x where { <欢聚时代> <产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "余额宝的基金管理人是谁？",
        "output": "select ?x where { <余额宝> <基金管理人> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "天弘基金有哪些基金产品？",
        "output": "select ?x where { <天弘基金> <基金产品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "余额宝的起购金额最小是多少？",
        "output": "select ?x where { <余额宝> <起购金额> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "余额宝现在一共接入了几支基金",
        "output": "select ?x where { <余额宝> <接入基金数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西藏自治区有多少家上市公司",
        "output": "select ?x where { <西藏自治区> <上市公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海的上市公司有多少",
        "output": "select ?x where { <上海> <上市公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "江苏省的上市公司一共有多少家？",
        "output": "select ?x where { <江苏省> <上市公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "属于上海自贸概念股的上市公司有多少？",
        "output": "select ?x where { <上海自贸概念股> <上市公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些上市公司是属于上海自贸概念股的？",
        "output": "select ?x where {  ?x <概念股类别> <上海自贸概念股>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "属于氢燃料概念股的上市公司有哪些？",
        "output": "select ?x where {  ?x <概念股类别> <氢燃料概念股>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华昌化工是属于什么概念股的？",
        "output": "select ?x where { <华昌化工> <概念股类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福建金森是属于什么行业的？",
        "output": "select ?x where { <福建金森> <行业类别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "信托的构成要素包括什么？",
        "output": "select ?x where { <信托> <构成要素> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方科技集团股份有限公司的曾用名？",
        "output": "select ?x where { <京东方科技集团股份有限公司> <曾用名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方科技集团股份有限公司的董秘是谁？",
        "output": "select ?x where { <京东方科技集团股份有限公司> <公司董秘> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方科技集团股份有限公司的股票简称是什么",
        "output": "select ?x where { <京东方科技集团股份有限公司> <股票简称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方A的上市日期？",
        "output": "select ?x where { <京东方A> <上市日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方A的主承销商？",
        "output": "select ?x where { <京东方A> <主承销商> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方A的最大股东是谁？",
        "output": "select ?x where { <京东方A> <最大股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "京东方A的十大股东？",
        "output": "select ?x where { <京东方A> <十大股东> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子董事长的薪酬是多少",
        "output": "select ?x where { <恒生电子> <董事长> ?y. ?y <年薪> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子董事长的性别是什么",
        "output": "select ?x where { <恒生电子> <董事长> ?y. ?y <性别> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的董事长的持股数量是多少",
        "output": "select ?x where { <恒生电子> <董事长> ?y. ?y <持股数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子的董事长的持股总数占比是多少",
        "output": "select ?x where { <恒生电子> <董事长> ?y. ?y <持股占比> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子股份有限公司的董事长多大年纪了",
        "output": "select ?x where { <恒生电子> <董事长> ?y. ?y <年龄> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子股份有限公司的董事长是什么学历",
        "output": "select ?x where { <恒生电子> <董事长> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子股份有限公司的董事长毕业于哪所大学",
        "output": "select ?x where { <恒生电子> <董事长> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的董事长是哪一年生的",
        "output": "select ?x where { <大华股份> <董事长> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "大华股份的董事长毕业于哪所高校",
        "output": "select ?x where { <大华股份> <董事长> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蚂蚁金服现任总裁是什么时候上任的？",
        "output": "select ?x where { <蚂蚁金服> <总裁> ?y. ?y <任职日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "蚂蚁金服最近一融资额是多少？",
        "output": "select ?x where { <蚂蚁金服> <融资> ?y. ?y <融资金额> ?x. ?y <融资时间> <最近一次>  }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于魔都的期货交易所叫什么",
        "output": "select ?x where { <上海> <别称> ?y. ?y <期货交易所> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于河南省会的期货交易所叫什么",
        "output": "select ?x where { <河南> <省会> ?y. ?y <期货交易所> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑商所上市的农产品期货有什么",
        "output": "select ?x where { <郑商所> <交易品种> ?x. ?x <类别> <农产品期货>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "郑商所上市的非农产品期货有什么",
        "output": "select ?x where { <郑商所> <交易品种> ?x. ?x <类别> <非农产品期货>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和记黄埔的董事长有什么企业",
        "output": "select ?x where { <和记黄埔> <董事长> ?y. ?y <参股公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国银行什么时候在香港证券交易所上市",
        "output": "select ?x where { <中国银行> <上市> ?y. ?y <上市地点> <香港证券交易所>. ?y <上市时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子股份有限公司董事长名下有多少家公司",
        "output": "select ?x where { <恒生电子股份有限公司> <董事长> ?y. ?y <参股公司数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恒生电子股份有限公司总裁名下有多少家公司",
        "output": "select ?x where { <恒生电子股份有限公司> <总裁> ?y. ?y <参股公司数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券什时候在H股上市的？",
        "output": "select ?x where { <华泰证券> <上市> ?y. ?y <上市地点> <H股>. ?y <上市时间> ?x }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券的董事长年龄多大了？",
        "output": "select ?x where { <华泰证券> <董事长> ?y. ?y <年龄> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "华泰证券的董事长是什么学历？",
        "output": "select ?x where { <华泰证券> <董事长> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券董事长多大年纪了？",
        "output": "select ?x where { <光大证券> <董事长> ?y. ?y <年纪> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券董事长是什么学历？",
        "output": "select ?x where { <光大证券> <董事长> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "光大证券董事长年薪是多少？",
        "output": "select ?x where { <光大证券> <董事长> ?y. ?y <年薪> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券的董事长是什么学历？",
        "output": "select ?x where { <海通证券> <董事长> ?y. ?y <学历> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券的董事长年薪是多少？",
        "output": "select ?x where { <海通证券> <董事长> ?y. ?y <年薪> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "海通证券的董事长多大年龄？",
        "output": "select ?x where { <海通证券> <董事长> ?y. ?y <年纪> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与海通证券董事长关联的公司有几家？",
        "output": "select ?x where { <海通证券> <董事长> ?y. ?y <关联公司数量> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小米科技董事长名下有哪些上市公司",
        "output": "select ?x where { <小米科技> <董事长> ?y. ?y <参股公司> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体核酸检测属于什么类型？",
        "output": "select ?x where { <肺炎衣原体核酸检测> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体核酸检测涉及到哪些症状？",
        "output": "select ?x where { <肺炎衣原体核酸检测> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿液肺炎链球菌抗原检测试验属于哪种类型？",
        "output": "select ?x where { <尿液肺炎链球菌抗原检测试验> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿液肺炎链球菌抗原检测试验与什么样的症状有关？",
        "output": "select ?x where { <尿液肺炎链球菌抗原检测试验> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体检测属于哪种类型的检查？",
        "output": "select ?x where { <肺炎支原体检测> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体检测的涉及症状是什么？",
        "output": "select ?x where { <肺炎支原体检测> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体检测属于哪种类型的检查？",
        "output": "select ?x where { <肺炎衣原体检测> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体检测的涉及症状是什么？",
        "output": "select ?x where { <肺炎衣原体检测> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体补体结合试验属于哪种类型？",
        "output": "select ?x where { <肺炎支原体补体结合试验> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎克雷伯杆菌抗体测定属于哪种类型？",
        "output": "select ?x where { <肺炎克雷伯杆菌抗体测定> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎克雷伯杆菌抗体测定的涉及症状有什么？",
        "output": "select ?x where { <肺炎克雷伯杆菌抗体测定> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体抗体测定属于什么类型的检测？",
        "output": "select ?x where { <肺炎支原体抗体测定> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体抗体测定所涉及什么症状？",
        "output": "select ?x where { <肺炎支原体抗体测定> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎球菌抗体检测属于哪种类型的检测？",
        "output": "select ?x where { <肺炎球菌抗体检测> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎球菌抗体检测涉及怎样的症状？",
        "output": "select ?x where { <肺炎球菌抗体检测> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎球菌抗原检测属于哪种类型的检测？",
        "output": "select ?x where { <肺炎球菌抗原检测> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎球菌抗原检测涉及怎样的症状？",
        "output": "select ?x where { <肺炎球菌抗原检测> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体抗体测定属于哪种类型的测定？",
        "output": "select ?x where { <肺炎衣原体抗体测定> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎衣原体抗体测定涉及怎样的症状？",
        "output": "select ?x where { <肺炎衣原体抗体测定> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "抗沙眼衣原体、肺炎衣原体和鹦鹉热衣原体IgG和IgM抗体测定属于哪种类型的测定？",
        "output": "select ?x where { <抗沙眼衣原体、肺炎衣原体和鹦鹉热衣原体IgG和IgM抗体测定> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "抗沙眼衣原体、肺炎衣原体和鹦鹉热衣原体IgG和IgM抗体测定涉及怎样的症状？",
        "output": "select ?x where { <抗沙眼衣原体、肺炎衣原体和鹦鹉热衣原体IgG和IgM抗体测定> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺炎支原体寒冷凝集试验属于哪种类型的检查？",
        "output": "select ?x where { <肺炎支原体寒冷凝集试验> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规属于什么类型的检查？",
        "output": "select ?x where { <血常规> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规涉及的症状有哪些？",
        "output": "select ?x where { <血常规> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规的检查与哪些疾病有关？",
        "output": "select ?x where { <血常规> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规属于什么科室？",
        "output": "select ?x where { <血常规> <所属科目> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血常规的检查方式是什么？",
        "output": "select ?x where { <血常规> <检查方式> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淋巴细胞计数属于什么类型的检查？",
        "output": "select ?x where { <淋巴细胞计数> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淋巴细胞计数涉及到哪些症状？",
        "output": "select ?x where { <淋巴细胞计数> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "淋巴细胞计数与哪些疾病有关？",
        "output": "select ?x where { <淋巴细胞计数> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "D-二聚体属于什么类型的检查？",
        "output": "select ?x where { <D-二聚体> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌红蛋白属于什么类型的测定？",
        "output": "select ?x where { <肌红蛋白> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌红蛋白涉及到哪些症状？",
        "output": "select ?x where { <肌红蛋白> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌红蛋白与什么疾病有关？",
        "output": "select ?x where { <肌红蛋白> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌钙蛋白属于什么类型的测定？",
        "output": "select ?x where { <肌钙蛋白> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肌钙蛋白与什么疾病有关？",
        "output": "select ?x where { <肌钙蛋白> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳、鼻、咽拭子细菌培养属于什么类型的测定？",
        "output": "select ?x where { <耳、鼻、咽拭子细菌培养> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳、鼻、咽拭子细菌培养涉及到哪些症状？",
        "output": "select ?x where { <耳、鼻、咽拭子细菌培养> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "耳、鼻、咽拭子细菌培养与哪些疾病有关？",
        "output": "select ?x where { <耳、鼻、咽拭子细菌培养> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血氧分压属于什么类型的测定？",
        "output": "select ?x where { <动脉血氧分压> <类型> ?x. }"
    }
]