[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"HLA\"这一物质是哪一年发现的呢？",
        "output": "SELECT ?年 WHERE { ?物质\t<缩写>\t\"HLA\". ?物质\t<发现时间>\t?年. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪种一级异养（寄生）病毒又被称为\"RNA型病毒\"？",
        "output": "SELECT ?病毒 WHERE { ?病毒\t<别称>\t\"RNA型病毒\". ?病毒\t<等级>\t\"一级\". ?病毒\t<营养类型>\t\"异养（寄生）\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "烟草花叶病毒是哪类病毒？",
        "output": "SELECT ?类 WHERE { <烟草花叶病毒>\t<类型>\t?类. ?类\t<类型>\t<病毒>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些地方有微生物发酵的用武之地？",
        "output": "SELECT ?地方 WHERE { <微生物发酵>\t<应用>\t?地方. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些依据可以判断急性乙肝？",
        "output": "SELECT ?依据 WHERE { <急性乙肝>\t<诊断依据>\t?依据. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "引发急性膀胱炎的细菌分布在哪？",
        "output": "SELECT ?哪 WHERE { <急性膀胱炎>\t<常见病因>\t?细菌. ?细菌\t<类型>\t<细菌>. ?细菌\t<分布区域>\t?哪. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪个疾病既会导致咽部溃疡又会导致声音嘶哑？",
        "output": "SELECT ?疾病 WHERE { ?疾病\t<涉及症状>\t<咽部溃疡>. ?疾病\t<涉及症状>\t<声音嘶哑>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新冠病毒肺炎有哪些别称？",
        "output": "SELECT ?别称 WHERE { <新型冠状病毒肺炎>\t<同义词>\t?别称. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在各种新冠病毒肺炎治疗方法中，中医疗法是怎样的呢？",
        "output": "SELECT ?疗法 WHERE { <新型冠状病毒肺炎>\t<中医治疗>\t?疗法. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "可以告诉我引发新型冠状病毒肺炎的病原的遗传物质么？",
        "output": "SELECT ?遗传物质 WHERE { <新型冠状病毒肺炎>\t<病原体>\t?病原. ?病原\t<遗传物质>\t?遗传物质 } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "COVID-19与流行性感冒的症状有哪些是一样的呢？",
        "output": "SELECT ?症状 WHERE { <流行性感冒>\t<涉及症状>\t?症状. <2019冠状病毒病（COVID-19）>\t<症状>\t?症状. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国人主要信仰哪些宗教?",
        "output": "SELECT ?x WHERE { <美国_（美利坚合众国）> <主要宗教>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新凯旋门在哪？",
        "output": "SELECT ?x WHERE { <新凯旋门> <地区>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "保罗·高更出生在哪里?",
        "output": "SELECT ?x WHERE { <保罗·高更> <出生地>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "意大利的国土面积是多少？",
        "output": "SELECT ?x WHERE { <意大利_（意大利共和国）> <国土面积>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伏见稻荷大社在哪里？",
        "output": "SELECT ?x WHERE { <伏见稻荷大社> <地理位置> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西湖有哪些著名景点？",
        "output": "SELECT ?x WHERE { <西湖_（浙江省杭州市西湖）> <著名景点> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重庆人都会说哪些方言？",
        "output": "SELECT ?x WHERE { <重庆_（中华人民共和国直辖市）> <方言>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黑龙江的面积有多大？",
        "output": "SELECT ?x WHERE { <黑龙江_（最北和最东的省级行政区）> <面积>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁是中国国际跳棋公开赛百格冠军？",
        "output": "SELECT ?x WHERE { ?x<主要奖项> \"中国国际跳棋公开赛百格冠军\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "深圳的市鸟按生物学分类属于哪个目？",
        "output": "SELECT ?y WHERE { <深圳> <市鸟> ?x. ?x<目>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "历史上“南平百越，北通西南”的皇帝，是什么时间出生的？",
        "output": "SELECT ?y WHERE { ?x<主要成就> \"打通西南\". ?x<主要成就> \"南平百越\". ?x<出生日期>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些演员出生于上海，且毕业于上海戏剧学院？",
        "output": "SELECT ?x WHERE { ?x <职业> <演员_（薛之谦歌曲）>. ?x <毕业院校> <上海戏剧学院>. ?x<出生地> <上海_（中华人民共和国直辖市）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国首都的气候条件怎么样？",
        "output": "SELECT ?y WHERE { <美国_（美利坚合众国）> <首都>?x. ?x<气候条件>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《永别了，武器》的作者，还有哪些代表作品？",
        "output": "SELECT ?y WHERE { ?x <代表作品> <永别了，武器_（美国海明威著长篇小说）>. ?x <代表作品> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "彼得雷拉的祖国的最大城市是？",
        "output": "SELECT ?y WHERE { <彼得雷拉> <国籍> ?x. ?x<最大城市>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和清华大学在同一个区的还有哪些公立大学？",
        "output": "SELECT ?x WHERE { ?x<类别> <公立大学>. <清华大学><所属地区> ?y. ?x<所属地区>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国首都的别名有哪些？",
        "output": "SELECT ?x WHERE { <中华人民共和国><首都>?y. ?y<别名>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成立于1994年，口号为\"服务至上 顾客至上\"的公司是？",
        "output": "SELECT ?x WHERE { ?x <成立时间> \"1994\". ?x <公司口号> \"服务至上 顾客至上\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "邮政区码为200000的城市有哪些高等学府？",
        "output": "SELECT ?y WHERE { ?x <邮政区码> \"200000\". ?x<高等学府>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别名为“平安京”的城市，人口有多少？",
        "output": "SELECT ?y WHERE { ?x <人口> ?y. ?x <别名> \"平安京\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本首都的都花是什么？",
        "output": "SELECT ?y WHERE { <日本_（日本国）> <首都>?x. ?x<都花>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "韩国首都有哪些别称？",
        "output": "SELECT ?y WHERE { <韩国_（大韩民国）> <首都>?x. ?x<别名>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "法国首都的市长是谁？",
        "output": "SELECT ?y WHERE { <法国_（法兰西共和国）> <首都>?x. ?x<市长>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有“飞人、篮球之神”之称的篮球运动员毕业于哪所大学?",
        "output": "SELECT ?y WHERE { ?x<别名> \"飞人、篮球之神\". ?x<运动项目> <篮球_（球类运动）>. ?y <知名校友>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在《美女与野兽》和《哈利波特与混血王子》中担任主演的英国女演员是？",
        "output": "SELECT ?x WHERE { ?x<国籍> <英国_（大不列颠及北爱尔兰联合王国）>. <美女与野兽_（2017年艾玛·沃特森主演美国电影）> <主演> ?x. <哈利·波特与混血王子_（英美2009年大卫·叶茨执导电影）> <主演> ?x. ?x <职业> <演员_（职业）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒有什么特点？",
        "output": "SELECT ?x WHERE { <冠状病毒> <特点>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒有哪些子类型？",
        "output": "SELECT ?x WHERE { <病毒> <子类型>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李文亮医生的主要事迹是什么？",
        "output": "SELECT ?x WHERE { <李文亮> <事迹>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新冠病毒战役的爆发地点是哪里？",
        "output": "SELECT ?x WHERE { <新型冠状病毒战役> <爆发地点>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌隶属于什么界？",
        "output": "SELECT ?x WHERE { <细菌> <界：>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "乳酸杆菌是什么属的？",
        "output": "SELECT ?x WHERE { <乳酸杆菌> <属>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钟南山院士是哪里人？",
        "output": "SELECT ?x WHERE { <钟南山> <籍贯>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "SARS病毒的形状是怎么样的？",
        "output": "SELECT ?x WHERE { <SARS病毒> <形状>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "常见症状是\"乏力疲劳，食欲不振、恶心、厌油、右上腹痛等\"是什么病毒？",
        "output": "SELECT ?x WHERE { ?x<常见症状> \"乏力疲劳，食欲不振、恶心、厌油、右上腹痛等\". ?x<类型> <病毒>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于1947年9月13日的抗疫英雄是哪里人？",
        "output": "SELECT ?y WHERE { ?x<出生日期> <1947-09-13>. ?x<籍贯> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被称为“非典”的病毒是什么种类的？",
        "output": "SELECT ?y WHERE { ?x<别称> \"非典\". ?x<种类> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些英雄既参与了非典战役，又参与了新冠病毒战役？",
        "output": "SELECT ?x WHERE { ?x <参与战役> <非典战役>. ?x <参与战役> <新型冠状病毒战役>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和钟南山院士属于同一个救援队的还有哪些医生？",
        "output": "SELECT ?y WHERE { <钟南山> <所属救援队> ?x. ?y<所属救援队>?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "“World Health Organization”的现任总领事是谁？",
        "output": "SELECT ?y WHERE { ?x<外文名> \"World Health Organization\". ?x<现任总领事>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "“World Health Organization”的总部在哪里？",
        "output": "SELECT ?y WHERE { ?x<外文名> \"World Health Organization\". ?x<总部>?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉亚心总医院因感染新型冠状病毒而死的医生是谁?",
        "output": "SELECT ?X WHERE { ?X <履历> <武汉亚心总医院医生>. ?X <死亡原因> <感染新型冠状病毒>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉亚心总医院因感染新冠病毒而死的医生的民族是什么？",
        "output": "SELECT ?X WHERE { ?Y <履历> <武汉亚心总医院医生>. ?Y <死亡原因> <感染新型冠状病毒>. ?Y <民族> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉亚心总医院因感染新冠病毒而死的医生的死亡时间是什么？",
        "output": "SELECT ?X WHERE { ?Y <履历> <武汉亚心总医院医生>. ?Y <死亡原因> <感染新型冠状病毒>. ?Y <死亡时间> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉亚心总医院因感染新冠病毒而死的医生的职责是什么？",
        "output": "SELECT ?X WHERE { ?Y <履历> <武汉亚心总医院医生>. ?Y <死亡原因> <感染新型冠状病毒>. ?Y <职责> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "武汉亚心总医院因感染新冠病毒而死的医生的性别是什么？",
        "output": "SELECT ?X WHERE { ?Y <履历> <武汉亚心总医院医生>. ?Y <死亡原因> <感染新型冠状病毒>. ?Y <性别> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广东省清远市英德市因过劳而死的广东桥头派出所辅警是谁？",
        "output": "SELECT ?X WHERE { ?X <籍贯> <广东省清远市英德市>. ?X <死亡原因> <过劳>. ?X <履历> <广东桥头派出所辅警>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广东省清远市英德市因过劳而死的广东桥头派出所辅警的死亡时间是？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <广东省清远市英德市>. ?Y <死亡原因> <过劳>. ?Y <履历> <广东桥头派出所辅警>. ?Y <死亡时间> ?X } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广东省清远市英德市因过劳而死的广东桥头派出所辅警的民族是？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <广东省清远市英德市>. ?Y <死亡原因> <过劳>. ?Y <履历> <广东桥头派出所辅警>. ?Y <民族> ?X } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广东省清远市英德市因过劳而死的广东桥头派出所辅警的性别是？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <广东省清远市英德市>. ?Y <死亡原因> <过劳>. ?Y <履历> <广东桥头派出所辅警>. ?Y <性别> ?X } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广东省清远市英德市因过劳而死的广东桥头派出所辅警的职责是？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <广东省清远市英德市>. ?Y <死亡原因> <过劳>. ?Y <履历> <广东桥头派出所辅警>. ?Y <职责> ?X } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安徽省淮南市安徽淮南大通区城管局大通街道中队副中队长是谁？",
        "output": "SELECT ?X WHERE { ?X <籍贯> <安徽省淮南市>. ?X <履历> <安徽淮南大通区城管局大通街道中队副中队长>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安徽省淮南市安徽淮南大通区城管局大通街道中队副中队长的民族是什么？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <安徽省淮南市>. ?Y <履历> <安徽淮南大通区城管局大通街道中队副中队长>. ?Y <民族> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安徽省淮南市安徽淮南大通区城管局大通街道中队副中队长的死亡原因是什么？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <安徽省淮南市>. ?Y <履历> <安徽淮南大通区城管局大通街道中队副中队长>. ?Y <死亡原因> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安徽省淮南市安徽淮南大通区城管局大通街道中队副中队长的死亡时间是什么？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <安徽省淮南市>. ?Y <履历> <安徽淮南大通区城管局大通街道中队副中队长>. ?Y <民族> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安徽省淮南市安徽淮南大通区城管局大通街道中队副中队长的职责是什么？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <安徽省淮南市>. ?Y <履历> <安徽淮南大通区城管局大通街道中队副中队长>. ?Y <职责> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福建省南平市福建省南平市浦城县仙阳镇中心卫生院副院长是谁？",
        "output": "SELECT ?X WHERE { ?X <籍贯> <福建省南平市>. ?X <履历> <福建省南平市浦城县仙阳镇中心卫生院副院长>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福建省南平市福建省南平市浦城县仙阳镇中心卫生院副院长的性别是？",
        "output": "SELECT ?X WHERE { ?Y <籍贯> <福建省南平市>. ?Y <履历> <福建省南平市浦城县仙阳镇中心卫生院副院长>. ?Y <性别> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国地质大学_（中国地质大学武汉校部）魏文博的出生地是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <中国地质大学_（中国地质大学武汉校部）>. ?Y <中文名> \"魏文博\". ?Y <出生地> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国地质大学_（中国地质大学武汉校部）魏文博的信仰是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <中国地质大学_（中国地质大学武汉校部）>. ?Y <中文名> \"魏文博\". ?Y <信仰> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国地质大学_（中国地质大学武汉校部）魏文博的民族是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <中国地质大学_（中国地质大学武汉校部）>. ?Y <中文名> \"魏文博\". ?Y <民族> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国地质大学_（中国地质大学武汉校部）魏文博的职业是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <中国地质大学_（中国地质大学武汉校部）>. ?Y <中文名> \"魏文博\". ?Y <职业> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国地质大学_（中国地质大学武汉校部）魏文博的国籍是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <中国地质大学_（中国地质大学武汉校部）>. ?Y <中文名> \"魏文博\". ?Y <国籍> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的出生地是哪里？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <出生地> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的民族是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <民族> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的血型是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <血型> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的出生日期是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <出生日期> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的代表作品是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <代表作品> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的国籍是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <国籍> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的毕业院校是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <毕业院校> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的体重是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <体重> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的身高是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <身高> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "演员章婷婷的星座是什么？",
        "output": "SELECT ?X WHERE { ?Y <中文名> \"章婷婷\". ?Y <职业> <演员_（职业）>. ?Y <星座> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的职业是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <职业> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的别名是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <别名> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的三围是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <三围> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的民族是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <民族> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的出生地是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <出生地> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的体重是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <体重> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的出生日期是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <出生日期> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毕业于北京吉利大学文化艺术学院的李壹妃的身高是什么？",
        "output": "SELECT ?X WHERE { ?Y <毕业院校> <北京吉利大学文化艺术学院>. ?Y <中文名> \"李壹妃\". ?Y <身高> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "画家丁孟芳的国籍是什么？",
        "output": "SELECT ?X WHERE { ?Y <职业> <画家>. ?Y <中文名> \"丁孟芳\". ?Y <国籍> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "画家丁孟芳的主要成就是什么？",
        "output": "SELECT ?X WHERE { ?Y <职业> <画家>. ?Y <中文名> \"丁孟芳\". ?Y <主要成就> ?X. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《残酷天使的行动纲领》是哪部作品的OP(片头曲)？",
        "output": "select ?name where{ ?song <中文名称> \"残酷天使的行动纲领\". ?work <片头曲> ?song. ?work <中文名> ?name. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 人称\"大明神\"的经典角色是谁？她又在那些作品登场过？",
        "output": "select ?x ?y where{ <大明神> <中文名> ?x. <大明神> <登场作品> ?yy. ?yy <中文名> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周星驰和王晶合作的电影有哪些？",
        "output": "select DISTINCT  ?name where{ ?w <中文名> \"王晶\". ?z <中文名> \"周星驰\". ?movie  ?x  ?w. ?movie ?y ?z. ?movie <中文名> ?name } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 游戏《命运石之门0》相比前作《命运石之门》增加了哪些角色？",
        "output": "select ?x where { ?game0 <中文名> \"命运石之门0\". ?people <登场作品> ?game0. ?people <中文名> ?x MINUS { ?game <中文名> \"命运石之门\". ?people <登场作品> ?game. ?people <登场作品> ?game0. } } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 游戏《魔法使之夜》中，真实身份为魔女的主角名字是？",
        "output": "select ?x where{ ?maho <中文名> \"魔女\". ?people ?y ?maho. ?game <中文名> \"魔法使之夜\". ?game <主要角色> ?people. ?people <中文名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " \"京都动画\"制作了哪些\"凉宫春日\"动画？",
        "output": "select ?x where{ ?kyoto <公司名称> \"京都动画\". ?works <动画制作> ?kyoto. ?works <中文名> ?x. FILTER REGEX(?x, \"凉宫春日\") } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 由林忆莲和李宗盛共同演唱的歌曲有哪些？",
        "output": "select DISTINCT ?name where{ ?f <中文名> \"林忆莲\". ?m <中文名> \"李宗盛\". ?song  <歌曲原唱>  ?f. ?song <歌曲原唱>  ?m. ?song <中文名称> ?name } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": " 美国著名演员汤姆·汉克斯有哪些主演作品？",
        "output": "select DISTINCT ?name where{ ?actor <中文名> \"汤姆·汉克斯\". ?movie <主演> ?actor. ?movie <中文名> ?name } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "罗大佑和蒋志光合作的经典歌曲的名字是？",
        "output": "select DISTINCT  ?name where{ ?luo <中文名> \"罗大佑\". ?jiang <中文名>  \"蒋志光\". ?song ?x ?luo. ?song ?y ?jiang. ?song <中文名称> ?name } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周星驰和刘德华合作的作品有哪些？",
        "output": "select ?name where{ ?l <中文名> \"刘德华\". ?z <中文名> \"周星驰\". ?movie  ?x  ?l. ?movie ?y ?z. ?movie <中文名> ?name } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《仙剑奇侠传》系列中，经典技能\"飞龙探云手\"的使用者有哪些？",
        "output": "select ?x where{ ?f <中文名> \"飞龙探云手\". ?f <主要角色>  ?people. ?people <中文名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《古剑奇谭：琴心剑魄今何在》中，凶剑\"焚寂\"持有者的师傅有一对剑灵常伴左右，她们的名字是？",
        "output": "select ?ghost where{ ?f <中文名> \"焚寂\". ?f  <持有者>  ?people. ?master <徒弟> ?people. ?master <剑灵> ?ghost } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "同时在《仙剑奇侠传三外传：问情篇》与 《仙剑奇侠传三》登场的角色有哪些？",
        "output": "select DISTINCT ?name where{  ?game <中文名> \"仙剑奇侠传三\". ?people  <登场作品>  ?game. ?people <中文名> ?name. ?game1 <中文名> \"仙剑奇侠传三外传：问情篇\". ?people  <登场作品>  ?game1. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王菲和窦唯合作的歌曲有哪些？",
        "output": "select DISTINCT ?name where{ ?w <中文名> \"王菲\". ?d <中文名> \"窦唯\". ?song  ?x  ?w. ?song ?y ?d. ?song <中文名称> ?name } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些非处方药是中成药",
        "output": "select ?x where { ?x <类型> \"中成药\". ?x <是否处方药> \"非处方药\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些症状临床表现含有发热？",
        "output": "select ?x where { ?x <类型> <症状>. ?x <临床表现> ?y. FILTER REGEX(?y, \"发热\") } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些症状有已知起因但无涉及症状？",
        "output": "select ?x where { ?x <类型> <症状>. ?x <起因> ?y. MINUS{ ?x <涉及症状> ?z. } } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些传染病无临床表现但有外文名？",
        "output": "select ?x where { ?x <传染病> \"是\". ?x <外文名> ?y. MINUS{ ?x <临床表现> ?z. } } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些是在中文维基百科上已知分子式与分子量且有外文名的药品？",
        "output": "select ?x where { ?x <分子式> ?z. ?x <外文名> ?y. ?x <分子量> ?amount. ?x <来源> \"中文维基百科\" } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与新型冠状病毒有关的事件有哪些",
        "output": "select ?x where{ ?x <类型> <事件>. ?x <标签> ?y. FILTER REGEX(?y, \"新型冠状病毒\") } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "所有抗生素的名称？",
        "output": "select ?x where { ?x <类型> <抗生素> } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些疾病是已知常见病因且发病部位为牙齿?",
        "output": "select ?x where { ?x <类型> <疾病>. ?x <发病部位> \"牙齿\". ?x <常见病因> ?y } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "哪些是非传染性的胃炎",
        "output": "select ?x where { ?x <类型> <疾病>. ?x <标签> ?y. ?x <传染性> \"否\". FILTER REGEX(?y, \"胃炎\") } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些急性病已知常见病因？",
        "output": "select ?x where { ?x <类型> <疾病>. ?x <标签> ?y. ?x <常见病因> ?z. FILTER REGEX(?y, \"急性\") } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些可以治疗肝炎的处方药？",
        "output": "select ?x where { ?x <类型> <药物>. ?x <标签> ?y. ?x <是否处方药> \"处方药\". FILTER REGEX(?y, \"肝炎\") } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有哪些是非处方药的疫苗？",
        "output": "select ?x where { ?x <类型> <药物>. ?x <标签> ?y. ?x <是否处方药> \"非处方药\". FILTER REGEX(?y, \"疫苗\") } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由波风水门开发，漩涡鸣人为主要使用者的忍术有哪些衍生术？",
        "output": "select ?x where { ?y <衍生术> ?x. ?y <开发者> <波风水门>. ?y <主要使用者> <漩涡鸣人>.  } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冲矢昴的真实身份喜欢的饮品是什么？",
        "output": "select ?x where { ?y <喜欢的饮品> ?x. <冲矢昴> <真实身份> ?y. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "主要成就为“2013 S3全球总决赛中国区冠军”的斗鱼主播是谁？",
        "output": "select ?x where { ?x <直播平台> <斗鱼_（弹幕式直播分享网站）>. ?x <主要成就> \"2013 S3全球总决赛亚军\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "晚安水果茶的主要食材中，属于金虎尾目西番莲科的是？",
        "output": "select ?x where { <晚安水果茶> <主要食材> ?x. ?x <目> <金虎尾目>. ?x <科> <西番莲科>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "敖厂长的代表作所在的播放平台的口号是什么？",
        "output": "select ?x where { <敖厂长> <代表作品> ?y. ?y <在线播放平台> ?z. ?z <网站口号> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么公司既是肯德基的盟友又是可口可乐的死对头？",
        "output": "select ?x where { ?x <联盟> <肯德基>. ?x <竞争对手> <可口可乐>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "齐达内的国家队队友亨利在场上穿几号球衣？",
        "output": "select ?x where { <齐内丁·齐达内> <队友> ?y. ?y <球服数字> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "别称苍老师的日本AV女优主演了哪些作品？",
        "output": "select ?x where { ?y <国籍> <日本_（日本国）>. ?y <职业> <AV女优>. ?y <别名> \"苍老师\". ?y <代表作品> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "科技美学的创始人有哪些别名？",
        "output": "select ?x where { <科技美学> <创始人> ?y. ?y <别名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "主演《致青春·原来你还在这里》的加拿大籍演员是谁？",
        "output": "select ?x where { <致青春·原来你还在这里> <主演> ?x. ?x <国籍> <加拿大_（北美洲国家）>. ?x <职业> <演员_（职业）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江卫视的代表节目\"Running Man\"的主持人都有谁？",
        "output": "select ?x where { <浙江卫视> <代表节目> ?y. ?y <外文名称> \"Running Man\". ?y <主持人> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "被评为2010年度编程语言的解释型语言的设计者是谁？",
        "output": "select ?x where { ?y <荣誉> \"2010年度编程语言\". <解释型语言> <例子> ?y. ?y <设计者> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由杨颖出演mv，林夕填词，林俊杰谱曲的歌曲是谁的代表作？",
        "output": "select ?x where { ?x <代表作品> ?y. ?y <mv出演> <杨颖_（中国女演员、模特、歌手）>. ?y <填词> <林夕_（著名填词人）>. ?y <谱曲> <林俊杰_（新加坡男歌手）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "洪涛导演的代表作综艺中历届冠军都是谁？",
        "output": "select ?x where { ?y <导演> <洪涛_（中国内地综艺节目导演）>. <洪涛_（中国内地综艺节目导演）> <代表作品> ?y. ?y <赛季冠军> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "陈羽凡，胡海泉组成的组合叫什么？",
        "output": "select ?x where { ?y <中文名> ?x. ?y <组合成员> <胡海泉_（中国内地歌手）>. ?y <组合成员> <陈羽凡>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由电子工业出版社出版的《深入理解计算机系统》定价多少？",
        "output": "select ?x where { ?y <出版社> <电子工业出版社>. ?y <书名> \"深入理解计算机系统\". ?y <定价> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由王宏担任导演，余华担任文学顾问的科学幻想动漫是什么？",
        "output": "select ?x where { ?x <类型> <科学幻想>. ?x <类型> <动漫>. ?x <导演> <王宏_（原湖南宏梦卡通集团董事长）>. ?x <文学顾问> <余华_（当代作家）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《火影忍者》中，卡卡西感兴趣的《亲热天堂》是谁的大作？",
        "output": "select ?x where { <旗木卡卡西> <兴趣> ?y. ?y <作者> ?x. ?y <中文名> \"亲热天堂\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于日本关西，市花是紫罗兰的城市是哪座？",
        "output": "select ?x where { ?x <所属地区> <日本_（日本国）>. ?x <所属地区> <关西_（地理区域）>. ?x <市花> <紫罗兰_（十字花科草本植物）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在优酷、爱奇艺平台上映的《铁甲小宝》的出品公司是？",
        "output": "select ?x where { ?y <中文名> \"铁甲小宝\". ?y <在线播放平台> <爱奇艺>. ?y <在线播放平台> <优酷网>. ?y <出品公司> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伦敦奥运会男子1500米自由泳冠军都有哪些外号？",
        "output": "select ?x where { ?y <主要奖项> \"伦敦奥运会男子1500米自由泳冠军\". ?y <别名> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《物理竞赛集训精编》、《奥赛物理题选》的作者的代表作是？",
        "output": "select ?x where { <物理竞赛集训精编> <作者> ?y. <奥赛物理题选> <作者> ?y. ?y <代表作品> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宇智波鼬使用的忍术“月读”都有哪些疑似使用者？",
        "output": "select ?x where { ?y <使用者> <宇智波鼬>. ?y <中文名> \"月读\". ?y <疑似使用者> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "刘杰配音了《名侦探柯南》中的哪些角色？",
        "output": "select ?x where { ?x <配音> <刘杰_（台湾配音演员）>. ?x <登场作品> <柯南_（同名漫画改编的长篇推理动画）>. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "万有引力的提出者的研究领域有哪些？",
        "output": "select ?x where { ?y <主要成就> \"万有引力定律\". ?y <研究领域> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西医学名“牙垢”的别称是什么？",
        "output": "select ?x where { ?y <西医学名> \"牙垢\". ?y <其他名称> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "彼得·舒梅切尔的儿子效力的英超俱乐部的主场是什么？",
        "output": "select ?x where { ?y <父亲> <彼得·舒梅切尔>. ?y <所属运动队> ?z. ?z <主场馆> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "DNA聚合酶的作用是什么？",
        "output": "select ?x where { <DNA聚合酶>\t<作用> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "参与新型冠状病毒战役的李兰娟都有什么事迹？",
        "output": "select ?x where { ?y <参与战役> <新型冠状病毒战役>. ?y <标签> \"李兰娟\". ?y <事迹> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2020年2月7日殉职的武汉中心医院眼科医生李文亮在这次疫情中做了什么？",
        "output": "select ?x where { ?y <死亡时间> <2020-02-07>. ?y <履历> <武汉中心医院眼科医生>. ?y <事迹> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "钟南山从事什么职业？",
        "output": "select ?x where { <钟南山（中国工程院院士、著名呼吸病学专家）> <职业> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新型冠状病毒肺炎都有哪些症状？",
        "output": "select ?x where { <新型冠状病毒肺炎> <症状> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新型冠状病毒具有什么生理机能？",
        "output": "select ?x where { ?y <生理机能> ?x. ?y <标签> \"新型冠状病毒（SARS-CoV-2）\". } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "双黄连口服液的功效是什么？",
        "output": "select ?x where { ?y <标签> \"双黄连口服液\". ?y <功效> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "N95口罩的防护标准是什么？",
        "output": "select ?x where { ?y <标签> \"N95口罩\". ?y <防护标准> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湖北省人民政府在什么时候发表了《湖北省人民政府关于加强新型冠状病毒感染的肺炎防控工作的通告》?",
        "output": "select ?x where { ?y <标签> \"湖北省人民政府关于加强新型冠状病毒感染的肺炎防控工作的通告\". ?y <发布单位> \"湖北省人民政府\". ?y <发布时间> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "政策《关于进一步做好新型冠状病毒感染的肺炎疫情防控工作的通知》的内容是什么？",
        "output": "select ?x where { ?y <政策标题> \"关于进一步做好新型冠状病毒感染的肺炎疫情防控工作的通知\". ?y <政策内容> ?x. } "
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "普通医用口罩的防护标准是什么？",
        "output": "select ?x where { ?y <标签> \"普通医用口罩\". ?y <防护标准> ?x. } "
    }
]