[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "卡库、鹤参谋是哪儿的人物？",
        "output": "select ?x where { <鹤参谋> <登场作品> ?x. <卡库> <登场作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和尼采来自同一国家的哲学家都有哪些？",
        "output": "select ?y where { <弗里德里希·威廉·尼采> <国籍> ?x.?y <国籍> ?x.?y <职业> <哲学家_（基础含义）>.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "公司口号为\"just do it \"的运动品牌的著名签约明星都有谁？",
        "output": "select ?y where { ?x <公司口号> \"Just do it\". ?x <签约明星> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "福尔摩斯的哥哥从事什么职业？",
        "output": "select ?y where { <福尔摩斯_（英国作家阿瑟·柯南·道尔创作人物）> <哥哥> ?x. ?x <职业> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚洲哪个国家的时区是\"UTC+8\"？",
        "output": "select ?x where { ?x <所属洲> <亚洲>. ?x <时区> \"UTC+8\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"五经\"被称作\"书经\"的是什么？",
        "output": "select ?x where { ?x <作品出处> <五经_（儒家典籍）>. ?x <作品别名> \"书经\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张柏芝出演的时长116分钟并在2005年12月15日上映的电影是哪一部？",
        "output": "select ?x where { ?x ?a <张柏芝>. ?x <片长> \"116分钟\". ?x <上映时间> \"2005-12-15\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "车辆驾驶方向和澳大利亚一样且官方语言也一样的国家有哪些？",
        "output": "select ?x where { <澳大利亚> <道路通行> ?z.<澳大利亚> <官方语言> ?y. ?x <官方语言> ?y.?x <道路通行> ?z}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周杰伦经纪公司的外文名？",
        "output": "select ?x where { <周杰伦> <经纪公司> ?y. ?y <外文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斯伯丁创立于哪年？",
        "output": "select ?y where { ?x <公司名称> \"斯伯丁\". ?x <成立时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与nba对应的中国相应的协会的英文缩写是什么？",
        "output": "select ?x where { ?y <主要赛事> <NBA>. ?y <中国篮球协会> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"国际章\"上的大学还出了什么名人？",
        "output": "select ?x where { <章子怡> <毕业院校> ?y. ?y <知名校友> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"现代航天之父\"毕业于哪所学校？",
        "output": "select ?x where { ?y <毕业院校> ?x. ?y <主要成就> \"现代航天之父\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "西班牙王国国歌的时长是多少？",
        "output": "select ?p where { ?x <中文名称> ?y . filter regex(?y, \"西班牙王国\") . ?x <国歌> ?z . ?z <歌曲时长> ?p . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁的弟子提出了\"合纵抗秦\"？",
        "output": "select ?y where { ?x <师承> ?y. ?x <主要成就> \"合纵抗秦\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "校庆日为11月11日的学校现任校长有谁？",
        "output": "select ?y where { ?x <校庆日> \"11-11\" . ?x <现任校长> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张柏芝、谢霆锋合作的动作电影里的服装是谁设计的？",
        "output": "select ?y where { ?x ?a <张柏芝>. ?x ?b <谢霆锋>. ?x <类型> <动作_（词语解释）>. ?x <服装设计> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "总统奥巴马信仰的宗教有哪些主要圣事?？",
        "output": "select ?p where { ?x <中文名> ?y . filter regex(?y, \"奥巴马\") . ?x <职业> <总统_（国家元首称谓）> . ?x <信仰> ?z . ?z <主要圣事> ?p . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国女乒选手中曾获女双冠军的是？",
        "output": "select ?x where { ?x <运动项目> <乒乓球> . ?x <主要奖项> \"女双冠军\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国第一个奥运会冠军是谁？",
        "output": "select ?x where { ?x <重要事件> \"1984年为中国夺得第一个金牌\". ?x <主要奖项> \"1984年7月29日洛杉矶奥运会自选手枪比赛冠军\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"大姚\"在篮球场上的位置是？",
        "output": "select ?x where { ?y <别名> \"明王、移动长城、小巨人、大姚\". ?y <位置> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朱元璋的妻子葬于哪里？",
        "output": "select ?y where { <朱元璋_（明朝开国皇帝）> <配偶> ?x. ?x <陵寝> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "游城十代出场动漫的编剧是谁？",
        "output": "select ?z where { ?x <中文名> \"游城十代\" . ?x <登场作品> ?y . ?y <编剧> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "巴塞罗那哪个球员获得过金靴奖?？",
        "output": "select ?x where { ?x <所属运动队> <巴塞罗那_（足球俱乐部）>. ?x <主要奖项> \"金靴奖\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《指环王》系列电影的发行公司后来被哪个公司收购了？",
        "output": "select ?y where { <指环王_（英美2001-2003年彼得·杰克逊执导系列电影）> <发行公司> ?x. ?x <收购公司> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "校庆日在09-29且现任校长是谢和平的学校建在什么地方？",
        "output": "select ?y where { ?x <校庆日> \"09-29\". ?x <现任校长> <谢和平>. ?x <所属地区> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北大现任校长的信仰是什么？",
        "output": "select ?y where { <北京大学> <现任校长> ?x. ?x <信仰> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "殖民有怎样的优点和缺点？",
        "output": "select ?x where { {<殖民> <优点> ?x . } union{ <殖民> <缺点> ?x . } . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "亚洲哪个国家的宗教圣地是麦地那？",
        "output": "select ?x where { ?x <所属洲> <亚洲>. ?x <宗教圣地> \"麦地那\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四大名旦之首的籍贯是什么地方？",
        "output": "select ?x where { ?y <主要成就> \"四大名旦之首\". ?y <籍贯> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于英国的足球门将的身高是多少？",
        "output": "select ?y where { ?x <场上位置> <门将>. ?x <出生地> <英国_（大不列颠及北爱尔兰联合王国）>. ?x <身高> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《存在与时间》一书的作者是哪个民族的人？",
        "output": "select ?y where { <存在与时间> <作者> ?x. ?x <民族> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯的创始人都有哪些主要成就？",
        "output": "select ?y where { <腾讯> <创始人> ?x. ?x <主要成就> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "布里斯班所在国家有哪些地方和布里斯班气候相似？",
        "output": "select ?y where { <布里斯班_（澳大利亚昆士兰州首府）> <气候条件> ?x.<布里斯班_（澳大利亚昆士兰州首府）> <所属国家> ?z.?y <气候条件> ?x.?y <所属地区> ?z.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毒战导演有哪些代表作品？",
        "output": "select ?y where { <毒战> <导演> ?x. ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "故宫的建造者的逝世地点在哪里？",
        "output": "select ?y where { <故宫_（北京故宫）> <建造者> ?x. ?x <逝世地点> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "多元组：克苏鲁出自哪位作家创作的小说？",
        "output": "select ?y where { <克苏鲁_（克苏鲁的呼唤神话小说里面的邪灵角色）> <出处> ?x. ?x <作者> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《醉翁亭记》是哪个朝代的人写的？",
        "output": "select ?x where { <醉翁亭记> <作者> ?y. ?y <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著有《百年孤独》一书的作者出生于何时？",
        "output": "select ?x where { <百年孤独> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "火腿起源于我国古代的一个朝代，它的选官制度是什么？",
        "output": "select ?y where { <火腿_（腌制或熏制的猪腿）> <起源> ?x. ?x <选官制度> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "捷克的首都有什么样的美誉？",
        "output": "select ?y where { ?x <所属地区> <捷克> . ?x <行政区类别> <首都_（汉语词语）> . ?x <别名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "星爷的公司是哪年成立的？",
        "output": "select ?x where { <周星驰> <经纪公司> ?y. ?y <成立时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "位于茂名的革命老区村庄是哪个村？",
        "output": "select ?x where { ?x <地理位置> <茂名>. ?x <村庄荣誉> \"革命老区村庄\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "希特勒所属的政党有怎样的意识形态?？",
        "output": "select ?p where { ?x <中文名> ?z . filter regex(?z, \"希特勒\") . ?x <所属政党> ?y . ?y <意识形态> ?p . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斯德哥尔摩所在的国家主要民族是？",
        "output": "select ?x where { ?y <首都> <斯德哥尔摩_（瑞典首都）>. ?y <主要民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电视剧冰与火之歌的出品公司的官方网站是什么？",
        "output": "select ?x where { <冰与火之歌_（美国HBO电视台制作的电视剧）> <出品公司> ?y.?y <官网> ?x.}"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲《那些年》的原唱还有哪些歌曲？",
        "output": "select ?x where { <那些年_（《那些年，我们一起追的女孩》主题曲）> <歌曲原唱> ?y. ?x <歌曲原唱> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "AlphaGo的设计者是谁？",
        "output": "select ?y where { ?x <外文名> \"AlphaGo\". ?x <设计者> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "太宰治写过什么中篇小说？",
        "output": "select ?x where { <太宰治_（日本小说家）> <代表作品> ?x. ?x <文学体裁> <中篇小说>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "歌曲《红玫瑰》的原唱歌手是什么民族的？",
        "output": "select ?x where { <红玫瑰_（陈奕迅演唱歌曲）> <歌曲原唱> ?y. ?y <民族> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金正恩父亲的军衔有多高？",
        "output": "select ?x where { <金正恩_（朝鲜最高领导人）> <父亲> ?y. ?y <军衔> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "处女座守护星用英语怎么说呀？",
        "output": "select ?z where { ?x <中文名> \"处女座\" . ?x <守护星> ?y . ?y <外文名> ?z . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "以伏特加、朗姆、龙舌兰、金酒作为基酒的鸡尾酒叫什么？",
        "output": "select ?x where { ?x <基酒> <伏特加_（酒类名称）>. ?x <基酒> <朗姆酒_（蒸馏酒名）>. ?x <基酒> <龙舌兰_（烈酒名）>. ?x <基酒> <金酒>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国首都的电话区号是多少？",
        "output": "select ?y where { <中华人民共和国> <首都> ?x. ?x <电话区号> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "有一部电影是由马里奥·普佐的小说改编，马龙·白兰度主演，请问它在哪一年上映？",
        "output": "select ?y where { ?x <原著> <马里奥·普佐>. ?x <主演> <马龙·白兰度>. ?x <上映时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《野草》的作者的代表作品有哪些？",
        "output": "select ?x where { <野草_（鲁迅创作散文诗集）> <作者> ?y. ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "NIKE总部所在地有哪些大学？",
        "output": "select ?x where { <NIKE> <总部地点> ?y. ?y <高等院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2013年全运会乒乓球男团冠军是哪个队伍？",
        "output": "select ?x where { ?person <运动项目> <乒乓球>. ?person <所属运动队> ?x. ?person <主要奖项> \"2013 全运会男团冠军\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《乡土中国》的作者有哪些代表作品",
        "output": "select ?x where { <乡土中国> <作者> ?y . ?y <代表作品> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得过两届柏林国际电影节金熊奖的中国导演是谁？",
        "output": "select ?x where { ?x <国籍> <中华人民共和国>. ?x <主要成就> \"两届 柏林国际电影节金熊奖\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "十大元帅中，哪位是湖北人？",
        "output": "select ?x where { <十大元帅> <人物> ?x. ?x <出生地> <湖北>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "薛之谦在2015年发行过哪些歌？",
        "output": "select ?x where { ?x <歌曲原唱> ?y . ?y <中文名> \"薛之谦\" . ?x <发行时间> ?z . filter regex(?z, \"2015\") . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "在金庸小说《天龙八部》中，剑神卓不凡属于哪个门派？",
        "output": "select ?x where { <卓不凡_（金庸小说《天龙八部》中人物）> <别名> \"剑神\". <卓不凡_（金庸小说《天龙八部》中人物）> <门派> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "游戏《敢死队的战争》的发行站点的网站口号是什么？",
        "output": "select ?x where { <敢死队的战争> <游戏站点> ?y. ?y <公司口号> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "那个作家，就是写了《古炉》的，是啥时候生人啊？",
        "output": "select ?x where { ?y <代表作品> <古炉>. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "汉高祖刘邦的陵寝的别名是什么？",
        "output": "select ?y where { <刘邦_（汉朝开国皇帝）> <陵墓> ?x. ?x <别名> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "地处长沙、输入创办于1904年的高中的校训是什么？",
        "output": "select ?y where { ?x <创办时间> \"1904\". ?x <所属地区> <长沙_（湖南省省会）> . ?x <校训> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "完成天下布武的大名最后在哪里逝世？",
        "output": "select ?x where { <织田信长_（日本战国三杰之一，安土桃山时代的大名）> <主要成就> \"天下布武；设立乐市乐座\". <织田信长_（日本战国三杰之一，安土桃山时代的大名）> <逝世地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"黑旋风\"在梁山座次排行第几？",
        "output": "select ?y where { ?x <别名> \"黑旋风，铁牛\". ?x <梁山座次> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出演了《仙剑奇侠传三》和《小时代》的明星是谁？",
        "output": "select ?x where { <仙剑奇侠传三_（2009年李国立执导电视剧）> <主演> ?x. <小时代_（2013年郭敬明执导电影）> <主演> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小迪是哪个学校毕业的？",
        "output": "select ?x where { ?y <别名> \"小迪、胖迪、热巴\". ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《丰乳肥臀》的作者的毕业院校是？",
        "output": "select ?x where { <丰乳肥臀> <作者> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北大现任校长何时开始工作？",
        "output": "select ?y where { <北京大学> <现任校长> ?x. ?x <工作时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "朱茵的丈夫有哪些音乐作品？",
        "output": "select ?x where { <朱茵_（中国香港女演员）> <配偶> ?y. ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皇马的主席毕业于哪个学校？",
        "output": "select ?x where { <皇家马德里_（皇家马德里足球俱乐部）> <主席> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《谈艺录》的作者是哪个学校毕业的？",
        "output": "select ?x where { ?y <代表作品> <谈艺录_（钱钟书创作诗话作品）>. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "静夜思的作者的祖籍是哪里？",
        "output": "select ?x where { ?y <主要作品> <静夜思_（李白诗作）>. ?y <祖籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "由张歆艺主演，王晓明导演的电视剧的中文名是？",
        "output": "select ?x where { ?y <主演> <张歆艺>. ?y <导演> <王晓明_（中国内地演员）>. ?y <中文名> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《封神演义》中姬发的兄弟，有一对翅膀的人，他的师父是谁？",
        "output": "select ?y where { ?x <别名> \"蝉之子、义子\". ?x <兄弟> <姬发>. ?x <师父> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李宗翰、张柏芝合作的动作片有多长？",
        "output": "select ?y where { ?x ?a <张柏芝>. ?x ?b <李宗翰>. ?x <类型> <动作_（词语解释）>. ?x <片长> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小苏打片的主要成分的化学式是什么？",
        "output": "select ?y where { <小苏打片> <成份> ?x. ?x <化学式> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小马哥有什么社会影响？",
        "output": "select ?y where { ?x <别名> \"小马哥\". ?x <社会影响> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Steve Jobs什么时候去世？",
        "output": "select ?y where { ?x <外文名> \"Steve Jobs\". ?x <逝世日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《悲惨世界》的作者的毕业院校是？",
        "output": "select ?x where { <悲惨世界_（法国作家雨果创作长篇小说）> <作者> ?y. ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"2009年第一轮第3位被雷霆队选中\"的球员获得了哪些奖项？",
        "output": "select ?y where { ?x <nba选秀> \"2009年第一轮第3位被雷霆队选中\" . ?x <主要奖项> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "女王尼托克丽丝统治的王国面积有多大？",
        "output": "select ?y where { <尼托克丽丝> <出生地> ?x. ?x <国土面积> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《乡土中国》的作者毕业于哪个大学",
        "output": "select ?x where { <乡土中国> <作者> ?y . ?y <毕业院校> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "你读过《追风筝的人》吗，你知道他的作者是哪个国家的人吗？",
        "output": "select ?y where { ?x <代表作品> <追风筝的人_（卡勒德·胡赛尼著小说成长的故事）>. ?x <国籍> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影阿凡达的哪些主演来自于美国？",
        "output": "select ?y where { <Avatar_（2009年上映詹姆斯·卡梅隆执导美国电影）> <主演> ?y. ?y <国籍> <美国_（美利坚合众国）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "安菲尔德球场容纳人数为？",
        "output": "select ?y where { ?x <主场馆> <安菲尔德球场>. ?x <容纳人数> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "北京大学出了哪些化学家",
        "output": "select ?x where { ?x <职业> <化学家> . ?x <毕业院校> <北京大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和叔本华拥有相同信仰的都有那些人？",
        "output": "select ?x where { <亚瑟·叔本华> <信仰> ?y. ?x <信仰> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清华毕业的满族人有哪些？",
        "output": "select ?x where { ?x <毕业院校> <清华大学>. ?x <民族> <满族>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "写出《形而上学的沉思》的那名哲学家出生于哪里？",
        "output": "select ?y where { ?x <代表作品> <形而上学的沉思>. ?x <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "颐和园那里是什么气候类型？",
        "output": "select distinct ?y where { ?x <中文名称> \"颐和园\" . ?x <气候类型> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"而立之年\"这一说法的提出者原名是什么？",
        "output": "select ?y where { <而立之年_（汉语成语）> <提出人> ?x. ?x <本名> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《随想录》的作者其代表作品有哪些？",
        "output": "select ?x where { <随想录> <作者> ?y. ?y <代表作品> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "复旦大学出了哪些翻译家",
        "output": "select ?x where { ?x <职业> <翻译家> . ?x <毕业院校> <复旦大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "扬州八怪中擅长画竹的是谁？",
        "output": "select distinct ?x where { <扬州八怪_（中国清代中期书画家）> <成员> ?x. ?x <代表作品> ?y. filter(regex(str(?y), \"竹\")). }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "电影《阿凡达》获得了哪些奖项？",
        "output": "select ?y where { ?x <中文名> \"阿凡达\". ?x <主要奖项> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《全职猎人》因为其作者不务正业更新缓慢，请问作者沉迷的爱好是什么？",
        "output": "select ?y where { <全职猎人_（富坚义博创作的漫画）> <作者> ?x. ?x <爱好> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "物理学家卢瑟福是哪国人？",
        "output": "select ?x where { <欧内斯特·卢瑟福> <职业> <物理学家_（探索、研究物理学的科学家）>. <欧内斯特·卢瑟福> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《额尔古纳河右岸》的作者有哪些代表作？",
        "output": "select ?y where { <额尔古纳河右岸> <作者> ?x. ?x <代表作品> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肯德基的创始人是哪国人？",
        "output": "select ?y where { <肯德基> <创始人> ?x . ?x <国籍> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "获得奥斯卡最佳外语片奖的李安的作品是什么？",
        "output": "select ?x where { ?x <导演> <李安_（华人导演）>. ?x <主要奖项> \"奥斯卡最佳外语片奖\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "四川大学出了哪些文学家",
        "output": "select ?x where { ?x <职业> <文学家> . ?x <毕业院校> <四川大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《根鸟》的作者的出生日期是哪一天",
        "output": "select ?x where { <根鸟> <作者> ?y . ?y <出生日期> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "比尔·盖茨创建的公司有什么软件产品？",
        "output": "select ?y where { ?x <联合创始人> <比尔·盖茨_（美国微软公司联合创始人）>. ?x <主要软件产品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肯德基的创始人何时出生？",
        "output": "select ?y where { <肯德基> <创始人> ?x . ?x <出生日期> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"少马爷\"的父亲是谁？",
        "output": "select ?z where { ?x <别名> \"少马爷\". ?x <父亲> ?z. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "斯坦福大学出了那些经济学家？",
        "output": "select ?x where { ?x <职业> <经济学家_（拥有原创的经济学基础理论的经济学人）> . ?x <毕业院校> <斯坦福大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "著称\"巩皇、输入女王\"的知名女演员出演了哪些电影和电视剧？",
        "output": "select ?y where { ?x <别名> \"巩皇、女王\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "浙江大学出了哪些政治家",
        "output": "select ?x where { ?x <职业> <政治家> . ?x <毕业院校> <浙江大学> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯公司董事长毕业于哪个学校？",
        "output": "select ?y where { <腾讯> <董事局主席> ?x. ?x <毕业院校> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"三公九卿\"可能出现在哪个朝代？",
        "output": "select ?x where { { ?x <中央制度> \"三公九卿\". } union { ?x <中央官制> \"三公九卿\". }. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "瑞士国歌的发行时间？",
        "output": "select ?x where { <瑞士> <国歌> ?y. ?y <发行时间> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "2008年举办的夏季奥运会是第几届？",
        "output": "select ?x where { <2008年北京奥运会> <赛事类型> <夏季奥林匹克运动会>. <2008年北京奥运会> <届数> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "使用大陆法系的欧洲国家有哪些？",
        "output": "select ?x where { ?x <法律体系> <大陆法系>. ?x <所属洲> <欧洲_（地球七大洲之一）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "古希腊著名哲学家有哪些？",
        "output": "select ?x where { ?x <国籍> <古希腊_（爱琴海-色雷斯文明圈的黄金时期）>. ?x <职业> <哲学家_（基础含义）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "龙凤店的导演的出生地是哪？",
        "output": "select ?x where { <龙凤店> <导演> ?y. ?y <出生地> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "长篇小说堂吉诃德有多少字？",
        "output": "select ?y where { ?x <作品别名> \"堂吉诃德、唐·吉诃德\". ?x <字数> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "出生于上海且曾在《微微一笑很倾城》中扮演角色的演员毕业于哪所学校？",
        "output": "select ?y where { ?x <出生地> <上海_（中华人民共和国直辖市）> . ?x <代表作品> <微微一笑很倾城_（2016年郑爽、杨洋主演电视剧）>. ?x <毕业院校> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "李宗伟的祖国的首都是哪里？",
        "output": "select ?x where { <李宗伟> <国籍> ?y. ?y <首都> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "王者荣耀是什么类型的游戏？",
        "output": "select ?y where { ?x <中文名> \"王者荣耀\" . ?x <游戏类型> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "湛江市市花又叫做什么？",
        "output": "select ?x where { <湛江> <市花> ?y. ?y <别称> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"2009年第一轮第3位被雷霆队选中\"的球员的毕业院校是？",
        "output": "select ?y where { ?x <nba选秀> \"2009年第一轮第3位被雷霆队选中\" . ?x <毕业院校> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高数是哪些人最先创立的？",
        "output": "select ?y where { ?x <中文名> \"高等数学\" . ?x <创始人> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "徐纪周自导自编的34集电视剧是哪部？",
        "output": "select ?x where { ?x <编剧> <徐纪周>. ?x <导演> <徐纪周>. ?x <集数> \"34\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "和博尔赫斯同一民族的都有哪些人？",
        "output": "select ?x where { <豪尔赫·路易斯·博尔赫斯_（阿根廷作家）> <民族> ?y. ?x <民族> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小仲马的代表作品是什么？",
        "output": "select ?y where { ?x <别名> \"小仲马\". ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "画出《墨虾》的画家是哪里人？",
        "output": "select ?y where { ?x <代表作品> <墨虾>. ?x <出生地> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "秦始皇的继承者的结局？",
        "output": "select ?y where { <秦始皇_（中国首位皇帝）> <继承人> ?x. ?x <人物结局> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "清朝有哪些政治家？",
        "output": "select ?x where { ?x <国籍> <清朝_（中国历史朝代）>. ?x <职业> <政治家>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "高加索地区所属大陆的人口密度？",
        "output": "select ?x where { <高加索> <所属地区> ?y. ?y <人口密度> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "美国总统罗斯福的母校创办时间？",
        "output": "select ?y where { ?x <知名校友> <罗斯福_（美国第三十二届总统）>. ?x <创办时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "史诗《伊利亚特》的作者诞生于何时？",
        "output": "select ?y where { ?x <代表作品> <伊利亚特_（《荷马史诗》之一）>. ?x <出生日期> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "儒家文化对中国影响深远，试着举出几个以它为信仰的哲学家",
        "output": "select ?x where { ?x <信仰> <儒道_（儒家文化）>. ?x <职业> <哲学家_（基础含义）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "所有球衣号码是9的巴西足球运动员？",
        "output": "select ?x where { ?x <球衣号码> \"9\". ?x <运动项目> <足球>. ?x <国籍> <巴西_（巴西联邦共和国）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "杨紫琼、章子怡合作过哪些作品？",
        "output": "select ?x where { ?x ?y <章子怡>. ?x ?y <杨紫琼>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "日本哪座城市以紫罗兰为市花？",
        "output": "select ?x where { <日本_（日本国）> <主要城市> ?x. ?x <市花> <紫罗兰_（十字花科草本植物）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "飞行棋有几种颜色？",
        "output": "select ?y where { ?x <中文名> \"飞行棋\" . ?x <颜色> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "贝多芬的国家的首都是？",
        "output": "select ?x where { <音乐家贝多芬> <国籍> ?y. ?y <首都> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "1997版泰坦尼克号的主演都有谁?？",
        "output": "select ?y where { ?x <中文名> \"泰坦尼克号\" . ?x <出品时间> \"1997\" . ?x <主演> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "第85届奥斯卡金像奖最佳女配角毕业于哪个大学？",
        "output": "select ?x where { ?y <主要成就> \"第85届奥斯卡金像奖最佳女配角\". ?y <毕业院校> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "楚玉是哪位作家所创作的角色？",
        "output": "select ?x where { ?x <代表作品> ?z. ?z <主要人物> <楚玉>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "香奈儿五号香水是什么时候发行的？",
        "output": "select ?y where { ?x <别名> \"香奈儿五号\". ?x <发行时间> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "孟京辉导演廖一梅编剧的作品是？",
        "output": "select ?x where { ?x <导演> <孟京辉>. ?x <编剧> <廖一梅>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "张继科参加的比赛项目起源于哪里？",
        "output": "select ?y where { <张继科> <运动项目> ?x. ?x <起源> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "\"封建\"一词的基本含义？",
        "output": "select ?y where { ?x <中文名> \"封建\" . ?x <基本含义> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "丈夫是电视剧《红高粱》男主角的女明星？",
        "output": "select ?x where { ?x <丈夫> ?y. ?y <代表作品> <红高粱_（2014年郑晓龙执导周迅主演电视剧）>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国史上有一位出生在台安县的一级上将，他的妻子是谁？",
        "output": "select ?y where { ?x <出生地> <台安县>. ?x <军衔> <一级上将>. ?y <丈夫> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腾讯的创始人中，谁的外文名是\"Pony\"？",
        "output": "select ?x where { <腾讯> <创始人> ?x. ?x <外文名> \"Pony\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《随想录》的作者出生日期是？",
        "output": "select ?x where { <随想录> <作者> ?y. ?y <出生日期> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "上海铁路局下辖哪些特等站？",
        "output": "select ?x where { ?x <车站等级> <特等站>. ?x <隶属铁路局> <上海铁路局>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中国有一所1897年5月21日建立的大学，它的校训是\"福建地税精神\"，它的现任校长是谁？",
        "output": "select ?y where { ?x <创办时间> \"1897-05-21\". ?x <现任校长> ?y . ?x <校训> <福建地税精神>. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "秦始皇的继任者葬在哪里了？",
        "output": "select ?x where { <秦始皇_（中国首位皇帝）> <继承人> ?y. ?y <陵墓> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "叶芝是哪个国家的著名诗人？",
        "output": "select ?x where { <威廉·巴特勒·叶芝> <职业> <诗人_（汉语词语）>. <威廉·巴特勒·叶芝> <国籍> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《指环王》的作者是谁？",
        "output": "select ?x where { <指环王_（J.R.R.托尔金著系列小说）> <作者> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "法国的作家有哪些？",
        "output": "select ?x where { ?x <职业> <作家_（从事文学创作有成就的人）>. ?x <国籍> <法国_（法兰西共和国）> . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "宋徽宗的主要作品有哪些？",
        "output": "select ?y where { ?x <庙号> <徽宗>. ?x <主要作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "启蒙运动的代表人物都来自哪些国家？",
        "output": "select ?y where { <启蒙运动> <代表人物> ?x. ?x <国籍> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "赫鲁晓夫的出生地是哪里？",
        "output": "select ?y where { ?x <中文名> ?z . filter regex(?z, \"赫鲁晓夫\") . ?x <出生地> ?y . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "广义信息论的提出者的代表作品有哪些？",
        "output": "select ?y where { <广义信息论> <提出者> ?x. ?x <代表作品> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "成立于广东的物流公司CEO是谁？",
        "output": "select ?y where { ?x <成立地点> <广东>. ?x <经营范围> <物流公司>. ?x <集团总裁> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "谁发动本能寺之变？",
        "output": "select ?x where { ?x <主要成就> \"本能寺之变\". }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "我国被称誉为\"甲天下\"的城市是什么气候类型？",
        "output": "select ?y where { ?x <美誉> \"山水甲天下\". ?x <气候条件> ?y. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "《根鸟》的作者毕业于哪个大学",
        "output": "select ?x where { <根鸟> <作者> ?y . ?y <毕业院校> ?x . }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "Ukulele有几根弦？",
        "output": "select ?y where { ?x <外文名> \"Ukulele\". ?x <弦数> ?y. }"
    }
]