[
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血氧分压与哪些疾病有关？",
        "output": "select ?x where { <动脉血氧分压> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "PaO2属于什么类型的测定？",
        "output": "select ?x where { <PaO2> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "PaO2涉及症状有哪些？",
        "output": "select ?x where { <PaO2> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "PaO2与哪些疾病有关？",
        "output": "select ?x where { <PaO2> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "氧分压属于什么类型的检查？",
        "output": "select ?x where { <氧分压> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "氧分压涉及症状有哪些？",
        "output": "select ?x where { <氧分压> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "氧分压与哪些疾病有关？",
        "output": "select ?x where { <氧分压> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "核酸检测属于什么类型的检查？",
        "output": "select ?x where { <核酸检测> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "干扰素属于什么类型?",
        "output": "select ?x where { <干扰素> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "干扰素与什么疾病有关？",
        "output": "select ?x where { <干扰素> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿常规属于什么类型的检查？",
        "output": "select ?x where { <尿常规> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿常规涉及到的症状有哪些？",
        "output": "select ?x where { <尿常规> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "尿常规与什么疾病有关？",
        "output": "select ?x where { <尿常规> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血气分析属于什么类型的测定？",
        "output": "select ?x where { <动脉血气分析> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血气分析涉及到的症状有哪些？",
        "output": "select ?x where { <动脉血气分析> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉血气分析与什么疾病有关？",
        "output": "select ?x where { <动脉血气分析> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心肌酶属于什么类型的测定？",
        "output": "select ?x where { <心肌酶> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心肌酶涉及到的症状有什么？",
        "output": "select ?x where { <心肌酶> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心肌酶的测定与什么疾病有关？",
        "output": "select ?x where { <心肌酶> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "体温属于什么类型的检查？",
        "output": "select ?x where { <体温> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "体温涉及到的症状有哪些？",
        "output": "select ?x where { <体温> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征属于什么?",
        "output": "select ?x where { <急性呼吸窘迫综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征属于什么科？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征的同义词是什么？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征涉及到的症状有哪些？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性呼吸窘迫综合征伴随症状有哪些？",
        "output": "select ?x where { <急性呼吸窘迫综合征> <伴随症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克属于什么？",
        "output": "select ?x where { <休克> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克需要在什么科就诊？",
        "output": "select ?x where { <休克> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克涉及什么检查？",
        "output": "select ?x where { <休克> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "休克涉及到的症状有哪些？",
        "output": "select ?x where { <休克> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "中毒属于什么类型？",
        "output": "select ?x where { <中毒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染属于什么类型？",
        "output": "select ?x where { <冠状病毒感染> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染常见病因是什么？",
        "output": "select ?x where { <冠状病毒感染> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染应该在什么科室就诊？",
        "output": "select ?x where { <冠状病毒感染> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "冠状病毒感染的同义词是什么？",
        "output": "select ?x where { <冠状病毒感染> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎属于什么?",
        "output": "select ?x where { <皮肌炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎患者应在什么科室就诊？",
        "output": "select ?x where { <皮肌炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肌炎涉及什么项目的检查？",
        "output": "select ?x where { <皮肌炎> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎属于什么?",
        "output": "select ?x where { <衣原体肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎患者应在什么科室就诊？",
        "output": "select ?x where { <衣原体肺炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎的同义词是什么？",
        "output": "select ?x where { <衣原体肺炎> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎涉及什么项目的检查？",
        "output": "select ?x where { <衣原体肺炎> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "衣原体肺炎涉及到的症状有什么？",
        "output": "select ?x where { <衣原体肺炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管炎属于什么？",
        "output": "select ?x where { <血管炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "病毒性肺炎是什么类型？",
        "output": "select ?x where { <病毒性肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌性肺炎是什么类型？",
        "output": "select ?x where { <细菌性肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "社区获得性肺炎属于什么类型？",
        "output": "select ?x where { <社区获得性肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "社区获得性肺炎患者应在什么科室就诊？",
        "output": "select ?x where { <社区获得性肺炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液属于什么类型？",
        "output": "select ?x where { <胸腔积液> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液患者应在什么科室就诊？",
        "output": "select ?x where { <胸腔积液> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液的同义词是什么？",
        "output": "select ?x where { <胸腔积液> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液涉及到的症状有什么？",
        "output": "select ?x where { <胸腔积液> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胸腔积液与什么疾病有关？",
        "output": "select ?x where { <胸腔积液> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌感染属于什么？",
        "output": "select ?x where { <细菌感染> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌感染患者应在什么科室就诊？",
        "output": "select ?x where { <细菌感染> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌感染涉及到的症状有哪些？",
        "output": "select ?x where { <细菌感染> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "细菌感染与什么疾病有关？",
        "output": "select ?x where { <细菌感染> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痞满属于什么？",
        "output": "select ?x where { <痞满> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素不敏感综合征属于什么类型？",
        "output": "select ?x where { <糖皮质激素不敏感综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素不敏感综合征属于什么科？",
        "output": "select ?x where { <糖皮质激素不敏感综合征> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "与糖皮质激素不敏感综合征相近的词是什么？",
        "output": "select ?x where { <糖皮质激素不敏感综合征> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素性青光眼属于什么类型？",
        "output": "select ?x where { <糖皮质激素性青光眼> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素性青光眼属于什么科？",
        "output": "select ?x where { <糖皮质激素性青光眼> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖皮质激素性青光眼的同义词是什么？",
        "output": "select ?x where { <糖皮质激素性青光眼> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恶性肿瘤中性粒细胞缺乏并发热属于什么类型？",
        "output": "select ?x where { <恶性肿瘤中性粒细胞缺乏并发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恶性肿瘤中性粒细胞缺乏并发热属于什么科？",
        "output": "select ?x where { <恶性肿瘤中性粒细胞缺乏并发热> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性发热性嗜中性皮肤病属于什么类型？",
        "output": "select ?x where { <急性发热性嗜中性皮肤病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性发热性嗜中性皮肤病属于什么科？",
        "output": "select ?x where { <急性发热性嗜中性皮肤病> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性发热性嗜中性皮肤病的同义词是什么？",
        "output": "select ?x where { <急性发热性嗜中性皮肤病> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "经行发热属于什么?",
        "output": "select ?x where { <经行发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "内伤发热属于什么?",
        "output": "select ?x where { <内伤发热> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "子宫收缩乏力属于什么?",
        "output": "select ?x where { <子宫收缩乏力> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "子宫收缩乏力属于什么科？",
        "output": "select ?x where { <子宫收缩乏力> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "子宫收缩乏力的同义词是什么？",
        "output": "select ?x where { <子宫收缩乏力> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "烧伤后腹泻属于什么?",
        "output": "select ?x where { <烧伤后腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "烧伤后腹泻属于什么科？",
        "output": "select ?x where { <烧伤后腹泻> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性腹泻属于什么类型?",
        "output": "select ?x where { <慢性腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性腹泻属于什么科？",
        "output": "select ?x where { <慢性腹泻> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性腹泻病属于什么类型?",
        "output": "select ?x where { <非感染性腹泻病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非感染性腹泻病属于什么科？",
        "output": "select ?x where { <非感染性腹泻病> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胰致腹泻瘤属于什么类型?",
        "output": "select ?x where { <胰致腹泻瘤> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胰致腹泻瘤属于什么科？",
        "output": "select ?x where { <胰致腹泻瘤> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "胰致腹泻瘤的同义词是什么？",
        "output": "select ?x where { <胰致腹泻瘤> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "婴儿腹泻是什么？",
        "output": "select ?x where { <婴儿腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "腹泻疾病属于什么类型?",
        "output": "select ?x where { <腹泻疾病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "婴幼儿腹泻属于什么类型?",
        "output": "select ?x where { <婴幼儿腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿流行性腹泻属于什么类型?",
        "output": "select ?x where { <新生儿流行性腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿迁延与慢性腹泻属于什么类型?",
        "output": "select ?x where { <小儿迁延与慢性腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "旅行者腹泻属于什么类型?",
        "output": "select ?x where { <旅行者腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "热带性口炎性腹泻属于什么类型?",
        "output": "select ?x where { <热带性口炎性腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "星状病毒性腹泻属于什么类型?",
        "output": "select ?x where { <星状病毒性腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿腹泻属于什么类型?",
        "output": "select ?x where { <小儿腹泻> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老年人急性呼吸窘迫综合征属于什么类型?",
        "output": "select ?x where { <老年人急性呼吸窘迫综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老年人急性呼吸窘迫综合征涉及什么检查项目？",
        "output": "select ?x where { <老年人急性呼吸窘迫综合征> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "小儿急性呼吸窘迫综合征属于什么类型?",
        "output": "select ?x where { <小儿急性呼吸窘迫综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿晚期代谢性酸中毒属于什么类型?",
        "output": "select ?x where { <新生儿晚期代谢性酸中毒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿晚期代谢性酸中毒涉及什么检查项目？",
        "output": "select ?x where { <新生儿晚期代谢性酸中毒> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老年人代谢性酸中毒属于什么类型?",
        "output": "select ?x where { <老年人代谢性酸中毒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "老年人代谢性酸中毒涉及什么检查项目？",
        "output": "select ?x where { <老年人代谢性酸中毒> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿迟发性代谢性酸中毒属于什么类型?",
        "output": "select ?x where { <新生儿迟发性代谢性酸中毒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "新生儿迟发性代谢性酸中毒涉及什么检查项目？",
        "output": "select ?x where { <新生儿迟发性代谢性酸中毒> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支原体肺炎属于什么类型?",
        "output": "select ?x where { <支原体肺炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支原体肺炎属于什么科？",
        "output": "select ?x where { <支原体肺炎> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支原体肺炎的同义词是什么？",
        "output": "select ?x where { <支原体肺炎> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "支原体肺炎会涉及什么症状？",
        "output": "select ?x where { <支原体肺炎> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "炭疽病属于什么类型?",
        "output": "select ?x where { <炭疽病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "炭疽病有什么症状？",
        "output": "select ?x where { <炭疽病> <症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "营养不良属于什么类型?",
        "output": "select ?x where { <营养不良> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非特异性阴道炎属于什么类型?",
        "output": "select ?x where { <非特异性阴道炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺动脉高压属于什么类型?",
        "output": "select ?x where { <肺动脉高压> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "毛周角化病属于什么类型?",
        "output": "select ?x where { <毛周角化病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "疖子属于什么类型?",
        "output": "select ?x where { <疖子> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心力衰竭属于什么?",
        "output": "select ?x where { <心力衰竭> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心力衰竭涉及哪些症状？",
        "output": "select ?x where { <心力衰竭> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心力衰竭与什么疾病有关？",
        "output": "select ?x where { <心力衰竭> <涉及疾病> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "动脉导管未闭属于什么类型?",
        "output": "select ?x where { <动脉导管未闭> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "充血性心力衰竭属于什么类型?",
        "output": "select ?x where { <充血性心力衰竭> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑梗死属于什么类型?",
        "output": "select ?x where { <脑梗死> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百日咳属于什么类型?",
        "output": "select ?x where { <百日咳> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百日咳要去哪个科室？",
        "output": "select ?x where { <百日咳> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百日咳的同义词是什么？",
        "output": "select ?x where { <百日咳> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百日咳涉及什么检查科目？",
        "output": "select ?x where { <百日咳> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "百日咳涉及哪些症状？",
        "output": "select ?x where { <百日咳> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "金钱癣属于什么?",
        "output": "select ?x where { <金钱癣> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑疝属于什么?",
        "output": "select ?x where { <脑疝> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "性欲减退属于什么?",
        "output": "select ?x where { <性欲减退> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "甲癣在什么科室就诊？",
        "output": "select ?x where { <甲癣> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻咽癌属于什么?",
        "output": "select ?x where { <鼻咽癌> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻咽癌在什么科室就诊？",
        "output": "select ?x where { <鼻咽癌> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻咽癌的同义词是什么？",
        "output": "select ?x where { <鼻咽癌> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "鼻咽癌涉及哪些症状？",
        "output": "select ?x where { <鼻咽癌> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "房性早搏属于什么?",
        "output": "select ?x where { <房性早搏> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "子宫内膜炎属于什么?",
        "output": "select ?x where { <子宫内膜炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "糖尿病酮症酸中毒属于什么?",
        "output": "select ?x where { <糖尿病酮症酸中毒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "硬皮病属于什么?",
        "output": "select ?x where { <硬皮病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "桃花癣属于什么?",
        "output": "select ?x where { <桃花癣> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "食管癌属于什么?",
        "output": "select ?x where { <食管癌> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "食管癌患者在什么科室就诊？",
        "output": "select ?x where { <食管癌> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "食管癌的同义词是什么？",
        "output": "select ?x where { <食管癌> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "食管癌涉及哪些症状？",
        "output": "select ?x where { <食管癌> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肤癣菌病属于什么?",
        "output": "select ?x where { <皮肤癣菌病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "皮肤癣菌病在什么科室就诊？",
        "output": "select ?x where { <皮肤癣菌病> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肝纤维化属于什么?",
        "output": "select ?x where { <肝纤维化> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "牛皮癣属于什么?",
        "output": "select ?x where { <牛皮癣> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阴虱病在什么科室就诊？",
        "output": "select ?x where { <阴虱病> <就诊科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性鼻炎属于什么?",
        "output": "select ?x where { <慢性鼻炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "慢性支气管炎属于什么?",
        "output": "select ?x where { <慢性支气管炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脑出血属于什么?",
        "output": "select ?x where { <脑出血> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "周围神经病属于什么?",
        "output": "select ?x where { <周围神经病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "椎管狭窄属于什么?",
        "output": "select ?x where { <椎管狭窄> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性淋巴细胞白血病属于什么?",
        "output": "select ?x where { <急性淋巴细胞白血病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性淋巴细胞白血病属于什么科？",
        "output": "select ?x where { <急性淋巴细胞白血病> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性淋巴细胞白血病的同义词是什么？",
        "output": "select ?x where { <急性淋巴细胞白血病> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性淋巴细胞白血病涉及哪些检查项目？",
        "output": "select ?x where { <急性淋巴细胞白血病> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "急性淋巴细胞白血病涉及哪些症状？",
        "output": "select ?x where { <急性淋巴细胞白血病> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重症急性呼吸综合征属于什么?",
        "output": "select ?x where { <重症急性呼吸综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "重症急性呼吸综合征涉及哪些检查项目？",
        "output": "select ?x where { <重症急性呼吸综合征> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "强迫症属于什么?",
        "output": "select ?x where { <强迫症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管神经性水肿属于什么?",
        "output": "select ?x where { <血管神经性水肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管神经性水肿属于什么科？",
        "output": "select ?x where { <血管神经性水肿> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管神经性水肿的同义词是什么？",
        "output": "select ?x where { <血管神经性水肿> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "血管神经性水肿涉及哪些症状？",
        "output": "select ?x where { <血管神经性水肿> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心脏病属于什么?",
        "output": "select ?x where { <心脏病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "泪道堵塞属于什么?",
        "output": "select ?x where { <泪道堵塞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "先天性腭裂属于什么?",
        "output": "select ?x where { <先天性腭裂> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "视网膜脱离属于什么?",
        "output": "select ?x where { <视网膜脱离> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "恙虫病的病因是什么？",
        "output": "select ?x where { <恙虫病> <常见病因> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非典属于什么?",
        "output": "select ?x where { <非典> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "非典涉及什么检查？",
        "output": "select ?x where { <非典> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "窦性心律失常属于什么?",
        "output": "select ?x where { <窦性心律失常> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "霰粒肿属于什么?",
        "output": "select ?x where { <霰粒肿> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "白血病属于什么?",
        "output": "select ?x where { <白血病> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "白血病涉及什么检查？",
        "output": "select ?x where { <白血病> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "扁平足属于什么?",
        "output": "select ?x where { <扁平足> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "阿-斯综合征属于什么?",
        "output": "select ?x where { <阿-斯综合征> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脚气属于什么?",
        "output": "select ?x where { <脚气> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "心衰属于什么?",
        "output": "select ?x where { <心衰> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "室性早搏属于什么?",
        "output": "select ?x where { <室性早搏> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痄腮属于什么?",
        "output": "select ?x where { <痄腮> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "性功能障碍属于什么?",
        "output": "select ?x where { <性功能障碍> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "自然流产属于什么?",
        "output": "select ?x where { <自然流产> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "自然流产需要去什么科就诊？",
        "output": "select ?x where { <自然流产> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "自然流产涉及什么症状？",
        "output": "select ?x where { <自然流产> <涉及症状> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "低钾血症属于什么?",
        "output": "select ?x where { <低钾血症> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伤寒属于什么?",
        "output": "select ?x where { <伤寒> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "什么能预防伤寒？",
        "output": "select ?x where { <伤寒> <预防> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "伤寒要去哪个科室就诊？",
        "output": "select ?x where { <伤寒> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "痣细胞痣属于什么?",
        "output": "select ?x where { <痣细胞痣> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "脊柱炎属于什么?",
        "output": "select ?x where { <脊柱炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水痘属于什么?",
        "output": "select ?x where { <水痘> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水痘要去什么科？",
        "output": "select ?x where { <水痘> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水痘的同义词有哪些？",
        "output": "select ?x where { <水痘> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "水痘涉及什么检查？",
        "output": "select ?x where { <水痘> <涉及检查> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "激素性皮炎属于什么?",
        "output": "select ?x where { <激素性皮炎> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "黑色素瘤属于什么?",
        "output": "select ?x where { <黑色素瘤> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺栓塞属于什么?",
        "output": "select ?x where { <肺栓塞> <类型> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺栓塞属于什么科?",
        "output": "select ?x where { <肺栓塞> <科室> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺栓塞的同义词是什么？",
        "output": "select ?x where { <肺栓塞> <同义词> ?x. }"
    },
    {
        "instruction": "生成一个 SPARQL 查询，检索与以下给定问题对应的信息：",
        "input": "肺栓塞涉及什么检查？",
        "output": "select ?x where { <肺栓塞> <涉及检查> ?x. }"
    }
]